[
  {
    "title": "Repairs to Masab Tank flyover slows down traffic",
    "link": "https://www.thehindu.com/news/national/telangana/repairs-to-masab-tank-flyover-slows-down-traffic/article69811624.ece",
    "published": "Tue, 15 Jul 2025 00:24:50 +0530",
    "author": "",
    "summary": "Repairs to Masab Tank flyover slows down traffic",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Traffic jams have become a daily occurrence on the Masab Tank flyover due to the ongoing repair and restoration works. During peak hours, the stream of vehicles could be seen stuck from the flyover up to the PVNR Expressway staring at Mehdipatnam.\nBesides, commuters, who have no inkling of the works, are horrified at the bumpy rides and loud noise while travelling on the flyover.\nThe Greater Hyderabad Municipal Corporation (GHMC) has chosen to carry out the repair works during night in order not to disturb the traffic flow during the day.\nAs per information gathered from the Engineering wing officials, the repairs have been taken up to replace the strip seal joints, in order to arrest water leakage, and damage of the road at joints.\nWork for repairs and restoration of age old flyovers in the city is being taken up by GHMC for some time. Already, the flyovers at Lalapet and Jamia Osmania railway station had been restored, after prolonged repair works which took well over six months. In both cases, traffic was completely stopped on the side of the road where repairs were being taken up.\nHowever, in case of the Masab Tank flyover, it was not possible, officials said, because even with the flyover in place, the traffic crawls irrespective of the time of the day. Without the flyover, it would be mayhem.\n“Repairs are being carried out  at night, while the portion under repair is covered up using iron sheets during the day time to facilitate traffic,” an official shared.\nTenders for the strip seal joint restoration were called during January-February this year, and reportedly finalised with an estimated cost of ₹48 lakh.\nMasab Tank flyover is 24 years old, and one among the first generation flyovers in the city along with the ones built at Narayanguda, Basheerbagh, and Tarnaka.\nWhile the average running age of a flyover is around 30-40 years, this structure has started crumbling even before it could complete 25 years, forcing the authorities to expedite the repair works. In comparison, for Khairatabad flyover, which was built in 1986, no repair works have been taken up so far despite vehicles experiencing bumpy rides.\nMaintenance wing officials have issued an internal circular with instructions for review of all the old flyovers in the city to assess the structural stability, and take up repair works wherever the intended load carrying capacity was not matching.\nOfficials said twenty-four flyovers have been chosen for the assessment, which include those at Khairatabad, Basheerbagh, Narayanguda, Secunderabad, Punjagutta, Begumpet, Tarnaka, Fatehnagar, Nalgonda Crossroads, Moosapet, Seetaphalmandi, Greenlands, Secretariat, and others.\nInspections need to be conducted, and based on the reports, maintenance operations may be taken up such as replacement of expansion joints and distressed bearings, treatment of damaged girders and cracked sections, grouting, RCC repairs, and application of anti-carbonation paint to protect exposed surfaces."
  },
  {
    "title": "DMDK general secretary Premallatha to tour T.N. from August 3",
    "link": "https://www.thehindu.com/news/national/tamil-nadu/dmdk-general-secretary-premallatha-to-tour-tn-from-august-3/article69811662.ece",
    "published": "Tue, 15 Jul 2025 00:23:12 +0530",
    "author": "",
    "summary": "DMDK general secretary Premallatha Vijayakant embarks on State-wide tour to meet voters and party workers, boosting party morale.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "DMDK general secretary Premallatha Vijayakant will embark on the first phase of her State-wide tour to meet the voters and booth committee agents of the party from August 3, the party announced on Monday.\nShe will kickstart the tour from Tiruvallur and travel across northern and western districts. The first phase will be wrapped up in Chengalpattu on August 23.\nSources in the party said that former general secretary and party founder Vijayakant, had undertaken a similar tour in 2017 to appraise the actual strength of the party at the grassroots.\n“It has been a while since the leader of the party met the party cadre. Our general secretary will meet the people and the party workers to understand their point of view. The party cadre will feel energised by this tour,” said former MLA and DMDK’s deputy general secretary B. Parthasarathy.\nFurthermore, sources added that the exercise was necessary as it would reveal the extent to which the party’s support base has got eroded and help towards restoring it.\nMs. Premallatha’s decision to meet the party workers and enthuse them was to prepare for the grand public rally planned in Cuddalore on January 9.\nWith DMDK believed to be keeping their options open, Ms. Premallatha has said that they would make their position clear on the alliance in the public rally on January 9, even after the AIADMK allotted a Rajya Sabha seat to it and announced that the alliance between both the parties would continue.\nMs. Premallatha’s son V. Vijaya Prabhakaran, who has been promoted as the young face of the party recently and appointed as Youth Wing Secretary, is also expected to accompany her in the tour after narrowly losing the Virudhunagar Parliamentary constituency in 2024 Lok Sabha election."
  },
  {
    "title": "Governor R.N. Ravi, Chief Minister M.K. Stalin, and other leaders condole Saroja Devi’s death",
    "link": "https://www.thehindu.com/news/national/tamil-nadu/governor-rn-ravi-chief-minister-mk-stalin-and-other-leaders-condole-saroja-devis-death/article69811538.ece",
    "published": "Tue, 15 Jul 2025 00:17:58 +0530",
    "author": "",
    "summary": "Tamil Nadu leaders and politicians pay tribute to legendary actress Saroja Devi, highlighting her iconic contributions to Indian cinema.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/5m3zw7/article69812482.ece/alternates/LANDSCAPE_1200/PTI07_14_2025_000232A.jpg",
    "content": "Tamil Nadu Governor R.N. Ravi and Chief Minister M.K. Stalin condoled thedeath of actor Saroja Devi, who passed away in Bengaluru on Monday.\nIn a social media post, the Raj Bhavan quoted the Governor as saying: “Deeply saddened by the demise of legendary actress Saroja Devi, whose luminous presence and expressive artistry transcended language and time, leaving an indelible mark on Indian cinema. Her timeless contributions shaped a golden era of film and continue to resonate across generations. My heartfelt condolences to her family and countless admirers. Om Shanti!”\nIn his condolence message, Mr. Stalin recalled she had acted in about 200 films and her contributions to Indian cinema were honoured with the Padma Shri, Padma Bhushan, and the Government of India’s Lifetime Achievement Award, Tamil Nadu government’s Kalaimamani award, among others. Her death was an irreparable loss, Mr. Stalin said.\nAIADMK general secretary Edappadi K. Palaniswami recalled Saroja Devi’s association with party founder M.G. Ramachandran in the Tamil film industry. ADMK Workers’ Rights Retrieval Committee coordinator O. Panneerselvam said the actor held former Chief Minister Jayalalithaa in high esteem.\nUnion Minister of State for Information and Broadcasting L. Murugan, BJP Tamil Nadu president Nainar Nagendran, and  Tamil Maanila Congress (Moopanar) president G.K. Vasan also extended their condolences."
  },
  {
    "title": "Death of children due to rabies points to need for pre-exposure prophylaxis vaccination",
    "link": "https://www.thehindu.com/news/national/kerala/death-of-children-due-to-rabies-points-to-need-for-pre-exposure-prophylaxis-vaccination/article69811505.ece",
    "published": "Tue, 15 Jul 2025 00:16:26 +0530",
    "author": "",
    "summary": "Recent rabies deaths of children in Kerala highlight the urgent need for pre-exposure prophylaxis to protect against rabies.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "The recent deaths of three young girls following rabies, in separate incidents in Pathanamthitta, Malappuram and Kollam, in spite of post-exposure prophylaxis with anti-rabies vaccine as well as rabies immunoglobulin, have yet again brought attention to the need to protect children with pre-exposure prophylaxis vaccination.\nPre-exposure prophylaxis for children in a highly rabies-endemic State like Kerala, where the number of human rabies deaths have been increasing, was a strategy recommended as a short-term priority—to be achieved in 1.5 years—by the B. Ekbal committee that framed the State Vaccine Policy in November 2022.\nThe detailed field investigation into the recent rabies deaths of children by the Health department, in association with the National Centre for Disease Control, Central Drugs Standards Control Organisation, the State Public Health Lab and the district surveillance units, had looked into all aspects of the case, including the nature of animal bite, the timeliness of interventions, adherence to standard protocols, vaccine cold chain, techniques of vaccine administration, training for staff and public awareness of prophylaxis .\nThe report, which was submitted by the Director of Health Services to the Kerala State Commission for Protection of Child Rights last week following a petition filed by advocate Kulathoor Jaising points out that all three children had sustained severe, deep Category 3 dog bites in highly innervated areas as the head, neck and upper limb, resulting in direct inoculation of the virus into the nerves, thus rendering the administered immunoglobulin and vaccine ineffective\nIn one case, the child had been bitten by the neighbour’s  pet dog and despite taking vaccine and immunoglobulin, she had developed rabies symptoms three months later. In two other cases, there were delays in care seeking, but which was likely due to the distance to the health facility, non-availability of rabies immunoglobulin at the taluk hospital or public health centre and lack of awareness about the importance of wound washing.\n“Because of their small size, children fall down when a rabid dog attacks them, making them vulnerable to repeated bites, which are invariably  Category 3 bites (face, head, neck or hand where there is a concentration of nerve fibres). When the wounds are deep, more nerve fibres are exposed and the virus enters the nervous system directly,” public health experts point out.\nThere could be unanticipated delays in getting proper treatment. But if a child has been given pre-exposure prophylaxis, rabies antibodies are already there in the body to fight the virus, if he/she sustains an animal bite later. A child who has been given pre-exposure prophylaxis will not need rabies immunoglobulin after an animal bite and even the post-exposure vaccination can be contained to two doses.\nThe report submitted by the DHS makes it clear that people dying despite taking post-exposure anti-rabies vaccination is a regular occurrence in the State."
  },
  {
    "title": "A.P. CM tells officials to crack the whip on sale of illicit liquor",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/ap-cm-tells-officials-to-crack-the-whip-on-sale-of-illicit-liquor/article69811143.ece",
    "published": "Tue, 15 Jul 2025 00:14:57 +0530",
    "author": "",
    "summary": "Vijayawada CM N. Chandrababu Naidu cracks down on fake liquor brands, boosts revenues, and promotes tourism through new liquor policy.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/lcz9j4/article69811541.ece/alternates/LANDSCAPE_1200/10745_26_6_2025_19_9_15_1_IMG_20250626_WA0086.JPG",
    "content": "Andhra Pradesh Chief Minister N. Chandrababu Naidu has ordered the Excise Department officials to stop the sale of liquor brands that found their way into the market through dubious channels and to ensure that only national and international quality brands are available to the consumers.\nNoting that the market was flooded with fake liquor brands, which posed grave health hazards during the YSR Congress Party’s (YSRCP) tenure, the Chief Minister also wanted the officials to crack down on the sales of non-duty paid liquor or illicit brews.\nAddressing a review meeting on the Excise Department on Monday, Mr. Naidu said that the fake liquor brands caused a huge dent to the public exchequer, besides spoiling the health of lakhs of consumers.\n“The new liquor policy being implemented by the NDA government has given a boost to revenues, which used to flow into the neighbouring States during the YSRCP’s tenure. The liquor brands that used to be made in distilleries that belonged to the YSRCP leaders have vanished now,” Mr. Naidu said.\nThe Officials informed the Chief Minister that ‘anonymous liquor brands’ were no longer available and that all the leading brands are being sold now. Up to 68% of the liquor in the market consisted of unbranded products previously.\nMr. Naidu said that liquor prices had fallen for the first time in the history of the Excise Department after the NDA government assumned the office.\nThe officials said that prices had been reduced by ₹10 to ₹100, depending on the brand and that the prices of the top 30 liquor brands in the State were lowered when compared to the prices in the neighbouring States of Telangana, Karnataka and Tamil Nadu.\nMr. Naidu instructed the officials to take a decision on allowing permit rooms after the committee constituted by the government submitted its recommendation. The officials pointed out that the lack of permit rooms was encouraging people to consume liquor in public places, which was affecting the law and order.\nHe asked the officials to permit setting up microbreweries at tourist places to encourage tourism, and to do real-time tracking of vehicle movements from distilleries to the Andhra Pradesh Beverages Corporation and from there to retail stores, by using modern technologies.\nEvery vehicle transporting liquor stock should be equipped with GPS devices, he added.\nBesides, the Chief Minister called for the promotion of digital payments and stressed the need for tighter vigil aimed at curbing the menace of belt shops.\nExcise Department Principal Secretary Mukesh Kumar Meena and other senior officials took part in the review meeting."
  },
  {
    "title": "A.P. govt. to guarantee for ₹1,000-crore loan for developing seven airports",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/ap-govt-to-guarantee-for-1000-crore-loan-for-developing-seven-airports/article69810887.ece",
    "published": "Tue, 15 Jul 2025 00:11:04 +0530",
    "author": "",
    "summary": "Government guarantees Rs.1,000 crore loan for AP airports development, including greenfield airports at Kuppam, Dagadarthi, Srikakulam, and Amaravati.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "The Andhra Pradesh government on Monday agreed to give guarantee to the Andhra Pradesh Airports Development Corporation Limited (APADCL) for obtaining ₹1,000 crore as loan to undertake the development of airports at Kuppam, Dagadarthi and Srikakulam —for land acquisition and external infrastructure creation— and Amaravati (for external infrastructure), and to extend Viability Gap Funding (VGF) support for airports and clear the urgent pending liabilities of the APADCL.\nThe G.O Ms. No.8 issued by Secretary (Infrastructure & Investment- Airports) N. Yuvaraj said that the government intended to develop eight greenfield airports at Srikakulam, Bhogapuram, Tuni-Annavaram, Tadepalligudem, Ongole, Kuppam, Dagadarthi and Nagarjuna Sagar, besides operationalising the international airport at Bhogapuram, for enhancing air connectivity and supporting regional economic growth.\nThe government also desired to establish a greenfield international airport at Amaravati.\nIn response a proposal made by the APADCL MD in this regard, the government accorded in-principle administrative sanction for ₹1,570.64 crore to acquire land for developing the above airports.\nIt also directed the MD to approach financial institutions for mobilising the funds. Accordingly, the MD submitted that the development of Kuppam, Dagadarthi, Srikakulam and Amaravati airports was being taken up under Phase - 1.\nIt was further mentioned that the Techno-Economic Feasibility Report (TeFR) study has been completed for Kuppam and Dagadarthi airports, while the same is in progress for the remaining two airports.\nThe MD sought ‘shortfall government guarantee’ for securing ₹1,000 crore loan from the HUDCO for developing the airports."
  },
  {
    "title": "Tussle during cricket match leads to the death of student in Bobbili",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/tussle-during-cricket-match-leads-to-the-death-of-student-in-bobbili/article69812179.ece",
    "published": "Tue, 15 Jul 2025 00:08:34 +0530",
    "author": "",
    "summary": "Private college student dies after being beaten by peer, leading to police investigation and parents filing complaint.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "VIZIANAGARAM\nA private college student, Sundarada Karteek, died after he was beaten up by another boy from the college at Bobbili in Vizianagaram district on Monday. According to police, there was a tussle among the students while playing a cricket match on Sunday. The accused had a grudge against Karteek and beat him up severely in the college premises, again on Monday, leading to his death.\nKarteek collapsed and was shifted to the nearby hospital for treatment. The doctors declared that he was ‘brought dead’. Shocked by the incident, Karteek’s parents lodged a complaint against the other boy, who is said to be a minor. Circle Inspector (CI) Satish visited the college premises and questioned representatives of the college management, parents, and students."
  },
  {
    "title": "Headmistress of elementary school suspended over video of 3 students cleaning toilet",
    "link": "https://www.thehindu.com/news/national/tamil-nadu/headmistress-of-elementary-school-suspended-over-video-of-3-students-cleaning-toilet/article69811245.ece",
    "published": "Tue, 15 Jul 2025 00:08:26 +0530",
    "author": "",
    "summary": "Headmistress suspended after students clean school toilet, inquiry conducted by officials in Pudukkottai district.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "The headmistress of a panchayat union elementary school at Namanasamudram Kudiyiruppu in Pudukkottai district was suspended on Monday after a video of three students cleaning the school toilet was shared on a social media platform a few days ago. The action was taken based on an inquiry conducted by the School Education Department officials, on the instructions of the District Collector.\nThe video clip showed one student cleaning with a broom, while the other student carrying water in a bucket, and pouring it inside. The third student is seen fetching water in a bucket.\nThe Chief Educational Officer, Pudukkottai, and the Revenue Divisional Officer, Aranthangi, visited the school on Saturday to conduct inquiries. The District Educational Officer (Elementary), Aranthangi, accompanied by the Block Educational Officer, Arimalam, inspected the school on Monday morning and conducted detailed inquiries with the students and their parents, the teacher, the cook, the sanitary worker, and the school management committee. The school has a little over 20 students.\nThe inquiry lasted over two hours on the school premises, and a report was submitted to the Chief Educational Officer to initiate necessary action. The sources said the Headmistress of the elementary school Kala was placed under suspension for allowing the incident to happen in the school which has a temporary sanitary worker, the sources said."
  },
  {
    "title": "Stalin daydreaming about winning 200 seats in 2026 Assembly poll, says Palaniswami",
    "link": "https://www.thehindu.com/news/national/tamil-nadu/stalin-daydreaming-about-winning-200-seats-in-2026-assembly-poll-says-palaniswami/article69811206.ece",
    "published": "Tue, 15 Jul 2025 00:03:42 +0530",
    "author": "",
    "summary": "AIADMK's Edappadi K. Palaniswami criticizes DMK's M.K. Stalin, predicts AIADMK-led coalition victory in 2026 Assembly poll.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/7o821e/article69812474.ece/alternates/LANDSCAPE_1200/9868_14_7_2025_11_36_6_3_PRESS_3.JPG",
    "content": "AIADMK general secretary Edappadi K. Palaniswami, on Monday said DMK president and Chief Minister M.K. Stalin was daydreaming of the DMK-led coalition winning over 200 seats in the 2026 Assembly poll.\nAddressing a meeting at Vadalur, he said, “He (Mr. Stalin) is day-dreaming about it. It is the AIADMK-led front that will win 210 seats and form the next government in the State after the 2026 poll.”\nReferring to the Tamil Nadu government appointing four senior bureaucrats as its official spokespersons to disseminate information on government schemes and initiatives to the public, Mr. Palaniswami said this was an attempt to hoodwink the people. “If these officers indulged in dissemination of information on schemes of the DMK government, who would take care of their usual administrative duties?” he asked.\nNormally, this should be done by the Directorate of Information and Public Relations, which was headed by a Minister. He appealed to the four bureaucrats to furnish only the truth. If the officers indulged in spreading wrong information or misinformation to please the powers that be, they would be answerable after the AIADMK comes to power in 2026, he said.\nMr. Palaniswami also accused the the DMK of neglecting farmers and not fulfilling many of its assurances for the farm sector in the last four years. The government had not fulfilled its assurances of procuring sugar cane at ₹4,000 a tonne and paddy at ₹2,500 a quintal.\nHe said representatives of farmers’ associations had submitted a petition to him earlier in the day complaining the Perumal tank was not properly desilted. Alleging only a portion of the Perumal tank in the district was desilted, he said a probe would be ordered after the AIADMK comes to power."
  },
  {
    "title": "Autorickshaw fares hiked in Bengaluru; new rates effective August 1",
    "link": "https://www.thehindu.com/news/national/karnataka/autorickshaw-fares-hiked-in-bengaluru-new-rates-effective-august-1/article69812450.ece",
    "published": "Mon, 14 Jul 2025 23:50:35 +0530",
    "author": "",
    "summary": "Bengaluru auto fares hiked, effective August 1, with increased minimum fare, per-km charge, night surcharge, baggage, and waiting charges.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/er8otq/article69812463.ece/alternates/LANDSCAPE_1200/IMG_Auto_Rickshaw_2_1_7LDOAKEF.jpg",
    "content": "In a blow to autorickshaw users, the Regional Transport Authority (RTA) of Bengaluru Urban district has revised the auto fares within city limits, with the updated rates taking effect from August 1.\nBengaluru Urban Deputy Commissioner G. Jagadeesha confirmed toThe Hinduthat the minimum fare has been increased to ₹36 for the initial 2 km, up from the current ₹30. The per-km charge beyond the first 2 km has also gone up from ₹15 to ₹18.\nCommuters travelling between 10 p.m. and 5 a.m. will now pay 50% more as part of the night fare surcharge. The latest order, dated July 14, also outlines changes in baggage and waiting charges. Passengers can carry up to 20 kg of luggage at no additional cost. Beyond this, a fee of ₹10 will be charged for every 20 kg or part thereof, with a maximum luggage limit capped at 50 kg.\nWaiting time will be free for the first five minutes. Post that, a fee of ₹10 will be levied for every 15 minutes of delay.\nThe order states that all autorickshaws must visibly display the revised fare chart. In addition, auto drivers are required to recalibrate and verify their fare metres by October 31 to align with the new pricing structure.\nThis revision comes after a long-standing demand from auto drivers, who have cited rising fuel costs, general inflation, and increased living expenses as reasons for a fare hike. The last revision to auto fares in the city was made in 2021."
  },
  {
    "title": "Fire breaks out at Kattakada fast-track court storeroom",
    "link": "https://www.thehindu.com/news/national/kerala/fire-breaks-out-at-kattakada-fast-track-court-storeroom/article69812425.ece",
    "published": "Mon, 14 Jul 2025 23:38:37 +0530",
    "author": "",
    "summary": "Fire and Rescue Station got information just after 9 p.m. about a fire in a three-storey building",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "A small fire broke out in a building that houses the fast-track POCSO court at Kattakada on Monday night.\nThe Fire and Rescue Station at Kattakada got information just after 9 p.m. about a fire in a three-storey building, on the second floor of which functioned the fast-track POCSO court. The third floor was used as a storeroom.\nIt was in one of the two rooms on the third floor that the fire broke out.\nThe Fire and Rescue Services had to break open a shutter to gain entry to this floor. A narrow corridor then led to the room where a lot of paperwork and material evidence from crimes was stored. The files and documents were slowly catching fire, but it was smoke that posed the bigger problem. Two firefighters had to don breathing apparatus to enter the room that had very little ventilation. They used water to douse the fire. The court had wound up for the day at 5 p.m. No signs of short-circuit could be seen, the Fire and Rescue Services said.\nThe police and the POCSO court judge also reached the location."
  },
  {
    "title": "114-year-old veteran marathon runner Fauja Singh dies in road accident in Jalandhar",
    "link": "https://www.thehindu.com/news/national/punjab/114-year-old-veteran-marathon-runner-fauja-singh-dies-in-road-accident-in-jalandhar/article69812434.ece",
    "published": "Mon, 14 Jul 2025 23:37:45 +0530",
    "author": "",
    "summary": "Legendary marathon runner Fauja Singh, aged 114, tragically passes away after being hit by a vehicle in Punjab.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/al2arz/article69812441.ece/alternates/LANDSCAPE_1200/IMG_Fauja_2_1_5E86KK3L.jpg",
    "content": "Veteran marathon runnerFauja Singhdied on Monday (July 14, 2025) after being hit by an unidentified vehicle while out for a walk in his native village in Punjab's Jalandhar district. He was 114.\nHis demise was confirmed by author Khushwant Singh, who spoke to Fauja Singh's family members.\nPunjab Governor and Chandigarh Administrator, Gulab Chand Kataria, said he was \"deeply saddened\" by the passing away of Fauja Singh.\n\"Deeply saddened by the passing of Sardar Fauja Singh Ji, the legendary marathon runner and symbol of resilience. At 114, he joined me in the 'Nasha Mukt, Rangla Punjab' march with unmatched spirit.\nHis legacy will continue to inspire a drug-free Punjab. Om Shanti Om,\" the governor posted on X.\nDeeply saddened by the passing of Sardar Fauja Singh Ji, the legendary marathon runner and symbol of resilience. At 114, he joined me in the 'Nasha Mukt – Rangla Punjab' march with unmatched spirit.His legacy will continue to inspire a drug-free Punjab.Om Shanti Om.pic.twitter.com/S6238AkDYu\nFauja Singh's biography, 'The Turbaned Tornado', was written by Khushwant Singh, a former state information commissioner of Punjab.\nFauja Singh crosses the finish line in a 100 meter race for centenarians in Toronto in 2011.\n                                                            | Photo Credit: \n                                AP\n\"My Turbaned Tornado is no more. It is with great sadness that I share the passing of my most revered S. Fauja Singh. He was struck by an unidentified vehicle around 3:30 pm today in his village, Bias, while crossing the road. Rest in peace, my dear Fauja,\" Khushwant posted on X.\nWhen contacted, Khushwant Singh said that he had spoken with Fauja Singh's family members, who confirmed the news of his death.\nFollowing the road accident, Fauja Singh, the long-distance runner, was taken to a private hospital in Jalandhar, where he succumbed to injuries."
  },
  {
    "title": "ECI trying to replicate ‘SIR’ in other States, alleges CPI(M) leader",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/eci-trying-to-replicate-sir-in-other-states-alleges-cpim-leader/article69812278.ece",
    "published": "Mon, 14 Jul 2025 23:29:50 +0530",
    "author": "",
    "summary": "CPI(M) Politburo member B.V. Raghavulu on Monday alleged that the ECI facilitated a backdoor citizenship registration process under the guise of voter enrolment in Bihar and sent letters to other States to replicate it even as the Supreme Court was looking into the matter.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/a8vd1c/article69812375.ece/alternates/LANDSCAPE_1200/vjkvg-cpim%203.JPG",
    "content": "CPI(M) Politburo member B.V. Raghavulu on Monday alleged that the Election Commission of India (ECI) facilitated a backdoor citizenship registration process under the guise of voter enrolment in Bihar and sent letters to other States to replicate it even as the Supreme Court was looking into the matter.\nAddressing the media here on Monday (July 14), Mr. Raghavulu said that the Special Identification Register (SIR) in Bihar was not supposed to ascertain the citizenship of people. He further alleged that the SIR process was clearly biased towards the BJP as the ECI pushed for a Bihar-style SIR in other States even before the apex court hearing on July 28.\nMr. Raghavulu also alleged that the Indian government yielded to pressure mounted by the U.S. government during the tariff negotiations. The tariffs which were likely to be in the 23%–25% range, despite the claims of a tough stand by the Indian government, would cause grave injustice to the farmers.\nImport of Genetically Modified (GM) wheat, corn, soy, and dairy products would harm 80 million dairy farmers in the country. The government kept quiet when U.S. President Donald Trump threatened to impose a 50% tariff on steel, and high tariffs on some other items/commodities, he added.\nMr. Raghavulu alleged that the government made secret deals for purchase of Boeing aircraft, helicopters, and nuclear reactors from the U.S.\nReacting to A.P. Deputy Chief Minister Pawan Kalyan’s comments on Hindi language, Mr. Raghavulu said that all languages were equal under the Constitution, and Hindi should not be imposed on someone. Mr. Kalyan is submissive to the BJP in this regard and his stand thereof is contradictory with the line taken by him earlier, the CPI(M) leader added."
  },
  {
    "title": "Govt. relaxes professor promotion in medical colleges",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/govt-relaxes-professor-promotion-in-medical-colleges/article69811975.ece",
    "published": "Mon, 14 Jul 2025 23:26:32 +0530",
    "author": "",
    "summary": "State government relaxes qualifications for professor promotion in medical colleges to address faculty shortages, facing opposition from healthcare professionals.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "In a move to address faculty shortages in government medical colleges, the State government has approved a one-time relaxation in the minimum qualifications required for promotion from associate professor to professor.\nAccording to an official release from the Department of Health, Medical Education and Family Welfare on Monday (July 14), Chief Minister N. Chandrababu Naidu approved the proposal to promote associate professors with one year of teaching experience, instead of the usual three years, to the rank of professor in government medical colleges.\n\nThe decision to fill the posts in both new and existing government medical colleges, a step considered vital for securing National Medical Commission (NMC) approval —mandatory for opening admissions in newly established government colleges for the academic year 2025–26.\nCurrently, professor posts vacancies are in the new medical colleges at Vizianagaram, Paderu, Rajamahendravaram, Eluru, Machilipatnam and Nandyal.\nMinister for Health, Medical Education and Family Welfare Satya Kumar Yadav has directed that the proposals to recruit professors and associate professors on a contract basis be deferred for now. He added that once promotions, in the above-mentioned manner, are completed, recruitment on a contract basis would be taken up as per requirement.\nIt may be noted that the contractual basis of recruitment has met with strong opposition from government healthcare professionals.\nIn a letter to the Health Minister on Sunday, A.P. Government Doctors’ Association have urged him to reconsider the decision to recruit professors on a contract basis. They say that the government is taking away the promotion opportunity of senior doctors, who have been waiting for a long time."
  },
  {
    "title": "Director of Dept. of Kannada and culture booked under SC/ST Act",
    "link": "https://www.thehindu.com/news/national/karnataka/director-of-dept-of-kannada-and-culture-booked-under-scst-act/article69812317.ece",
    "published": "Mon, 14 Jul 2025 23:16:27 +0530",
    "author": "",
    "summary": "FIR filed against Director for abusing Dalit artist, charged under SC/ST Act, police investigating for further action.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "The SJ Park police on Monday registered an FIR against the Director of the Department of  Kannada and Culture for allegedly abusing a Dalit artist at her office, when the latter approached her to claim the remuneration due to him.\nBased on the complaint filed by 55-year-old Jogila Siddaraju, the police registered the case against K.M. Gayathri, charging her under various sections of the Scheduled Castes/Scheduled Tribes (Prevention of Atrocities) Act, and for voluntarily causing hurt and intentional insult with intent to provoke breach of peace under the BNS.\nAccording to the complaint, on July 11, Siddaraju visited the director’s office for pending remuneration to artists for three years. However, he was allegedly abused after the director found out that he was a Dalit.\nWhen Siddaraju warned Gayathri that he would complain to the higher-ups, she allegedly threw a computer mouse pad at him and snatched the mobile phone of his associate who attempted to record the incident, Siddaraju said in his complaint.\nTaking serious objection to her behaviour, Siddaraju also said that a plea was submitted to the Chief Minister seeking action."
  },
  {
    "title": "Naidu orders the revival of FiberNet project",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/naidu-orders-the-revival-of-fibernet-project/article69812149.ece",
    "published": "Mon, 14 Jul 2025 23:15:39 +0530",
    "author": "",
    "summary": "Chief Minister N. Chandrababu Naidu aims to revive AP FiberNet project, highlighting mismanagement by YSR Congress Party.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/e8wvvq/article69812392.ece/alternates/LANDSCAPE_1200/IMG_10745_25_6_2025_19_4_1_1_1LEIJ952.jpg",
    "content": "Chief Minister N. Chandrababu Naidu directed the officials to revive the AP FiberNet project, which according to him was rendered defunct by the YSR Congress Party (YSRCP). Addressing a review meeting on AP FiberNet at the Secretariat on Monday, Mr. Naidu pointed out that while there were 8.70 lakh connections in 2019, the number fell to 4.50 lakh during the YSRCP regime.\nHe claimed that the TDP government had effectively managed the AP FiberNet with just 130 employees and provided over 8 lakh connections. The YSRCP government created unauthorised posts in the State FiberNet Limited to accommodate its party workers, which resulted in the workforce increasing steeply to 1,350 and misuse of public funds.\nMr. Naidu ordered that a thorough investigation should be done into those appointments and steps taken to rectify the past mistakes. He told the officials to increase the present 4,53,525 connections to at least 8 to 10 lakh.\nThe Chief Minister approved the integration of AP FiberNet with BharatNet (the amended BharatNet programme), under which the Central government would provide ₹1,900 crore to AP FiberNet from 2025 to 2035. He gave the nod for transition of fiber networks in 1,692 gram panchayats (GPs) across Chittoor and Visakhapatnam districts from linear to ring architecture, and connecting an additional 480 new GPs using the ring model.\nMr. Naidu also proposed the creation of a Special Purpose Vehicle jointly managed by the Central and State governments to oversee the FiberNet projects. Further, the Chief Minister emphasised the need to reintroduce services like virtual classrooms and strengthen the fiber network in rural and underserved areas and resolving pending issues with the local cable operators."
  },
  {
    "title": "Over 83% voters have submitted their enumeration forms as part of Bihar SIR, says Election Commission",
    "link": "https://www.thehindu.com/elections/bihar-assembly/over-83-voters-have-submitted-their-enumeration-forms-as-part-of-bihar-sir-says-election-commission/article69811338.ece",
    "published": "Mon, 14 Jul 2025 23:11:01 +0530",
    "author": "",
    "summary": "Election Commission of India updates on Bihar electoral rolls with 83.66% forms collected, deadline on July 25.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/g77bjx/article69812382.ece/alternates/LANDSCAPE_1200/BIHAR%20ELECTION%20SPECIAL%20INVESTIGATION%20REVISIONSIR%20%20to%20electoral%20roll%20%201.JPG",
    "content": "The Election Commission of India (ECI) on Monday (July 14, 2025) said that out of the 7.89 crore electors in Bihar, enumeration forms of 6.6 crore or 83.66% have been collected till date as part of the special intensive revision (SIR) of electoral rolls in Bihar.\nSo far, 1.59% electors have been found to be deceased, 2.2% permanently shifted and 0.73% persons were found to be enrolled at more than one place. Therefore, 88.18% of electors have either already submitted their enumeration form or died or retained their names at one place or permanently shifted out of their previous place of residence.\nAs a result, only 11.82% of electors now remain to submit their filled-in enumeration forms and many of them have sought time to submit these documents in the coming days, the EC said in an official statement.\nThe last date of submission of the filled enumeration forms is on July 25.\nThe poll body said nearly one lakh Booth Level Officers (BLO) will soon begin their third round of door-to-door visits. Their efforts are being augmented by the 1.5 lakh Booth Level Agents (BLA) appointed by all political parties, each one of whom can certify and submit up to 50 enumeration forms per day.\nTo ensure that no eligible urban voter is left out of the voters’ list, special camps are also being set up in all the 5,683 wards of all 261 urban local bodies (ULBs) of Bihar.\nFor the electors who may have temporarily migrated out of the State, focused efforts through newspaper advertisements and direct contact with such electors are being made to ensure that they are able to fill their enumeration forms well in time and have their names also included in the draft forms to be published on August 1. Such electors can easily fill up the forms online using their mobile phones through the ECINet app or through the online form on the EC’s website.\nThey can also send their forms to the concerned BLOs through their family members or through any online means, including WhatsApp or similar applications, the statement said."
  },
  {
    "title": "Woman and daughter found dead in Bengaluru",
    "link": "https://www.thehindu.com/news/national/karnataka/woman-and-daughter-found-dead-in-bengaluru/article69812250.ece",
    "published": "Mon, 14 Jul 2025 23:05:16 +0530",
    "author": "",
    "summary": "Tragic incident in Whitefield as mother and daughter found dead, suspected suicide due to depression, call Arogya Sahayavani for help.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "A 48-year-old woman allegedly ended her life after she found her 24-year-old daughter dead at their residence in Nagondanahalli in Whitefield on Monday.\nThe deceased have been identified as Rachitha Reddy, 48, a homemaker, and her daughter Shreeja Reddy, 24, who worked as a data analyst at a private firm. They were natives of Andhra Pradesh, the police said.\nAccording to the police, Rachitha found Shreeja dead inside her room and called her husband, Shreedhar Reddy, who was at work, and informed him about the incident.\nShreedhar then informed their neighbour seeking help. When the neighbour arrived, Rachitha was also found dead. The police found a death note in Telugu in which, Shreeja stated that she was taking the extreme step due to depression.\nThe police suspected that the mother ended her life as she was unable to bear the loss of her only daughter.\n(Those having suicidal tendencies can call Arogya Sahayavani on 104 for help.)"
  },
  {
    "title": "Travel entrepreneur offers AI-based solution worth ₹1 crore to solve Bengaluru’s traffic woes",
    "link": "https://www.thehindu.com/news/cities/bangalore/travel-entrepreneur-offers-ai-based-solution-worth-1-crore-to-solve-bengalurus-traffic-woes/article69812263.ece",
    "published": "Mon, 14 Jul 2025 23:04:41 +0530",
    "author": "",
    "summary": "Prashant Pitti, co-founder of EaseMyTrip, a New Delhi-based online travel firm, has announced a contribution of ₹1 crore to develop an Artificial Intelligence-powered solution that can identify traffic pinch points across Bengaluru.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/iq8qpv/article69812362.ece/alternates/LANDSCAPE_1200/IMG_1433.jpeg",
    "content": "Prashant Pitti, co-founder of EaseMyTrip, a New Delhi-based online travel firm, has announced a contribution of ₹1 crore to develop an Artificial Intelligence-powered solution that can identify traffic pinch points across Bengaluru.\nThe initiative stems from Mr. Pitti’s personal experience of being trapped for 100 minutes at a single traffic jam-prone zone on the Outer Ring Road, transforming a 11-km journey into a grueling two-hour experience.\nHe toldThe Hindu: “The project’s success will depend on collaboration with the Bangalore Traffic Police (BTP) and the Bruhat Bengaluru Mahanagara Palike (BBMP), who must provide access to their traffic data feeds and establish dedicated teams to implement the AI-generated recommendations.’‘\nHe said that rather than adding to the endless stream of traffic complaints, he chose to create tangible solutions by utilising Google Maps’ recently introduced “Road Management Insight” feature, available in Big Query format since April 2025, to find a logical remedy to the city’s long-standing traffic challenges.\n“This comprehensive system will integrate satellite imagery with machine learning algorithms to systematically identify traffic congestion points and analyse the peak timing patterns,’‘ he said.\nThe funding allocation would support hiring experienced machine learning and AI engineers and cover operational expenses, including Google Maps API usage, satellite imagery procurement, GPU resources, and field testing programmes. The entire solution would be designed as an open-source platform, allowing other Indian cities to implement similar traffic management systems, he added.\nHowever, he said, the project’s success would depend on collaboration with the BTP and the BBMP.\nMr. Pitti also requested public support by encouraging citizens to connect with traffic authorities, inviting AI professionals to contribute their expertise, and rallying commuters to advocate for the initiative, emphasising that India’s technology capital deserved world-class infrastructure for its innovators and workforce."
  },
  {
    "title": "Ensure no delays in FIRs, arrests in SC atrocity cases, says National SC Commission member",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/ensure-no-delays-in-firs-arrests-in-sc-atrocity-cases-says-national-sc-commission-member/article69812165.ece",
    "published": "Mon, 14 Jul 2025 23:02:04 +0530",
    "author": "",
    "summary": "National Commission for Scheduled Castes member Vaddepalli Ramchander on Monday said that there should be no delay in registration of FIRs and arrests in cases of atrocities against people belonging to the SC community.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/m1rifw/article69812336.ece/alternates/LANDSCAPE_1200/vjkvg-commission%205.JPG",
    "content": "National Commission for Scheduled Castes member Vaddepalli Ramchander on Monday said that there should be no delay in registration of FIRs and arrests in cases of atrocities against people belonging to the SC community.\nSpeaking at the Collectorate in Vijayawada on Monday (July 14), Mr. Ramchander said that the District Level Vigilance and Monitoring Committee meetings should be held every three months and banks should sanction quick loans for the construction of houses of the poor under the PM Awas Yojana. Farmers belonging to the community should be encouraged to grow horticulture crops for better returns, he added.\nPointing out that the National Commission for SCs, established under Article 338 of the Constitution, is striving for the social and economic development of the Scheduled Castes, he said that district-level officials should also take steps towards the upliftment of the lower classes with commitment.\nLater, Collector G. Lakshmisha apprised him of the status on implementation of various welfare schemes in the district, and about the SC population, their literacy rate and State welfare schemes being implemented for them.\nNTR District Police Commissioner S.V. Rajasekhara Babu informed about the cases registered under the SC and ST (Prevention of Atrocities) Act, and there status.\nMr. Ramchander expressed happiness at the P4 policy of the State government and said that the policy may bring light into the lives of many poor people."
  },
  {
    "title": "Environment Ministry defends new coal plant norms as ‘cost effective, climate coherent’",
    "link": "https://www.thehindu.com/sci-tech/energy-and-environment/environment-ministry-defends-new-coal-plant-norms-as-cost-effective-climate-coherent/article69811706.ece",
    "published": "Mon, 14 Jul 2025 22:58:24 +0530",
    "author": "",
    "summary": "Ministry exempts majority of thermal power plants from FGD units, citing cost-effectiveness and climate coherence in regulation.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/zbclu7/article69812349.ece/alternates/LANDSCAPE_1200/9865_9_5_2025_17_37_21_1_DSC_2769.JPG",
    "content": "The Ministry of Environment and Forests said in a note on Monday (July 14, 2025) that its recent decision to exempt a majorityof thermal power plants from installing flue gas desulphurisation (FGD)units was a “scientifically justified shift towards more targeted, cost-effective and climate-coherent regulation” and not a rollback of environmental safeguards.\nFGD units are used to cut sulphur dioxide emissions from coal plants and in 2015, the Ministry had made the systems mandatory for all thermal plants. However, only 8% of India’s roughly 180 coal plants have done so. The other plants have received multiple extensions from the Ministry for reasons such as limited availability of these units and high cost. The latest order, however, says only a minority of plants – 22% -- located in major cities with a history of poor air quality need to install these units.\nThe revised policy, its note says, reflects India’s “...declining ambient sulphur dioxide levels, the limited role of sulphur dioxide levels in driving PM2.5 health impacts and... the disproportionate resource and environmental costs of indiscriminate FGD mandates”. The Ministry’s note was in response to “media reports”.\nAccording to the Ministry, India’s annual sulphur dioxide concentration standard of 50 microgram/cubic metre is more stringent than Japan (66), European Union (52.4) and Australia (66). A 2023 measurement in 492 cities, the Ministry said, found that all but two -- Dehradun and Kolar – were compliant. Indian coal was naturally low in sulphur (0.5% of weight) but had high ash content and therefore led to low sulphur dioxide concentrations. Studies had shown that cities with thermal power plants that have FGD technology and those without FGD technology didn’t show any “significant difference” in sulphur dioxide concentrations, it said. “Eliminating all sulphur dioxide emissions would only result in a marginal improvement of particulate matter concentrations... At ₹1.2 crore per MW [megawatt], the capital expense of installing FGD would be ₹2.54 lakh crore and would only bring about a marginal benefit,” it said.\nUnder new rules, only about 11% of India’s 600 thermal power units – a single plant can have multiple units – have to mandatorily install FGD systems. These plants, called ‘Category A’ units, are located within a 10-km radius of the National Capital Region or cities with a population of at least one million (2011 Census). Originally, these plants were to have FGD systems in place by 2017 but have been given multiple extensions. The latest – as per a gazette notification this week – is December 30, 2027.\nAnother 11% of units, falling under Category B, located within 10-km radius of Critically Polluted Areas (CPAs) or Non-Attainment Cities (NACs) may or may not have to install FGD systems. This would depend upon a decision by an Expert Appraisal Committee, an existing body constituted by the Ministry to decide on according environment clearance to proposed coal plant projects. Those that must install FGD systems have a deadline of December 30, 2028.\nCPAs are regions or industrial clusters that are extremely polluted and deemed so according to Central Pollution Control Board (CPCB) criteria. NACs are those that have the worst air quality and haven’t met National Ambient Air Quality Standards (NAAQS) for at least five years, and there are 131 of these.\nThe remaining ‘Category C’ thermal power plants, or 78% of the total plants, are now exempt from installing FGD systems."
  },
  {
    "title": "Vellore pregnant woman pushed from train case: Hemaraj gets rigorous life imprisonment",
    "link": "https://www.thehindu.com/news/national/tamil-nadu/vellore-pregnant-woman-pushed-from-train-case-hemaraj-gets-rigorous-life-imprisonment/article69811156.ece",
    "published": "Mon, 14 Jul 2025 22:52:58 +0530",
    "author": "",
    "summary": "History-sheeter convicted and sentenced to life for pushing pregnant woman off train; ordered to pay compensation.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/news/national/tamil-nadu/dc15vj/article69812201.ece/alternates/LANDSCAPE_1200/Hemaraj.jpeg",
    "content": "The District and Sessions Court on Monday convicted history-sheeter K. Hemaraj and sentenced him to undergo rigorous life imprisonment for pushing a pregnant woman off a moving train near Katpadi when she resisted a sexual assault attempt in February.\nJudge S. Meenakumari delivered the verdict, sentencing Hemaraj to undergo rigorous life imprisonment besides imposing a fine of ₹85,000. The Judge also directed the Ministry of Railways and the State government to pay a compensation of ₹50 lakh each to the survivor.\nThe compensation should be deposited within a month. The court, in its ruling, also said that all future medical expenses of the survivor, if required, should be fully borne by the State government. “A total of 22 witnesses, including the survivor were examined for the case. All charges filed against Hemaraj have been proved,” Public Prosecutor (PP) P.T. Saravanan toldThe Hindu.\nPolice said that on February 6, a 36-year-old pregnant woman was pushed off a moving train near Katpadi in Vellore, when she resisted an attempt of Hemaraj, 27, to sexually assault her. He was arrested by the Government Railway Police (GRP), Jolarpet, in connection with the incident.\nThe police said the woman, who was four months pregnant, had been living with her family in Tiruppur. Owing to her pregnancy, she was travelling to her mother’s house and boarded the Coimbatore-Tirupati Intercity Express alone on the said day.\nThe police said the accused person, Hemaraj, of Pooncholai near K.V. Kuppam in Vellore, boarded the ladies compartment of the train at Jolarpet. As she was alone in the compartment, he attempted to sexually assault her, she said. When she resisted his attempt, Hemaraj allegedly fractured her right hand and pushed her towards the entrance. Though she held onto the handle, she fell down after losing her grip and became unconscious.\nThe police said the incident occurred at around 11.30 a.m. near the K.V. Kuppam station. A few railway workers rescued the woman, who was admitted to the Government Medical College and Hospital in Vellore.\nThe police said the accused was freed on conditional bail a few months ago in a case of murder of a 29-year-old woman from Chennai in April 2024. He is also facing another case, registered by the GRP, Jolarpet, in 2022 for pushing a woman commuter off a moving train after snatching her mobile phone. He was also charged under the Goondas Act twice."
  },
  {
    "title": "Sikkim’s Yakten declared India’s first digital nomad village",
    "link": "https://www.thehindu.com/news/national/sikkim/sikkims-yakten-declared-indias-first-digital-nomad-village/article69810938.ece",
    "published": "Mon, 14 Jul 2025 22:50:24 +0530",
    "author": "",
    "summary": "Yakten in Sikkim becomes India's first digital nomad village, offering sustainable income opportunities for homestay owners.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/t3jtp8/article69812325.ece/alternates/LANDSCAPE_1200/Gangtok_03072025_01.jpg",
    "content": "Yakten, a village in Sikkim’s Pakyong district, was officially declared India’s first digital nomad village on Monday (July 14, 2025).\nA collaboration between the district administration and NGO Sarvahitey under the ‘Nomad Sikkim’ initiative, the project aims to transform strategic locations in the Himalayan State into year-round hubs for digital professionals across India and abroad, while ensuring sustainable income opportunities for homestay owners.\nOfficials said the initiative was fuelled by Chief Minister Prem Singh Tamang’s concern over the lack of steady income for homestay operators during the off-season, which may stretch for six months from April-May.\n“If we ensure stable internet and electricity, remote workers will come to stay in the serene environs regardless of the season,” Pakyong District Collector Rohan Ramesh said at a function to launch the project.\nHe said the district authorities have installed two internet lines and ensured village-wide Wi-Fi connectivity, apart from providing inverters to maintain uninterrupted electricity. He added that a long-term solution to address water scarcity in the village about 32 km from the State’s capital, Gangtok, has been planned under the Jal Jeevan Mission.\nGyan Bahadur Subba, the president of Yakten Village Tourism Cooperative Society, hoped the initiative would end the struggle of homestay operators and other service providers to stay afloat. “Alongside promoting this initiative, the government needs to resolve drinking water and other basic issues,” he told journalists.\nMLA Pamin Lepcha, who represents Gnathang-Machong constituency, attended the launch programme."
  },
  {
    "title": "Narmada settlements to be brought under respective gram panchayats",
    "link": "https://www.thehindu.com/news/national/gujarat/narmada-settlements-to-be-brought-under-respective-gram-panchayats/article69810939.ece",
    "published": "Mon, 14 Jul 2025 22:42:55 +0530",
    "author": "",
    "summary": "Gujarat merges Narmada rehabilitation settlements with gram panchayats, improving access to public services and civic infrastructure.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/7jvbck/article69812309.ece/alternates/LANDSCAPE_1200/10219_17-9-2019_17-0-7_5_17SEP_14.JPG",
    "content": "The Gujarat government has finalised regulations to merge settlements under the Sardar Sarovar Punarvasvat Agency (SSPA) with the respective gram panchayats.\nChief Minister Bhupendra Patel has approved the proposal, paving the way for integrating 127 Narmada rehabilitation settlements – housing people displaced by the Sardar Sarovar dam – located across 26 taluks in eight districts with the gram panchayats concerned, officials said on Monday (July 14, 2025).\nAlso read:Chronicle of a tragedy foretold\nThe move is set to benefit settlements in Ahmedabad Rural, Vadodara, Bharuch, Kheda, Panchmahal, Narmada, Chhota Udepur, and Mahisagar districts. Under the approved framework, the gram panchayats will now assume responsibility for key civic infrastructure and services in these settlements, including drinking water, internal and approach roads, streetlights, electricity bills, rainwater drainage, and general maintenance of public amenities.\nThe Department of Panchayat, Rural Housing and Rural Development, which presented the integration work plan, stated that the merger process is expected to be completed within two months. Once merged, residents of the settlements will be able to access welfare schemes through their respective gram panchayats as per existing norms, significantly improving their access to public services, officials said.\nWhile the SSPA will retain ownership of unallocated plots in the settlements, all relevant records will be transferred to the gram panchayats. Additionally, schools, anganwadis, and health centres in the settlements will be handed over to the relevant departments, the government said.\nVoting rights and representation of settlement residents will be ensured in accordance with the existing government provisions. “The gram panchayats will also be empowered to assess properties and collect applicable taxes and levies under the Gujarat Panchayats Act, 1993,” they said\nThe government has clarified that these rules will serve as the standard for future integration of the remaining SSPA settlements. A formal resolution to this effect has been issued by the Department of Panchayat, Rural Housing and Rural Development under the guidance of Mr. Patel."
  },
  {
    "title": "MGNREGS digital attendance system being manipulated, Centre tells States",
    "link": "https://www.thehindu.com/news/national/government-finds-mnrega-digital-attendance-system-is-riddled-with-holes/article69812135.ece",
    "published": "Mon, 14 Jul 2025 22:30:59 +0530",
    "author": "",
    "summary": "Government adds analog monitoring to combat misuse of digital attendance system for MNREGA workers, raising concerns about public funds.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/h6mgc8/article69812270.ece/alternates/LANDSCAPE_1200/pokkali_08.jpg",
    "content": "Nearly four years afterintroducing digital attendance systemfor Mahatma Gandhi National Rural Employment Guarantee Scheme (MGNREGS) workers and three years after making it mandatory, the government has discovered a whole range of ways the National Mobile Monitoring System (NMMS) platform used for the purpose is being “misused” and has now added four layers of analog monitoring to plug the holes.\nOn July 8, 2025, the Union Rural Development Ministry issued a 13-page note to the State governments on the issue.\nAs per the Ministry’s note, there were at least seven ways that the NMMS is allegedly being gamed, which, the government said, was undermining the credibility of the digital attendance system and leading to “potential misuse of public funds”. The Ministry also cautioned that “no relaxation will be given in matters concerning the misuse or manipulation of NMMS”.\nUnder NMMS, geo-tagged photographs of the workers are to be uploaded twice a day. First when they arrive for work and then at the end of their shift. Only exception for the second round of photographing is offered at sites with 20 or below workers. It was found that “irrelevant or unrelated photographs” were being uploaded. In many cases, “photo-to-photo capturing instead of live work images” was being done.\nThere was also “mismatch in actual vs recorded count”. A mismatch in gender composition of workers was found at several work sites. The same photo of workers in multiple muster rolls, mismatch in workers in morning and afternoon photos and non-uploading of photos in the afternoon session are the other discrepancies flagged by the Rural Development Ministry.\nThe Ministry has directed the States to ensure that these photographs and attendance of workers is verified at gram panchayat, block, district and State level. At gram panchayat level, they want 100% verification of the present workers. The percentage of physical verification of the uploaded photographs of workers reducing at different levels. So, while at the block level, 20% of the photos at random need to be verified, at the district level, this number is down to 10%, and at State level to 5%.\nThe other significant change is that the government now allows for editing the muster rolls before making the wage bill. So far, this could be done only at the District Collector’s level, who also took action in case of complaints. Such amendments of the muster rolls were rare.\nChakradhar Buddha, senior researcher, LibTech India, said that what was meant to be a technology-driven, corruption-resistant system is now entirely dependent on manual checks by frontline workers. “This defeats the very purpose of introducing a digital attendance system,” he added. The government’s directions, he said, will be difficult to comply. “During the summer months, especially in Adivasi areas where large-scale MGNREGA work takes place, thousands of NMMS photos are generated daily. Verifying these images demands staff capacity and technical infrastructure that simply don’t exist on the ground,” Mr. Buddha said."
  },
  {
    "title": "Problems highlighted by Urology head common to all Medical Colleges in Kerala: KGMCTA",
    "link": "https://www.thehindu.com/news/national/kerala/problems-highlighted-by-mch-urology-head-common-to-all-medical-colleges-in-kerala-kgmcta/article69812092.ece",
    "published": "Mon, 14 Jul 2025 22:28:38 +0530",
    "author": "",
    "summary": "The teachers call for resolving long-standing problems faced by faculty in Medical Colleges Hospitals ",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Kerala Government Medical College Teachers’ Association (KGMCTA) has demanded that the long-standing problems faced by the faculty in Government Medical Colleges Hospitals (MCH) across the State be resolved without delay.\nKGMCTA’s Central Executive Committee (CEC), which met at Thrissur recently, discussed the fall out of the issues highlighted by Harris Chirackal, the head of Urology at the Thiruvananthapuram Medical College Hospital.\nThe meeting declared solidarity with Dr. Harris and said that the problems he had highlighted were common to all MCHs in the State.\nKGMCTA also decided that if the government was not willing to resolve the deficiencies and basic facilities, the doctors would have to limit the patient care services to the extent that the limited resources will permit. The meeting decided to inform this in writing to the government.\nKGMCTA pointed out that the government was yet to give a favourable response regarding the anomalies in the pay revision of MCH doctors. Also, the pay revision arrears of the faculty from 2016 to 2020 remains unpaid. Also, the pay of doctors at the entry-level cadre, which got slashed remains an unresolved issue. It also resolved to intervene for the immediate resolution of delays related to the 2025 general transfer process.\nThe meeting demanded that the doctors, who were redeployed to Wayanad and Kasaragod, to secure the approval of the National Medical Commission for the new MCHs, be brought back.\nUnless the government creates sufficient faculty and non-faculty posts in these institutions and fill them, the functioning of other MCHs are also going to be affected, KGMCTA pointed out.\nThe CEC decided to inform the government formally that no new MCHs be started without first creating adequate human resources.\nKGMCTA State president Dr. Rosenara Beegum presided over the meeting."
  },
  {
    "title": "On the eve of CM’s meeting, Civil society groups warn of ‘anti-Congress’ struggle if justice is denied to Devanahalli farmers",
    "link": "https://www.thehindu.com/news/national/karnataka/on-the-eve-of-cms-meeting-civil-society-groups-warn-of-anti-congress-struggle-if-justice-is-denied-to-devanahalli-farmers/article69811429.ece",
    "published": "Mon, 14 Jul 2025 22:28:04 +0530",
    "author": "",
    "summary": "Progressive organisations warn Chief Minister Siddaramaiah of backlash if farmers' interests are not prioritised in Devanahalli issue.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/cvb3j9/article69812271.ece/alternates/LANDSCAPE_1200/_KMK2280.JPG",
    "content": "On the eve of Chief Minister Siddaramaiah’s meeting with Devanahalli farmers who are seeking that acquisition of their lands for aerospace park be shelved, progressive organisations upped their ante by warning that if justice is not done to farmers, Chief Minister Siddaramaiah’s “pro-people” image will be shattered and a sharp wave of “anti-Congress” struggle will sweep across the State.\nSeeking intervention of the Congress high-command and addressing a press conference in Bengaluru on Monday, office-bearers of Eddelu Karnataka, that included actor Prakash Raj, said the Congress “will have to pay a heavy price” if its government takes a stance against the interests of farmers, “prioritising corporate interests” in the Devanahalli issue.\nLaunching a tirade against the Congress government, they maintained that the Congress dispensation was no different from the erstwhile BJP government which they said was “anti-people and indulged in misrule.”\n“This public outrage expressed across the State is not solely due to the Devanahalli issue. The Devanahalli struggle has given an organised form to the growing dissatisfaction and anger against the Congress. There are valid reasons for this public outrage to grow,” they said.\nThey alleged that many civil society organisations that had backed the Congress during the Assembly elections in 2023 were now on a different side.\nPouring out their ire at the Congress government, they accused it of continuing to implement many the “anti-farmer” legislations that they had opposed when in the opposition, such as Karnataka Prevention of Slaughter and Preservation of Cattle Act (KPSPCA), 2020, among others. It also did not take a decision against the four labour codes introduced by the central government and it even tried to implement the anti-labour decision to increase working hours from 8 to 12 hours a day, they alleged.\nThey accused the government of failure to protect women and minorities. “Even after two years in power, it has not repealed the anti-conversion law introduced by the BJP. Even though the marginalised communities were yearning for internal reservation and caste census, it did not take a bold stance,” they said in a release.\nThe open letter to Mr. Kharge and Mr. Rahul Gandhi was written by Samyukta Horata – Karnataka that comprises a host of progressive organisations."
  },
  {
    "title": "Stalin opposes house arrest of Omar Abdullah, says BJP govt.  is stripping away rights of elected governments",
    "link": "https://www.thehindu.com/news/national/tamil-nadu/stalin-opposes-house-arrest-of-omar-abdullah-says-bjp-govt-is-stripping-away-rights-of-elected-governments/article69811800.ece",
    "published": "Mon, 14 Jul 2025 22:26:12 +0530",
    "author": "",
    "summary": "Tamil Nadu CM criticizes BJP government for stripping rights of elected State governments, condemns house arrest of J&K CM.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Opposing the ‘house arrest’ of Jammu and Kashmir Chief Minister Omar Abdullah, Tamil Nadu Chief Minister M.K. Stalin on Monday contended that the Union BJP government was systematically stripping away the rights of elected State governments.\n“At a time when there is a growing demand for the restoration of Jammu and Kashmir’s Statehood, the current events unfolding there are a grim reminder of how far things have deteriorated,” Mr. Stalin contended in a social media post.\nThe elected CM was being placed under house arrest simply for wanting to pay homage to the 1,931 martyrs and was forced to climb walls to do so, Mr. Stalin said and further asked: “Is this how an elected Chief Minister should be treated?”\nFurther, stating that it was not just about one State or one leader, Mr. Stalin said: “From Tamil Nadu to Kashmir, the Union BJP Government is systematically stripping away the rights of elected State governments.”\nIf this could happen in Kashmir, Mr. Stalin said: “it can happen anywhere, to any elected representative of the people. Every democratic voice must unequivocally condemn this.”"
  },
  {
    "title": "Railway Board member inspects Golden Rock Railway Workshop in Tiruchi",
    "link": "https://www.thehindu.com/news/cities/Tiruchirapalli/railway-board-member-inspects-golden-rock-railway-workshop-in-tiruchi/article69812140.ece",
    "published": "Mon, 14 Jul 2025 22:24:09 +0530",
    "author": "",
    "summary": "Ashish Sharma, Additional Member (Mechanical Engineering), Railway Board, New Delhi, on Monday inspected the Golden Rock Railway Workshop, which is engaged in a mosaic of activities, including periodic overhaul of diesel and steam locomotives, overhaul of passenger coaches and manufacture of wagons",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Ashish Sharma, Additional Member (Mechanical Engineering), Railway Board, New Delhi, on Monday inspected the Golden Rock Railway Workshop, which is engaged in a mosaic of activities, including periodic overhaul of diesel and steam locomotives, overhaul of passenger coaches and manufacture of wagons.\nMr. Ashish Sharma inspected various shops and facilities inside and held discussions with the senior officials.  The focus was more on the shops involved in wagon production and overhauling of diesel locomotives, said workshop authorities.\nHe was accompanied by the Chief Workshop Manager, Santhosh Kumar Patro, and other officials. The performance of the workshop on various fronts was explained to Mr. Ashish Sharma."
  },
  {
    "title": "President Murmu visits AIIMS, enquires about Odisha student battling for life",
    "link": "https://www.thehindu.com/news/national/odisha/president-murmu-visits-aiims-enquires-about-odisha-student-battling-for-life/article69811743.ece",
    "published": "Mon, 14 Jul 2025 22:20:05 +0530",
    "author": "",
    "summary": "President Droupadi Murmu visits burn unit at AIIMS Bhubaneswar to inquire about student's condition after self-immolation due to harassment.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/x5wtmu/article69812256.ece/alternates/LANDSCAPE_1200/20250624243L.jpg",
    "content": "President Droupadi Murmu on Monday (July 14, 2025) visited the burn unit at the AIIMS, Bhubaneswar, where a college student is battling for lifeafter her self-immolation bid,and enquired about her condition.\nThe student, a 20-year-old pursuing B.Ed. at the F.M. Autonomous College in Balasore, set herself afire outside the Principal’s office on July 12, accusing college authorities of repeatedly ignoring her complaint of sexual harassment by a teacher. The woman is now on life support.\nMs. Murmu who was at the AIIMS, Bhubaneswar, for its fifth convocation ceremony, expressed her wish to visit the burn unit, a deviation from her scheduled programme. “The President held discussions with the doctors about the girl’s condition and enquired about the additional steps needed for her treatment,” said Asutosh Biswas, executive director of the AIIMS, Bhubaneswar. The President was accompanied by Chief Minister Mohan Majhi and Union Education Minister Dharmendra Pradhan.\nMs. Murmu also met the girl’s mother and relatives. She consoled them and urged them to remain patient\nThe condition of the girl remains critical. Hospital sources said there was neither improvement nor deterioration in her condition, and she continued to be on life support.\nThe accused college teacher, Samir Sahu, has been arrested. The Odisha government on Monday also arrested Principal Dillip Ghosh, based on the interim report of a high-level probe team constituted by the State Higher Education Department. Besides, all colleges across the State were directed to form an internal committee within 24 hours as per the Sexual Harassment of Women at Workplace Act, 2013.\nThe series of actions followed Odisha Governor Hari Babu Kambhampati’sdirection to authoritiesto protect the dignity and mental well-being of students and prevent recurrence of such incidents.\nThe National Human Rights Commission has also sought a report from Odisha government over the incident."
  },
  {
    "title": "IIM-K, Cochin Shipyard award ₹1.8-crore seed funding to six start-ups",
    "link": "https://www.thehindu.com/news/national/kerala/iim-k-cochin-shipyard-award-18-crore-seed-funding-to-six-start-ups/article69811401.ece",
    "published": "Mon, 14 Jul 2025 22:15:48 +0530",
    "author": "",
    "summary": "IIM-K LIVE and CSL provide ₹1.8 crore seed funding to six start-ups under USHUS maritime support scheme.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "IIM-K LIVE, the business incubator of the Indian Institute of Management-Kozhikode (IIM-K), in collaboration with Cochin Shipyard Limited (CSL) has sanctioned ₹1.8 crore in seed funding for six promising early-stage start-ups under the USHUS initiative, India’s flagship maritime sector start-up support scheme.\nThe six start-ups selected for funding are Wroxai Pvt. Ltd., Coimbatore;  Hyetron Energy Pvt. Ltd., Chennai; EyDelta Pvt. Ltd., Bihar; Xtent Innovations Pvt. Ltd., Calicut; Mafkin Robotics Pvt. Ltd., Jaipur, and Xera Robotics Pvt. Ltd., Chennai, a press release said here on Monday.\nWith this round, a total of ₹4.4 crore has been sanctioned under the USHUS programme to support 14 start-ups, of which ₹2.1 crore has already been disbursed to eight start-ups.\nThe seed-funding award ceremony was held in the presence of senior representatives from CSL and IIM-K LIVE, including Prof. Ashutosh Sarkar, Executive Director, IIM-K LIVE, and Dr. Krishna Prasad S. (senior manager), Harikishen E.S. and Bindu Krishna (assistant general managers) from CSL.\nExpressing delight over the development, Prof. Debashis Chatterjee, Chairman, IIM-K LIVE, and Director, IIM-K, said, “We believe that India’s maritime legacy must be reimagined through entrepreneurial innovation. USHUS exemplifies how academia and industry can co-create platforms that nurture young ventures with both purpose and potential.”\nMadhu S. Nair, chairman and managing director, CSL, said: “The USHUS programme of CSL has, so far, generated over 70 high-skilled employment opportunities for talented young professionals and is playing a significant role in indigenising scalable sunrise technologies.”\nA joint initiative of IIM-K LIVE and CSL, USHUS was launched to foster an innovation-friendly ecosystem in India’s maritime sector."
  },
  {
    "title": "Think tanks need to do a better job to present India in the international context: leading Australian think tank research head",
    "link": "https://www.thehindu.com/news/national/think-tanks-need-to-do-a-better-job-to-present-india-in-the-international-context-leading-australian-think-tank-research-head/article69811971.ece",
    "published": "Mon, 14 Jul 2025 22:11:05 +0530",
    "author": "",
    "summary": "Investing in think tank resources to enhance India-Australia relationship, as highlighted by Director of Research Herve Lemahieu.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/vpowmo/article69812227.ece/alternates/LANDSCAPE_1200/iStock-1013363868.jpg",
    "content": "Australia’s public policy makers are catching up with the rapid changes in India-Australia relationship and in that context, it is necessary to invest in building on think tank resources between the two sides, said Herve Lemahieu, Director of Research of Sydney-based Lowy Institute. The remarks from Mr Lemahieu came in the wake of Australia announcing ‘Maitri Grants’ that will, among other activities, fund the recruitment of a distinguished scholar for the India Chair at the Lowy Institute that is known for high quality research in the field of international studies from the Australian point of view.\n“Australia’s public and policy debates are playing catch-up on the rapid evolution of the bilateral partnership. But think tanks also need to do a better job of situating India within a broader regional and international context. The country will be a central player through the chop and change we are experiencing in global politics,” said Mr Lemahieu.\nThe India Chair will be a new initiative to further promote understanding about India in Australia with the aim to furthering bilateral partnership. Herve Lemahieu described India as “an anchor for strategic balance for Australia and the broader Indo-Pacific region”, adding that “Understanding India, its trajectory, power and diffuse interests, has never been more important to us.”\n“This world-class program of research at the Lowy Institute will do just that. It will elevate India in terms of our research agenda. It’s an opportunity to bring in new talent, fresh perspectives, and deepen the bench on a vital piece of the puzzle in terms of how Australia looks and engages the region,” said Mr Lemahieu. Australia and India are partners in the Quad grouping that also includes Japan and the United States and that apart, the two countries have a history of cooperation that dates back to the immediate post-independence years of India. The two sides are closely working on issues in the Indo-Pacific region as well as the ASEAN grouping where the Myanmar crisis has prompted concern from New Delhi and Canberra.\nOther projects under the Maitri Grants will include an exhibition of paintings by Raja Ravi Varma, an annual leadership dialogue, and innovative research infields like clean energy solutions and biomanufacturing, said a press note from the Centre for Australia India Relations. High Commissioner of Australia Philip Green praised the initiative at the Lowy Institute and said, “An India Chair at the Lowy Institute will contribute to Australians’ understanding of India at a deep level. We are very different societies, and research, scholarship and analysis will allow us to maximize the opportunity of our shared interests.”"
  },
  {
    "title": "Stampede case: Karnataka High Court rejects State govt’s. plea to keep status report in sealed cover",
    "link": "https://www.thehindu.com/news/national/karnataka/stampede-case-karnataka-high-court-rejects-state-govts-plea-to-keep-status-report-in-sealed-cover/article69811698.ece",
    "published": "Mon, 14 Jul 2025 22:05:52 +0530",
    "author": "",
    "summary": "High Court of Karnataka rejects government plea to seal stampede case report, orders copies to all parties in PIL.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Rejecting State government’s plea to keep its status report on stampede case in a sealed cover, the High Court of Karnataka has directed the government to give copies of the report, dated June 12, to all the parties to the PIL petition, which the courtsuo motuhad initiated taking cognisance of death of 11 persons in the stampede occurred on June 4 outside M. Chinnaswamy stadium during RCB’s victory celebrations.\nA division bench comprising acting Chief Justice V. Kameswar Rao and Justice C.M. Joshi passed the order while rejecting the stand of the government that if the status report is disclosed, the magisterial inquiry and the one-man commission of inquiry may get influenced by the status report submitted before the Court.\nPointing out that the issue involved is not of of national security or privacy rights, the Bench said the ground that the magisterial inquiry/judicial commission of inquiry may get influenced by the stand/facts urged by the State in the status report “is unmerited as such a plea has no public interest angle and surely a retired High Court judge and an all India service officer, who are heading the judicial commission/magisterial inquiry cannot be susceptible to influences emanating from the status report.”\nReferring to certain documents, which the government initially declined to make public, the Bench said that these were neither privileged documents nor they were discovered during the investigation being conducted on the criminal case registered on the stampede incident. The Bench noted that the some of the documents, which the government wanted to be kept in sealed cover, were of the year 2019 and some other were about deployment of police personnel and arrangements made by traffic regulating authority on prior occasions and June 6, the date on which the stampede occurred."
  },
  {
    "title": "Prison radicalisation case: Eight, including prime accused, plead guilty",
    "link": "https://www.thehindu.com/news/national/karnataka/prison-radicalisation-case-eight-including-prime-accused-plead-guilty/article69811824.ece",
    "published": "Mon, 14 Jul 2025 22:04:04 +0530",
    "author": "",
    "summary": "Eight accused in Bengaluru prison radicalisation case, including prime accused, plead guilty before NIA court for expedited trial.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/1sf16w/article69812115.ece/alternates/LANDSCAPE_1200/6205_15-2-2017_19-3-15_SASIKALA_31.JPG",
    "content": "Eight accused involved in the Bengaluru prison radicalisation, including the prime accused, moved an application before the National Investigation Agency (NIA) court in Bengaluru pleading guilty.\nThe prime accused accused Thadiyantavida Naseer, 47, moved an application in the court on July 7, along with seven co-accused — Syed Suhail Khan alias Suhail, 24; Mohammed Umar alias Umar 30; Zahid Tabrez alias Zahid, 27; Syed Mudassir Pasha, 29; Mohammed Faisal Rabbani alias Sadath, 29, Salman Khan, 29, and Vikram Kumar alias Chhota Usman.\nThe eight are among 12 people currently accused in the prison conspiracy case registered in 2023, which is being investigated by the National Investigation Agency (NIA). They moved the application last week under Section 229 of the Criminal Procedure Code (CrPC). The application allows the court to expedite the trial by convicting the accused based on their plea without a full trial. However, the NIA is preparing to submit its version on the application.\nThe accused in their application told the court that it was voluntary and without any coercion, and sought to reduce the quantum of sentence .\nIn July 2023, the CCB raided a house in Kodigehalli and recovered seven country-made pistols, 45 live rounds of ammunition, walkie-talkies and some documents. Further investigations led the police to believe that radicalisation happened inside the Bengaluru prison.\nThe NIA has accused Naseer of radicalising the youths lodged at the Parappana Agrahara Central Prison in Bengaluru. Naseer is an undertrial in the 2008 Bengaluru serial blasts case and was convicted in a terrorism case in Kerala and linked the LeT.\nLast year, the NIA chargesheeted eight people, including T. Naseer and accused no: 52, Junaid Ahmed who is presently on the run, under various sections of IPC, UA(P) Act, 1967; Arms Act, 1959 and Explosive Substances Act, 1884.\nThe NIA court on Monday remanded three people arrested on July 8 in the same case to judicial custody. They were earlier under NIA custody for six days.\nThe three arrested are Anees Fathima, the mother of absconding accused Junaid Ahmed, prison psychiatrist Dr. Nagaraj S., and Chan Pasha, an ASI posted at the City Armed Reserve (CAR), North Bengaluru."
  },
  {
    "title": "Pahalgam attack: Congress asks whom J&K L-G Manoj Sinha is trying to ‘protect’",
    "link": "https://www.thehindu.com/news/national/jammu-and-kashmir/pahalgam-attack-congress-asks-whom-jk-l-g-manoj-sinha-is-trying-to-protect/article69812104.ece",
    "published": "Mon, 14 Jul 2025 22:00:48 +0530",
    "author": "",
    "summary": "Congress questions L-G Sinha's accountability for Pahalgam terror attack, blames Centre for security lapse and 90 deaths in J&K.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/nhntdl/article69812206.ece/alternates/LANDSCAPE_1200/12205_13_7_2025_16_45_30_2_14_LG_SGR_13_07_2025.JPG",
    "content": "Reacting toJammu and KashmirLieutenant Governor (L-G) Manoj Sinha’s admission that there was a security lapse at Pahalgam and he took full responsibility for theApril 22 terror attack that left 26 tourists dead, the Congress on Monday (July 14, 2025) asked whom Mr. Sinha was trying to “protect”.\n“The much-delayed acceptance of responsibility by L-G Manoj Sinha is an insult to all those innocent tourists who lost their lives in Pahalgam terror attack. Who is the L-G protecting? Where is the accountability?” Congress’ media and publicity head Pawan Khera asked in a post on X.\nHis party colleague and Lok Sabha member from Tamil Nadu, Manickam Tagore, questioned the timing of Mr. Sinha’s statement and bluntly apportioned the blame on the Centre.\n“Before six days to Parliament session, Lt. Governor Manoj Sinha calls the Pahalgam terror attack a ‘security lapse’ and takes ‘full responsibility’. But in J&K, the real control lies with the Union Home Ministry under Amit Shah. Why is he silent after 90 terror-related deaths this year?” Mr. Tagore asked.\nThe Lok Sabha member said the Narendra Modi government promised a “new era of peace” in Kashmir after abrogating Article 370 but 90 people died due to terrorist attacks this year alone.\n“The L-G admits the Pahalgam attack was Pakistan-backed, targeted tourists, and happened in a high-security zone. Then how did terrorists breach security so easily? Who was in charge of intel and preparedness? Answer: Amit Shah’s Home Ministry. If the Union Govt. claims credit for all development in J&K…It must also own the failures of security. You can’t take the photo-ops and dodge the bloodshed. 90 dead in a year is not normal,” Mr. Tagore said on X.\n“Let’s be clear: This is not just a local failure. It’s a central failure — by the Modi govt. and the Home Ministry. The people of Jammu & Kashmir — and India — deserve answers, not slogans,” he added."
  },
  {
    "title": "Kerala safe for independent journalism, says Riyas",
    "link": "https://www.thehindu.com/news/national/kerala/kerala-safe-for-independent-journalism-says-riyas/article69811287.ece",
    "published": "Mon, 14 Jul 2025 21:49:57 +0530",
    "author": "",
    "summary": "Minister Riyas praises Kerala's proactive approach to media freedom and advocacy at Theruvath Raman Memorial Journalism Excellence Award ceremony.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Kerala continues to be one of the safest places for independent journalism at a time when many other States are trying to restrict media freedom with their reactive approach to criticism, Minister for Public Works P.A. Mohamed Riyas has said.\nHe was speaking after presenting the Theruvath Raman Memorial Journalism Excellence Award instituted by the Calicut Press Club for the best editorial to senior journalist V.M. Ibrahim here on Monday.\nMr. Riyas said the country was currently witnessing a strange situation where even the National Investigation Agency was found to have been a weapon in the hands of a few to suppress media freedom and advocacy. He pointed out that Kerala, however, had emerged as a model with its proactive approach to constructive criticism by the media.\nMr. Riyas also distributed the newly designed identity cards prepared by the press club for journalists. Press Club president E.P. Mohammed and secretary P.K. Sajith were present."
  },
  {
    "title": "Special DigiLocker technology for nurses’ registration",
    "link": "https://www.thehindu.com/news/national/karnataka/special-digilocker-technology-for-nurses-registration/article69811821.ece",
    "published": "Mon, 14 Jul 2025 21:49:07 +0530",
    "author": "",
    "summary": "Karnataka State Nursing Council introduces DigiLocker technology for nurse registration, eliminating travel and long queues, improving efficiency.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "For what is touted to be the first time in the country, a special DigiLocker-based technology developed by the Karnataka State Nursing Council for the registration of nurses is being implemented.\nIn a press release, Sharanaprakash Patil, Minister for medical education, said that the new technology, which facilitates the issuance of registration certificates through Aadhaar-based DigiLocker e-KYC, will be officially launched on Tuesday, July 15 by Chief Minister Siddaramaiah.\nThe system has been developed in collaboration with UIDAI, C-eG, Rajiv Gandhi University of Health Sciences (RGUHS) and the Karnataka State Nursing Examination Board, the minister stated.\nWith this technology, the Karnataka State Nursing Council can directly retrieve personal data, address, photo, and other details of nurses from the Aadhaar server through e-KYC. Previously, nursing candidates from various districts had to travel to the Council’s central office in Bengaluru for registration, minister explained.\nNurses from within and outside the State were forced to spend thousands of rupees on food and accommodation solely for registration purposes. They also had to wait in long queues at the Bengaluru office. Many women, pregnant women and new mothers faced considerable inconvenience. Dr. Patil said that the implementation of this new technology puts an end to all these issues.\nThe new DigiLocker-Requester technology enables the Karnataka Nursing Council to directly fetch Aadhaar cards, SSLC and PUC marks cards, and other certificates from respective examination boards. Using technology adopted by RGUHS and the Karnataka State Nursing Examination Board, examination results will be directly accessed by the Nursing Council. Later, through DigiLocker-Issuer, registration certificates will be issued directly to nurses."
  },
  {
    "title": "Karnataka High Court notice to BBMP on plea to maintain footpaths in disable-friendly condition",
    "link": "https://www.thehindu.com/news/national/karnataka/karnataka-high-court-notice-to-bbmp-on-plea-to-maintain-footpaths-in-disable-friendly-condition/article69811389.ece",
    "published": "Mon, 14 Jul 2025 21:46:29 +0530",
    "author": "",
    "summary": "High Court of Karnataka orders notice to State government and BBMP on PIL for maintaining accessible footpaths for disabled.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/tgixob/article69812167.ece/alternates/LANDSCAPE_1200/IMG_1815.jpeg",
    "content": "The High Court of Karnataka on Monday ordered issue of notice to the State government and the Bruhat Bangalore Mahanagara Palike (BBMP) on a PIL petition, which has sought a direction to the authorities to ensure that the footpaths and roads in the city are maintained in strict compliance with the requirements of the Persons with Disability (Equal Opportunities, Protection of Rights and Full Participation) Act, 2016.\nA division bench comprising acting Chief Justice V. Kameswar Rao and Justice C.M. Joshi passed the order on the petition filed by Letzkit Foundation, a city-based NGO.\nIt has been pointed out that even in places where the footpaths are properly laid in central parts of the city, they are not user friendly, particularly for the physically challenged persons. The 2016 Act emphasises the creation of a barrier-free environment, which includes accessible footpaths,  the creation of a barrier-free environment, which includes accessible footpaths, for physically challenged persons, it has been stated in the petition.\nAlso, the petitioner has pointed out that there are large number of encroachment of footpaths across the city and at many places the residents have used the footpaths in front of their compound walls for gardening, either permanent in nature or by placing large flower pots with large flower bearing plants.\nIt has also been complained in the petition that despite several directions issued by the court on clearing encroachments of footpaths in other PIL petitions earlier, the authorities have failed to keep the footpaths and streets free from obstructions."
  },
  {
    "title": "Rescued  Russian woman and her two daughters sent to Tumakuru detention centre",
    "link": "https://www.thehindu.com/news/national/karnataka/rescued-russian-woman-and-her-two-daughters-sent-to-tumakuru-detention-centre/article69812020.ece",
    "published": "Mon, 14 Jul 2025 21:40:36 +0530",
    "author": "",
    "summary": "Russian woman and daughters rescued from cave in India, sent to Foreigners Restriction Centre until repatriation.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/e26x90/article69812147.ece/alternates/LANDSCAPE_1200/IMG_5978.jpeg",
    "content": "A week after Gokarna police rescued a 40-year-old Russian woman and her two minor daughters, aged six and four, from a cave in the Ramateertha Hills on Wednesday, the police sent the trio to the Foreigners Restriction Centre for Women in Tumakuru until repatriation.\nA team of Gokarna police escorted the trio to the restriction centre.\nThe woman, identified as Nina Kutina alias Mohi, along with her two daughters was living in near-complete isolation for nearly two weeks. According to the police, she came to India on a business visa, which expired in 2017.\nThe Gokarna police who were on routine patrolling duty on Wednesaday evening found her in the cave and along with the help of others, rescued her .\nShe told the police that she had come to Gokarna from Goa and stayed in a cave to meditate as she is inclined towards spirituality. She was practising meditation and Hindu rituals inside the cave.\nThe area where she was living in was termed dangerous after the July 2024 landslide incident. The officials counselled her and managed to convince that how staying in the cave is unsafe for her and her children .\nThe police along with forest officials also started a combing operation in the area after she told the police that she had lost her passport and travel documents .\nAfter several hours of search operations, the officials found the passport and visa which had expired on April 17, 2017. The Foreigners Regional Registration Office Goa on April 19, 2018 issued an exit permit from where she went to Nepal and returned to India again, M. Narayana, Superintendent of Police, Uttara Kannada district, said ."
  },
  {
    "title": "Bhagavad Gita lays stress on equality, says writer",
    "link": "https://www.thehindu.com/news/national/kerala/bhagavad-gita-lays-stress-on-equality-says-writer/article69811934.ece",
    "published": "Mon, 14 Jul 2025 21:36:58 +0530",
    "author": "",
    "summary": "C. Radhakrishnan discusses Bhagavad Gita's message of equality and rejection of power at platinum jubilee celebration.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "\nWriter C. Radhakrishnan said here on Monday (July 14) that the Bhagavad Gita encompasses the virtues of equality and echoes the message to reject power.\nHe was speaking after inaugurating the Bhagavad Gita Vidhyalayam launched as part of the platinum jubilee celebrations of the Travancore Devaswom Board at a function held in Aluva.\nHe said that some were using the Bhagavad Gita as a means to acquire power. “The Bhagavad Gita Vidhayalaya will help in enlightening the youth about the values of our culture,” he was quoted as saying in a release.\nHe released the bookBhagavad Gita Bhashyam - Sowparnikamrithamby handing over a copy to poet V. Madhusoodanan Nair on the occasion, it said."
  },
  {
    "title": "Tiger deaths at M.M. Hills: Govt suspends DCF Chakrapani",
    "link": "https://www.thehindu.com/news/national/karnataka/tiger-deaths-at-mm-hills-govt-suspends-dcf-chakrapani/article69811890.ece",
    "published": "Mon, 14 Jul 2025 21:27:13 +0530",
    "author": "",
    "summary": "State government suspends IFS Officer for negligence in tiger deaths at M.M. Hills Wildlife Sanctuary in Karnataka.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "The State government has suspended Chakrapani Y., Deputy Conservator of Forests (DCF) M.M. Hills Wildlife Division for dereliction of duty and negligence in the case of the unnatural death of five tigers — a mother and her cubs — in the M.M. Hills Wildlife Sanctuary in Chamarajanagar district of Karnataka on June 26.\nOn July 4, Environment Minister Eshwar B. Khandre had ordered the suspension of Assistant Conservator of Forests Gajanana Hegde of M.M. Hills Wildlife Division, and Range Forest Officer-cum-Surveyor Madesh while recommending the suspension of Mr. Chakrapani who is an Indian Forest Service (IFS) Officer for dereliction of duty and negligence in the above case.\nOn June 30, the three officers were sent on compulsory leave until further notice.\nOn Monday the State government issued an order suspending the IFS Officer following a high-level inquiry committee report on the death of the tiger and her cubs.\n“In exercise of the powers under Rule 3(1) of the All India Service (Discipline & Appeal) Rules, 1969, Chakarapani Y., IFS, DCF, MM Hills, Wildlife Division, Kollegal, is placed under suspension with immediate effect, pending inquiry. During the period of suspension, the officer shall be paid subsistence allowance in accordance with Rule 4 of the All India Service (Discipline & Appeal) Rules, 1969.” the order stated.\n“During the period of suspension, the officer shall not leave the headquarters under any circumstances without  the written permission of the state government,” it added."
  },
  {
    "title": "Tejasvi Surya calls tunnel road project a ‘loot of public money’, vows BJP will block it",
    "link": "https://www.thehindu.com/news/national/karnataka/tejasvi-surya-calls-tunnel-road-project-a-loot-of-public-money-vows-bjp-will-block-it/article69811765.ece",
    "published": "Mon, 14 Jul 2025 21:23:41 +0530",
    "author": "",
    "summary": "BJP MP Tejasvi Surya criticizes Bengaluru tunnel road project as a \"loot of public money\" and \"Congress job scam.\"",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/hj42sq/article69812087.ece/alternates/LANDSCAPE_1200/Tejasvi%20Surya.JPEG",
    "content": "BJP Bengaluru South MP Tejasvi Surya has come out strongly against the proposed tunnel road project in Bengaluru, calling it a “loot of public money” and a “Congress job scam.” He vowed that the BJP will not allow the State government, Deputy Chief Minister D.K. Shivakumar, or BBMP officials to proceed with it.\nAddressing reporters at the BJP State office on Monday, Mr. Surya alleged the Detailed Project Report (DPR) and feasibility study for the 18-km tunnel road from Hebbal to Dairy Circle are filled with irregularities.\n“The tunnel project, which costs ₹18,500 crore, is meant only for cars. There is no provision for buses, autos, or two-wheelers. It is nothing but corruption under a new name,” he alleged.\nMr. Surya criticised the Congress government for failing to complete key infrastructure projects, pointing out that over 20 flyovers have remained unfinished for years, even as the Deputy Chief Minister announces 100 km of new ones.\nHe also raised concerns about the suburban railway network, saying the original plan to complete 148 km by 2031 is now in limbo, with the four-corridor project stalled. “Every rupee of public money must be protected. We will fight this project tooth and nail,” he added."
  },
  {
    "title": "Congress struggles to counter P.J. Kurien’s take on Youth Congress leadership",
    "link": "https://www.thehindu.com/news/national/kerala/congress-struggles-to-counter-pj-kuriens-take-on-youth-congress-leadership/article69811966.ece",
    "published": "Mon, 14 Jul 2025 21:21:37 +0530",
    "author": "",
    "summary": "Congress faces internal criticism over lack of grassroots presence in Youth Congress compared to CPI(M)-affiliated groups, sparking debate.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "The Congress on Monday seemed to struggle to put behind party veteran P.J. Kurien’s seemingly discomfiting criticism that the Youth Congress (YC) lacked boots on the ground when compared to its main political rivals, the Communist Party of India (Marxist) [CPI(M)]-affiliated Democratic Youth Federation of India (DYFI) and the Students Federation of India (SFI).\nA section of Congress leaders reportedly felt that Mr. Kurien had inadvertently played into the SFI-DYFI narrative that the Youth Congress leadership led an ivory tower existence far removed from the travails of ordinary people and seemed mono-maniacally fixated on creating “self-promotional” social media content instead of championing public causes.\nMr. Kurien’s alleged attempt to “single out Chandy Oommen, MLA, as a laudable exception of youth leadership,” given the latter’s “ubiquitous grassroots level presence in the community”, also reportedly came under criticism from within the Congress, given its supposed “potential to spur personality clashes and ego conflicts” among young leaders.\nDisconcertingly for the party leadership, Mr. Kurien unapologetically reiterated his position on Monday. “I do not see any young Congress leaders in my constituency,” he told reporters in Kottayam.\nThe supposed disgruntlement with Mr. Kurien among a section of the party’s leadership seemed reflected in Congress veteran K.C. Joseph’s words on social media.\nHe said Mr. Kurien’s “praise” for SFI-DYFI belied the YC-KSU’s relentless struggles against the Left Democratic Front (LDF) government’s wrongdoings. “Nobody needs to praise them. But at least, they can refrain from setting the hounds on them,” Mr. Joseph wrote.\nLeader of the Opposition V.D. Satheesan defended the Youth Congress and the KSU by stating that Congress had an enviable young leadership. “Youth Congress and KSU workers suffered police excesses and endured long spells of incarceration for standing up for people’s causes. Some quarters are irked by their covetable public acceptance,” he said.\nHowever, Mr. Kurien appeared to find some support among a section of senior Congress leaders. For one, Ramesh Chennithala stated that Mr. Kurien’s words were wise counsel and the party should take them in the correct spirit."
  },
  {
    "title": "Experts suggest coordinated action to tackle illegal shark fishing and trade",
    "link": "https://www.thehindu.com/news/national/kerala/experts-suggest-coordinated-action-to-tackle-illegal-shark-fishing-and-trade/article69811740.ece",
    "published": "Mon, 14 Jul 2025 21:20:08 +0530",
    "author": "",
    "summary": "Workshop emphasizes collaboration for shark conservation, proposing strategies like habitat mapping and AI-supported devices for enforcement agencies.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Marine experts have called for coordinated action and increased awareness to tackle illegal shark fishing and trade.\nAn interactive workshop and panel discussion organised by ICAR-Central Marine Fisheries Research Institute (CMFRI) here on Monday (July 14) highlighted the importance of collaboration among various agencies to ensure the conservation of protected species in the wake of India’s recent expansion of the list of sharks and rays protected under the Wildlife (Protection) Act 1972, according to a communication.\nExperts who attended the meeting felt the need to identify gaps in monitoring and enforcement. Habitat mapping, public awareness campaigns, gear modification, demarcation of conserved areas, AI-supported shark recognition devices, and an identification manual were proposed at the workshop.\nShark fins in frozen form may often be difficult to identify by enforcement agencies, requiring the need for a strengthened collective capacity among all agencies involved in fisheries management, trade regulation, biodiversity conservation, and enforcement, the release said.\nInaugurating the workshop, Shaik Khader Rahman, Chief Commissioner, CGST & Customs, said that joint training exercises and a real-time communication channel among Customs, Fisheries officers, Coastal police, researchers, and Forest and Wildlife departments were essential for effective enforcement. There is a need to forge lasting understanding and actionable strategies between conservation and enforcement, he added."
  },
  {
    "title": "Congress government taking firm steps to claim Telangana’s rightful share of Krishna and Godavari waters: Deputy CM Bhatti",
    "link": "https://www.thehindu.com/news/national/telangana/congress-government-taking-firm-steps-to-claim-telanganas-rightful-share-of-krishna-and-godavari-waters-deputy-cm-bhatti/article69811838.ece",
    "published": "Mon, 14 Jul 2025 21:19:40 +0530",
    "author": "",
    "summary": "Deputy CM criticizes BRS leaders for spreading lies, vows to secure Telangana's water rights, complete pending projects.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/p5lt2m/article69812067.ece/alternates/LANDSCAPE_1200/WhatsApp%20Image%202025-07-14%20at%202.11.19%20PM.jpeg",
    "content": "Deputy Chief Minister Mallu Bhatti Vikramarka lashed out at Bharat Rashtra Samithi (BRS) leaders accusing them of spreading lies and indulging in mudslinging against the Congress government, which he said is correcting the mistakes made by the BRS government regarding water resources.\nThe Congress government is steadfast in its commitment to take concrete steps to claim Telangana’s rightful share of Krishna and Godavari waters, he asserted.\nWhile Nagarjunasagar Left Canal can release 1 TMC of water per day, the then Andhra Pradesh government constructed projects upstream of Srisailam to draw 11 TMC per day, he said, alleging that the BRS government not only failed to stop them but also supported those efforts, causing serious hardships for the people of Telangana.\nHe was speaking to reporters after releasing water from the Palair balancing reservoir — in Kusumanchi mandal of Khammam district — into the Nagarjunasagar Left Canal to the ayacut under the Nagarjunasagar Project (NSP) Zone II.\nHe along with Revenue Minister Ponguleti Srinivas Reddy performed puja before switching on the motor at Palair Head Regulator releasing water into NSP left canal for irrigation of the ayacut under the NSP Zone II.\nKhammam Collector Anudeep Durishetty and others were present.\nThe under tunnel (UT) of the NSP main canal at Jujjularaopeta village near Kusumanchi was damaged due to the floods last year. Repairs on the UT were carried out on priority, making it fully operational, sources in the Irrigation department said.\nMr. Vikramarka said, “The Congress government under the leadership of Chief Minister A. Revanth Reddy and Irrigation Minister Uttam Kumar Reddy is taking firm steps to claim Telangana’s rightful share over Krishna and Godavari rivers and complete the pending projects.”\n“Due to the BRS government’s mistakes, especially the construction of the Rayalaseema Lift between Jurala and Srisailam, Khammam district — falling under the Zone II of the NSP Left Canal — is facing severe water shortages. Even the first zone in Nalgonda district is partially affected,” the Deputy Chief Minister added.\nHe asserted that the Congress government laid focus on speedy completion of projects like Palamuru-Ranga Reddy, Nettempadu, Bheema, Koilsagar and the newly initiated Narayanpet-Kodangal lift irrigation scheme on the Krishna River in a planned manner.\nHighlighting the Rythu Bharosa, waiver of farm loans, 24-hour free power supply to farm sector and other pro-farmer policies, he said the Congress government is determined to transform the State into granary and seed bank for the country."
  },
  {
    "title": "T.N. Chief Minister set to launch Ungaludan Stalin programme in Chidambaram on July 15",
    "link": "https://www.thehindu.com/news/national/tamil-nadu/tn-chief-minister-set-to-launch-ungaludan-stalin-programme-in-chidambaram-on-july-15/article69811591.ece",
    "published": "Mon, 14 Jul 2025 21:18:46 +0530",
    "author": "",
    "summary": "Tamil Nadu CM M.K. Stalin launches Ungaludan Stalin program to bring government services to people's homes.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/news/national/tamil-nadu/cjgeq2/article69812451.ece/alternates/LANDSCAPE_1200/WhatsApp%20Image%202025-07-14%20at%2023.35.56_bc0b2027.jpg",
    "content": "Tamil Nadu Chief Minister M.K. Stalin is set to launch theUngaludan Stalinprogramme during an official event in Chidambaram in Cuddalore district on Tuesday. He left Chennai by train on Monday evening and reached Chidambaram later in the day. He is on an official visit to Cuddalore and Mayiladuthurai districts this week.\nIn a social media post, Mr. Stalin said: “A revolutionary programme will commence tomorrow! Instead of you going to government offices,Ungaludan Stalinwill bring the applications to your homes and get the issues resolved.” He said a total of 10,000 camps would be organised as part of the programme.\nMeanwhile, speaking to reporters in Chennai, Revenue Secretary P. Amudha said 43 services from 13 departments would be offered in urban areas and 46 from 15 departments would be offered in rural areas under the programme. About 1 lakh volunteers will be involved in the programme, which will go on till November this year, she added. Referring to other initiatives, Ms. Amudha said that since theMudhalvarin Mugavariprogramme was launched in 2021, over 1.05 crore petitions had been received, and of these, 1.01 crore had been disposed of, as of June 30 this year. Under theMakkaludan Mudhalvarprogramme, launched in 2023, 9.05 lakh pleas were received in urban areas and 12.81 lakh were received in rural areas. Issues raised in about 95% of the petitions had been resolved, she said.\nIn the third phase of theMudhalvarin Mugavariprogramme, which was launched in January and went on till June this year, about 1.80 lakh pleas were received. Of these, about 47,000 have been resolved, she said.\nUngaludan Stalinaims to benefit those who are not in town or are unavailable or unaware of these camps, Ms. Amudha said. Of the 10,000Ungaludan Stalincamps, over 3,000 will be organised in urban areas and over 6,000 in rural areas, she said. The Chief Minister has instructed officials to ensure basic amenities to those visiting the camps, she said. An online portal, which will be launched on Tuesday, will display the schedule of these camps."
  },
  {
    "title": "Group Captain Shukla has completed all seven microgravity experiments onboard ISS: ISRO",
    "link": "https://www.thehindu.com/sci-tech/science/group-captain-shukla-has-completed-all-seven-microgravity-experiments-onboard-iss-isro/article69811249.ece",
    "published": "Mon, 14 Jul 2025 21:17:51 +0530",
    "author": "",
    "summary": "Indian astronaut Group Captain Shubhanshu Shukla completes 7 microgravity experiments during 18-day stay at ISS, returning to Earth.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/3v19i7/article69812047.ece/alternates/LANDSCAPE_1200/image%20-%202025-07-14T211431.131.jpeg",
    "content": "Indian astronaut Group Captain Shubhanshu Shukla, who is headed back to earth after an 18-day stay at the International Space Station (ISS), has completed all seven microgravity experiments.\n“Gaganyatri Shubhanshu Shukla has successfully completed all seven microgravity experiments and other planned activities, achieving a significant milestone in the mission. Experiments on Indian strain of Tardigrades, Myogenesis, Sprouting of methi and moong seeds, Cyanobacteria, Microalgae, Crop seeds and Voyager Display have been completed as planned,” ISRO said on Monday (July 14, 2025).\nGroup Captain Shukla is the first Indian to reach space in the last 41 years.\nISRO had assigned to him several microgravity research experimentsproposed by Indian Principal Investigators (PIs) from various national R&D laboratories and academic institutions.\nDuring his stay in ISS, Group Captain Shukla also spoke with Prime Minister Narendra Modi and had a couple of interactions with the student community back home via ham radio.\nThe Ax-4 research complement includes around 60 scientific studies and activities representing 31 countries, including the U.S., India, Poland, Hungary, Saudi Arabia, Brazil, Nigeria, UAE, and nations across Europe.\nNASA has said that the Dragon spacecraft is returning with more than 580 pounds of cargo, including NASA hardware and data from over 60 experiments conducted during the mission."
  },
  {
    "title": "₹120 crore earmarked for subsidy to mango farmers in Chittoor",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/120-crore-earmarked-for-subsidy-to-mango-farmers-in-chittoor/article69811809.ece",
    "published": "Mon, 14 Jul 2025 21:16:48 +0530",
    "author": "",
    "summary": "Collector Sumit Kumar ensures ₹4 per kg subsidy reaches Totapuri mango farmers supplying to pulp industries in the district.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Announcing that the State government had earmarked ₹120 crore towards subsidy to the mango farmers, Collector Sumit Kumar on Monday instructed the Agriculture and Horticulture officials to ensure that the ₹4 per kg subsidy reaches all the farmers who had supplied the Totapuri mangoes to the pulp industries across the district.\nAddressing a meeting with the officials here, the Collector reviewed the subsidy disbursal status. He said that more than 3 lakh metric tonnes of Totapuri mangoes had been purchased by July second week, mostly from Kuppam and Palamaner areas. The procurement will continue for the next 15 days, Mr. Sumit Kumar said.\nThe Collector stressed ground-level verification of farmers and crop data, instructing the officials to coordinate with field staff of the line departments to check details of IFSC codes, e-crop registration, and quantity supplied."
  },
  {
    "title": "Narsapuram crochet lace wins ‘One District One Product’ award",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/narsapuram-crochet-lace-wins-one-district-one-product-award/article69810928.ece",
    "published": "Mon, 14 Jul 2025 21:15:35 +0530",
    "author": "",
    "summary": "West Godavari District Collector receives 'One District One Product' award for Narsapuram crochet lace craft in Delhi.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/nvcrno/article69811909.ece/alternates/LANDSCAPE_1200/10237_14_7_2025_18_55_53_1_ODOP.JPG",
    "content": "West Godavari District Collector Chadalavada Nagarani received the ‘One District One Product’ award for Narsapuram crochet lace craft from the Minister of Commerce and Industry, Piyush Goyal, at an award ceremony held in Delhi on Monday.\nIn an official release, Ms. Nagarani said that the design and development of the craft would be prioritised going forward, as the craft has the potential to provide employment opportunities for women in the Godavari region.\nOn March 1, 2024, the Narsapuram crochet lace craft was registered in the Geographical Indications Registry, certifying its geographically origin to 19 mandals in West Godavari and Dr.B.R. Ambedkar Konaseema districts.\nThe GI tag for the craft was jointly applied by West Godavari District Alankriti Lace Manufacturing Mahila Mutual Aided Co-operative Societies’ Federation Limited (popularly known as Alankriti Federation), Narsapuram All India Crochet Lace Exporters Association and Andhra Pradesh Handicrafts Development Corporation Limited (APHDC)."
  },
  {
    "title": "KSU takes out demonstration to Higher Education Minister’s official residence",
    "link": "https://www.thehindu.com/news/national/kerala/ksu-takes-out-demonstration-to-higher-education-ministers-official-residence/article69811820.ece",
    "published": "Mon, 14 Jul 2025 21:15:33 +0530",
    "author": "",
    "summary": "They were demanding her resignation over the KEAM engineering entrance fiasco",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Kerala Students Union (KSU) activists on Monday led a protest march to the official residence of Higher Education Minister R. Bindu, demanding her resignation over the KEAM engineering entrance fiasco.\nSenior Congress leader Ramesh Chennithala inaugurated the demonstration. The activists later clashed with the police as they attempted to topple the barricade set up outside the official residence. The police use water cannons multiple times to disperse the protesters, who also burned an effigy.\nKSU State president Aloshious Xavier has said that the protests would be intensified if the Minister refuses to pay heed to their demand."
  },
  {
    "title": "Police protection sought for implementation of disciplinary rules at SSUS",
    "link": "https://www.thehindu.com/news/national/kerala/police-protection-sought-for-implementation-of-disciplinary-rules-at-ssus/article69811643.ece",
    "published": "Mon, 14 Jul 2025 21:14:33 +0530",
    "author": "",
    "summary": "SSUS authorities seek police protection to enforce disciplinary rules amid student protests at Kalady campus.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "The Sree Sankaracharya University of Sanskrit (SSUS) authorities have sought police protection to implement the disciplinary rules on the main campus in Kalady in view of the continuing protests by a section of students against them.\nIn a letter to the District Police Chief (Ernakulam Rural) on July 11, 2025, the Registar-in-charge informed that the authorities were not able to implement the decision to close the main gate after 11 p.m. as the protesting students had assembled in front of it. These violations seem to be having support from outside. Outsiders were also staying in campus hostels, the letter said.\nThe varsity authorities sought protection for officials, besides requesting the help of the police for implementing the decision to bar entry into the campus and hostels after 11 p.m.\nThe letter pointed out that the recommendations made by a sub-committee of the Syndicate to ensure discipline and make the campus drug-free came into effect from July 1. However, three amendments were made to the regulations in view of the strike by a section of students and following discussions involving teaching and non-teaching staff.\nA Syndicate meeting on July 7 had decided to set up hostel monitoring and discipline committees as part of implementing disciplinary rules to make the campus drug-free and ensure the safety of students."
  },
  {
    "title": "Jagruthi leaders urge Women’s Commission action against Teenmar Mallanna",
    "link": "https://www.thehindu.com/news/national/telangana/jagruthi-leaders-urge-womens-commission-action-against-teenmar-mallanna/article69811778.ece",
    "published": "Mon, 14 Jul 2025 21:11:18 +0530",
    "author": "",
    "summary": "Telangana Jagruthi leaders protest derogatory comments, demand action from Women's Commission, face obstacles in lodging complaint.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "HYDERABAD\nA delegation of Telangana Jagruthi leaders on Monday staged a protest in front of the Telangana State Women’s Commission demanding stern action against MLC Teenmar Mallanna for making derogatory comments against Jagruthi president and MLC K. Kavitha.\nLater, in a complaint lodged with the Commission, the Jagruthi leaders M. Madhavi, D. Suchitra, Sandhya Reddy, S. Laxmi, Ravathi Rao, Uma, Afroze Shaheen and others expressed disappointment over the absence of Chairperson Nerella Sharada despite she being given prior information. They stated that even the Commission Secretary had refused to accept the complaint citing non-availability of the chairpersons.\nThey termed the attitude of the Commission Chairperson and Secretary discouraging even in the matter of persons insulting women. Some Commission Members, who were present, however, took the complaint and assured that necessary action would be taken. The Jagruthi leaders alleged that they were not allowed entry inside the Commission for about two hours."
  },
  {
    "title": "Portable ramps, customised wheelchairs introduced for rail passengers in Thiruvananthapuram Division",
    "link": "https://www.thehindu.com/news/national/kerala/portable-ramps-customised-wheelchairs-introduced-for-rail-passengers-in-thiruvananthapuram-division/article69811681.ece",
    "published": "Mon, 14 Jul 2025 21:10:18 +0530",
    "author": "",
    "summary": "Project being implemented along with NGOs Swarga Foundation, Pallium India, and Care & Share",
    "tags": [],
    "image": "https://th-i.thgim.com/public/news/national/kerala/c1p73k/article69811686.ece/alternates/LANDSCAPE_1200/wheelchair%20.jpg",
    "content": "In a novel step towards ensuring accessible travel for all, Thiruvananthapuram Division, Southern Railway, in association with NGOs Swarga Foundation, Pallium India, and Care & Share, introduced ‘Project Sugamya – Breaking Barriers’ at Thiruvananthapuram Central Railway Station on Monday. As part of this initiative, portable wheelchair ramps and customised wheelchairs are introduced at railway stations to enhance the travel experience of differently-abled persons and senior citizens.\nDr. Manish Thaplyal, Divisional Railway Manager, Thiruvananthapuram inaugurated the facilities in the presence of representatives from the NGOs. As part of the initiative, 15 mobile ramps and 15 customised wheelchairs have been handed over to railways. At stations, the wheelchairs and portable ramps will be placed at the station manager’s office at various railway stations in the division for easy access and quick deployment. These wheelchairs are specially designed to facilitate barrier-free movement within station premises and inside coaches.\nThey are designed to offer independence, comfort, and safety to users. The portable ramps enable smooth boarding and alighting of differently-abled passengers using wheelchairs, ensuring safe and hassle-free entry and exit near coach entrances. Ms. Swarnalatha J., managing trustee, Swarga Foundation was present during the function. Senior officers A. Vijuvin, senior divisional operating manager; Lipin Raj M.P., senior divisional personnel officer; and Sunil Kumar, divisional commercial manager, Thiruvananthapuram along with station officials were present during the occasion.\nProject Sugamya stands as a unique example of how organisations with a shared vision of service can partner with Indian Railways to empower differently-abled individuals, enabling them to travel with dignity, independence, and confidence, said a statement from the Southern Railway."
  },
  {
    "title": "Income Tax dept busts major refund fraud in 19 districts of Tamil Nadu",
    "link": "https://www.thehindu.com/news/cities/Tiruchirapalli/income-tax-dept-busts-major-refund-fraud-in-19-districts-of-tamil-nadu/article69811894.ece",
    "published": "Mon, 14 Jul 2025 21:10:01 +0530",
    "author": "",
    "summary": "The Income Tax Department has said that it has uncovered and thwarted a large-scale tax refund fraud involving filing of fabricated tax returns in Tamil Nadu. ",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "The Income Tax Department has said that it has uncovered and thwarted a large-scale tax refund fraud involving filing of fabricated tax returns in Tamil Nadu.\nInvestigations and search operations were carried out across 19 districts in Tamil Nadu, including Tiruchi, Pudukottai, Salem, Madurai, Sivaganga, Theni, Virudhunagar and Tirunelveli. These operations were conducted under the leadership of Michael Jerald, Additional Director of Income Tax (Investigation), Madurai, with the support of officers from Tiruchi, Madurai and Tirunelveli.\nThe department initiated inquiries under various provisions of the Income Tax Act into the fraudulent claims of tax deductions that were falsely declared in order to obtain undue tax refunds.  Preliminary findings revealed that several tax professionals and intermediaries across Tamil Nadu had been facilitating thousands of taxpayers to file fake refund claims by submitting fabricated details in their tax returns.  As a result,  widespread searches and inquiries were being conducted across south Tamil Nadu.\nThe fraudulent claims predominantly involved claiming fake deductions under various sections such as Section 80GGC (donations to political parties), Section 80D (Medical insurance premiums), Section 80 C (Tuition fees) and Section 10 (13 A) House Rent Allowance along with other deduction clauses, a press release from the Income Department said here on Monday.\nThrough these deceitful methods, tax payers were assisted in falsely enhancing their tax deductions enabling them to claim illegitimate refunds.  The fraudulent refund amount is estimated to be approximately ₹500 crore.\nInvestigations have unearthed that dedicated email IDs were created specifically by these agents to file fraudulent tax returns on behalf of taxpayers. Thousands of returns were filed through these email IDs resulting in crores of rupees being refunded wrongfully. During the course of the search operations, incriminating evidence had been recovered and seized.\nThe Income Tax department continues to conduct investigations across all its offices. Taxpayers had been cautioned to remain vigilant and refrain from engaging in such unethical and illegal practices that not only cause revenue loss to the government but expose them to penal consequences.\nAll taxpayers who may have filed incorrect or fraudulent tax returns during the current or previous financial years had been advised to voluntarily come forward and file revised or updated returns. This would not only help in building trust between the taxpayers and the department but also help them avoid penalties, legal proceedings, and prosecution, the release added."
  },
  {
    "title": "BJP raising Congress’ internal matter to divert attention from real issues, alleges Lad",
    "link": "https://www.thehindu.com/news/national/karnataka/bjp-raising-congress-internal-matter-to-divert-attention-from-real-issues-alleges-lad/article69810767.ece",
    "published": "Mon, 14 Jul 2025 21:03:42 +0530",
    "author": "",
    "summary": "Labour Minister accuses BJP of looting, diverting attention from real issues, questions PM Modi's actions, and governance.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Labour Minister Santosh Lad, on Monday, alleged that the BJP has been looting the country’s wealth for the last 11 years, and to cover up its scams and misrule, it is trying to highlight local issues and blowing them out of proportion.\nSpeaking to the press persons in Hubballi on Monday, Mr. Lad said that the Congress-led State government has given good governance in the last two years. Instead of repeatedly pointing out “fight for CM’s chair”, which is the party’s internal matter, let them point out if any there is any mistake in governance, he said.\nHe said that after Operation Sindoor was called off, American President Donald Trump repeatedly stated that he had stopped the war and disgraced India. Despite Prime Minister Narendra Modi’s trips to various nations to befriend them, 183 nations out of 193 sided with Pakistan. And Mr. Modi was forced to send Congress leader Shashi Tharoor to lead a delegation to other nations to present India’s stand, Mr. Lad said, seeking to know why the Opposition is not raising questions over such issues.\nThe Minister said that around two crore children had dropped out of schools across the country, and in Maharashtra, over 800 women had gotten their wombs removed to get work during their menstruation period. “Should we not raise such issues? If we bring all these issues to debate, they will be in an embarrassing position. So to divert the attention, they (BJP) keep talking about our internal matter,” he said.\nMr. Lad said that as per the RBI statement, ₹1.14 thousand crore of fake currency and ₹2,000 currency notes that were withdrawn were still in circulation. “What steps has that Union government taken in this regard? They can criticise anyone on Earth, but we should not raise questions over real issues and seek answers from the Prime Minister. After all he is the Prime Minister of the country. Should we not question him?” he asked."
  },
  {
    "title": "CM launches new ration cards; 80% of Telangana now gets free fine rice",
    "link": "https://www.thehindu.com/news/national/telangana/cm-launches-new-ration-cards-80-of-telangana-now-gets-free-fine-rice/article69811912.ece",
    "published": "Mon, 14 Jul 2025 21:03:10 +0530",
    "author": "",
    "summary": "Telangana government launches historic distribution of over 5.61 lakh new ration cards, ensuring food security for millions.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/news/national/telangana/6xkk02/article69811919.ece/alternates/LANDSCAPE_1200/CM.jpeg",
    "content": "The Telangana government created history in its welfare journey, launching the Statewide distribution of over 5.61 lakh new ration cards in a single phase on Monday, with Chief Minister A. Revanth Reddy along with his Cabinet colleagues launching it in Tungaturthy in Suryapet district.\nSpeaking on the occasion, Mr. Reddy said his government is determined to restore the self-respect of the poor through schemes like ration cards, farmers’ insurance and loan waivers. He said 5.6 lakh new ration cards are sanctioned, 26 lakh people were added to the ration system and 3.10 crore people were receiving fine rice. He also promised to bring Godavari waters to the Tungaturthy through Devdula project.\nFood and Civil Supplies Minister N. Uttam Kumar Reddy called the move a ‘revolution in public service delivery’ and every eligible person would now be guaranteed a ration card. He said the BRS regime had denied lakhs of poor families their right to food, not only by refusing to issue new ration cards but also by blocking updates like the addition or deletion of family members, causing severe hardships for growing households.\nThe launch marked the first large-scale ration card distribution in over 11 years, taking the total number of ration card holders to 95.56 lakh households, covering more than 3.09 crore beneficiaries, he said.\nMr. Uttam Kumar Reddy said the ration card drive was part of a broader transformation that had made Telangana the first State in the world to provide 6 kg of fine rice per person to 80% of its population, entirely free of cost.\nThe Minister said the scheme represented true welfare, inspired by the vision of Congress leader Sonia Gandhi, under whose leadership the UPA government had passed the National Food Security Act.\nMr. Uttam Kumar Reddy revealed that the Telangana government was now spending ₹13,000 crore annually to procure and distribute fine rice. No other State offers this level of quality grain free of cost.\nHe also blamed the BRS government stating the Civil Supplies Corporation was crippled with ₹59,000 crore in liabilities and ₹11,000 crore in accumulated losses. The Congress government had not only revived the department but turned it into the engine of India’s most ambitious welfare programme."
  },
  {
    "title": "IUML to hold protest meeting outside Kozhikode MCH",
    "link": "https://www.thehindu.com/news/national/kerala/iuml-to-hold-protest-meeting-outside-kozhikode-mch/article69811738.ece",
    "published": "Mon, 14 Jul 2025 21:02:04 +0530",
    "author": "",
    "summary": "IUML to protest outside MCH Kozhikode, accusing government of neglecting public health institution for private hospitals.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "The Indian Union Muslim League (IUML) is planning to hold a protest meeting outside the Government Medical College Hospital (MCH), Kozhikode, on Tuesday alleging that the State government is destroying the public health institution to help the “private hospital lobby”.\nAddressing the media here on Monday, IUML district president M.A. Razak and general secretary T.T. Ismail claimed that corruption was rampant there. Along with patients and their caregivers, the hospital staff also were affected by the crisis plaguing the hospital, they said. Back-to-back fire outbreaks, shortage of doctors and nurses, and scarcity of drugs were some of the major issues. They demanded that the government take immediate steps to address the problems.\nMr. Razak and Mr. Ismail alleged that there had been two fire outbreaks at the block housing the casualty section that had been constructed under the Pradhan Mantri Swasthya Suraksha Yojana (PMSSY) using ₹195 crore of Central funds. There had been lapses in the construction of the building. The investigation into these incidents, however, was an attempt to deceive the people, they alleged.\nThey pointed out that thousands of patients were awaiting their turn for the schedule of surgeries because of a shortage of doctors in the Department of Anaesthesia. This was a result of the transfer of a number of doctors to other medical college hospitals for the National Medical Commission’s inspection. There was a shortage of doctors in the Department of Dermatology and Forensic Medicine as well, and post-mortem examinations were being delayed. P.M.A. Salam, State general secretary, IUML, would open the protest meet at 10 a.m. on Tuesday, they added.\nMeanwhile, District Collector Snehil Kumar Singh is reported to have held a meeting with the hospital authorities on Monday. According to sources, there is no final word yet on reopening the PMSSY block, which was temporarily closed in May after the fire outbreaks."
  },
  {
    "title": "Church Street vendors demand an end to harassment",
    "link": "https://www.thehindu.com/news/national/karnataka/church-street-vendors-demand-an-end-to-harassment/article69811671.ece",
    "published": "Mon, 14 Jul 2025 21:02:02 +0530",
    "author": "",
    "summary": "Church Street vendors protest against harassment by BBMP and police, demand fair treatment and protection under the law.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/ezfu36/article69812018.ece/alternates/LANDSCAPE_1200/IMG_5943.jpeg",
    "content": "The street vendors of Church Street on Monday held a silent protest on the street against the alleged harassment they are facing from Bruhat Bengaluru Mahanagara Palike (BBMP) and Bengaluru City Police. The protesters later submitted a memorandum to the BBMP Joint Commissioner, East Zone with their demands.\n“The rich are allowed to park their car for free on Church Street, but poor street vendors are being levied with a penalty of ₹500. This is a violation of the Street Vendors (Protection of Livelihood and Regulation of Street Vending) Act 2014,” the protesters said. They added, “BBMP has only given us ID cards and they also gave loans to street vendors. Now why is the same BBMP harassing street vendors? Is there no space for poor street vendors in Brand Bengaluru?”\nThe memorandum submitted by the Karnataka Pragathipara Beedi Vyaparigala Sangha said that from 15 to 20 years, 53 authorised street vendors, many of whom are women from poor families, have been selling items like clothes, fruits, plastic items, earrings etc. It also alleged that residents’ associations from the locality have pressured the police to harass the vendors.\nThe vendors also demanded that a formal order should be issued to prevent harassment of all registered Church Street vendors and all the unregistered vendors should also be included in BBMP’s next survey and provided with vending certificates. They also said that Town Vending Committee (TVC) meetings should be held before making decisions affecting them.\nThe protesters were taken into preventive custody by the police as they were walking to the BBMP and were released after three hours."
  },
  {
    "title": "People warned against visiting hospitals in Palakkad, Malappuram as Nipah scare escalates",
    "link": "https://www.thehindu.com/news/national/kerala/people-warned-against-visiting-hospitals-in-palakkad-malappuram-as-nipah-scare-escalates/article69811805.ece",
    "published": "Mon, 14 Jul 2025 21:01:24 +0530",
    "author": "",
    "summary": "Health authorities warn of Nipah outbreak in Palakkad and Malappuram, limiting hospital visitors and increasing surveillance to prevent spread.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Health authorities have warned people to avoid visiting patients in hospitals, particularly in Palakkad and Malappuram districts, in the wake of an increased Nipah scare. To minimise risk, hospitals are limiting attendants to one person per patient and mandating masks for all staff, patients, and caregivers.\nAs health officials compiled the contact list of the 58-year-old man from Kumaramputhur, near Mannarkkad, who succumbed to Nipah at a private hospital in Perinthalmanna on Saturday evening, it was revealed that he had mainly used KSRTC buses for travel.\nThe man’s family members, including his wife, children and grandchildren, are among the primary contacts. As a precaution, the school attended by the grandchildren has been shut down.\nBefore his death at the Perinthalmanna hospital, the man had visited three other private hospitals for treatment, which may result in a lengthy contact list. As many as 112 persons who came in contact with him in the last three weeks were traced, and a route map was made by examining, among other things, surveillance camera footage.\nThe number of people under observation for Nipah rose to 609 on Monday. When 207 of them are in Malappuram district, 286 are in Palakkad, 114 in Kozhikode and two in Ernakulam.\nEight persons are under treatment in intensive care units in Malappuram, when five are under treatment in Palakkad. Health Minister Veena George said that 72 quarantined persons tested negative for Nipah in Malappuram. She said 38 persons in the State continued to be in the highest risk category and 133 in high risk category.\nHealth officials strengthened their field work in areas where restrictions were imposed by the district administration. A fever survey is also being done. As many as 17 wards in the vicinity of Kumaramputhur were declared as containment zones, covering areas within a three-kilometre radius of the Nipah-infected person’s residence.\nThe containment zones included seven wards in Kumaramputhur panchayat, three wards in Karakurissi panchayat, four wards in Mannarkkad municipality and three wards in Karimpuzha panchayat.\nCrowding is banned in those zones, and shops there can function from 8 a.m. to 6 p.m. All educational institutions, including madrasas and anganwadis, have been closed there. There are restrictions on people from outside entering the containment zones."
  },
  {
    "title": "Police recovers ₹1.64 lakh, hands it over to cybercrime victim",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/police-recovers-164-lakh-hands-it-over-to-cybercrime-victim/article69811656.ece",
    "published": "Mon, 14 Jul 2025 21:00:31 +0530",
    "author": "",
    "summary": "SP K. Pratap Shiva Kishore returns ₹1.64 lakh to cybercrime victim Prathipati Srinivas Rao, urging caution against online fraud.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/q9qg1d/article69811733.ece/alternates/LANDSCAPE_1200/10745_14_7_2025_20_11_46_1_IMG_20250714_WA0261.JPG",
    "content": "Superintendent of Police (SP) K. Pratap Shiva Kishore recovered ₹1.64 lakh and handed it over to a cybercrime victim, Prathipati Srinivas Rao, of Kaikalur in Eluru district on Monday.\nA native of Taamarakollu village in Kaikalur mandal, Mr. Srinivas Rao, clicked a link on his mobile phone on May 13, 2025. Within no time, the cyber fraudsters drew ₹1.64 lakh from his account. Following this, Mr. Srinivas Rao approached the bank and froze his account. He then registered a complaint at the Kaikalur Town police station.\nOn Mr. Srinivas Rao’s complaint, the Kaikalur Circle Inspector (CI) Krishna swung into action and alerted the cybercrime wing officers, who tracked the complainants bank transactions. They recovered the amount from the accounts of the accused, said Eluru Deputy Superintendent of Police (SP) D. Sravan Kumar.\nThe SP appealed to the public not to click on unknown links, respond to suspicious calls, messages and OTPs, and dial 1930, if they received calls or links from the fraudsters or lost money from their accounts. “If the victims approach the police and the bank officials immediately, investigation officers will respond quickly, get more leads related to the offence and can detect the online frauds,” Mr. Pratap Shiva Kishore said."
  },
  {
    "title": "India can deliver 70% round-the-clock clean electricity by 2030 at lower cost, says TransitionZero report",
    "link": "https://www.thehindu.com/news/national/india-can-deliver-70-round-the-clock-clean-electricity-by-2030-at-lower-cost-says-transitionzero-report/article69810353.ece",
    "published": "Mon, 14 Jul 2025 20:58:48 +0530",
    "author": "",
    "summary": "TransitionZero report shows India can achieve 70% RTC clean electricity by 2030, saving costs and reducing emissions significantly.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/ytaj15/article69811962.ece/alternates/LANDSCAPE_1200/iStock-895028314.jpg",
    "content": "India can achieve 70% round-the-clock (RTC) clean electricity for commercial and industrial (C&I) consumers by the year 2030 — at a lower cost than traditional annual clean energy procurement — according to a new report released by TransitionZero, a global climate analytics non-profit.\nThe report finds that India can deploy 52 GW (gigawatt) of RTC clean electricity capacity to serve 5% of its projected national demand by 2030, generating cost savings of up to ₹9,000 crore ($1 billion) annually for the grid. Unlike conventional renewable energy certificates that allow annual offsetting of electricity use, RTC clean energy matches every hour of consumption with power from zero-carbon sources such as solar, wind, and battery storage.\nEditorial |Energy and efficiency: On India and greater energy efficiency mandates\nIrfan Mohamed, South Asia Analyst at TransitionZero, said, “Our model shows that in India, commercial and industrial customers can meet 70% of their hourly electricity demand with carbon-free electricity at a cost below that of annual renewable energy matching, while driving greater levels of decarbonisation and providing significant benefits to the Indian electricity system.”\nAt the system level, the report shows RTC clean energy could cut emissions by 2.4% under the 70% matching scenario — more than double the 1% emissions reduction achieved under annual matching. When scaled to 100% RTC matching, the potential emissions reduction rises to 7%.\nNotably, the cost of carbon abatement under the RTC model is significantly lower. The analysis reveals that achieving carbon reductions through 70% RTC clean electricity costs nearly three times less than doing so via annual matching.\n“RTC clean electricity — also referred to as 24/7 carbon-free energy (CFE) — means matching every hour of electricity use with electricity from carbon-free sources. It ensures clean power is actually available when it is needed, all day, every day, instead of buying annual clean energy certificates. This approach helps drive real decarbonisation of the electricity system by encouraging clean energy at all times, not just on paper. This approach is especially important for heavy industries and data centres, whose electricity demand is typically flat around the clock, making hourly clean energy matching essential for their decarbonisation,” the report stated.\nMaharashtra, which houses the largest cluster of data centres in India, is poised to benefit significantly from the 24/7 clean energy shift. The State’s energy demand is growing rapidly, particularly from digital infrastructure, which consumes power continuously and requires high reliability.\nEarlier, climate risk assessments have already flagged four existing or planned data centres in Maharashtra as high risk. Transitioning to RTC clean energy, therefore, offers a dual benefit: reduced emissions and enhanced climate resilience.\nAlso read:Maximum MoUs in Maharashtra in sustainability and energy, says CM Fadnavis\n“TransitionZero’s analysis shows that incentivising RTC clean electricity procurement is essential for least-cost grid planning and can deliver significant savings for India’s grid operators, who play a pivotal role in the country’s electricity sector transformation. It also helps build a more resilient and sustainable market for renewable energy power purchase agreements (PPAs),” the report stated.\nIt also warns that failure to plan for flexibility could lead to issues seen in Europe, such as declining PPA capture rates, especially in countries like Spain, where renewable energy oversupply has reduced market revenues.\nThe modelling shows that RTC clean energy at 70% matching can be deployed using a combination of solar, onshore wind, and battery storage. Solar and batteries, in particular, show high synergy, with each MW of solar requiring approximately 2 MWh of battery storage to ensure a stable and reliable power supply throughout the day and night.\nAt 70% matching, the system not only avoids extra costs — it saves them. The report estimates that capital and operational savings could lead to net system cost reductions of up to 35% compared to the annual matching model.\nLong-duration energy storage (LDES) plays a minimal role in the scenario, primarily due to high upfront costs and relatively low competitiveness with 4-hour lithium-ion batteries, which are already widely available and rapidly decreasing in price.\nThe report arrives at a critical time, as the Greenhouse Gas Protocol (GHGP) — the global standard for corporate emissions reporting — is reviewing its Scope 2 guidance. The revised framework is expected to move toward hourly emissions accounting, making RTC clean energy procurement increasingly relevant for ESG-compliant companies.\n“The GHGP is in the process of a multi-year revision of its standards. A central focus of this review is the update to the Scope 2 guidance — the rules governing how companies account for emissions from purchased electricity. While hourly emissions accounting is emerging as the preferred method, the GHGP does not set targets or grade performance,” the report explained.\nTo accelerate the shift, TransitionZero recommends that Indian policymakers provide clear regulatory incentives and support flexible market mechanisms that reward real-time clean energy use, not just aggregate annual numbers.\nMatt Gray, Co-founder and CEO of TransitionZero, says: “Our analysis shows round-the-clock clean electricity planning and procurement is a ‘no regrets’ option for India’s energy planners, grid operators, and large corporations. It shows companies can procure hourly-matched clean electricity at minimal extra cost, and grid operators can save money through least-cost grid planning. In doing so, governments can help deliver the energy transition at the lowest cost.”\nAs India moves towards its goal of achieving 500 GW of non-fossil fuel capacity by 2030, the TransitionZero study makes a strong case for why RTC clean electricity is not just desirable — it is cost-effective, climate-smart, and future-ready."
  },
  {
    "title": "HC annuls appointment of temporary V-Cs in two universities",
    "link": "https://www.thehindu.com/news/national/kerala/hc-annuls-appointment-of-temporary-v-cs-in-two-universities/article69811475.ece",
    "published": "Mon, 14 Jul 2025 20:57:38 +0530",
    "author": "",
    "summary": "Kerala High Court Division Bench upholds ruling on temporary Vice-Chancellors' appointments, emphasizing need for regular appointments.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "A Division Bench of the Kerala High Court on Monday upheld a Single Bench order of May 19 that had termed as ‘not sustainable in law’ the appointment of K. Sivaprasad and Ciza Thomas as temporary Vice-Chancellors of APJ Abdul Kalam Technological University and the Kerala University of Digital Sciences, Innovation and Technology, respectively.\nMonday’s order was passed by a Division Bench comprising Justice Anil K. Narendran and Justice P.V. Balakrishnan, while dismissing an appeal filed by Governor  Rajendra Vishwanath Arlekar, who is also the  Chancellor of the two universities, challenging the single judge’s order.\nWhile Mr. Sivaprasad had earlier been working as Professor, Department of Ship Technology, Cochin University of Science and Technology, Ms. Thomas had retired as Senior Joint Director from the Directorate of Technical Education.\nThe Division Bench said in its judgment that an order of temporary appointment of Vice-Chancellors, issued by the Chancellor in exercise of the powers under Section 13(7) of the Technological University Act or Section 11(10) of the Digital University Act, shall be for a period of not exceeding six months, in the aggregate.\nTherefore, the Chancellor has no power to issue notifications appointing a person to exercise the powers and perform the duties of the Vice-Chancellor of the two universities, until further orders, pending regular appointment of the Vice-Chancellor. In such circumstances, the single judge cannot be found at fault for declaring the notifications as not sustainable in law, the Bench added.\nThe Bench reminded  that the Chancellor and the State Government ought to act proactively to ensure that regular appointment is made to the post of Vice-Chancellor in the universities without any delay. This was after considering the stalemate in the administration of the two universities, which has been continuing for a considerable period, and which harmed their functioning and also the interest of the student community, it said.\nAdvocate General K. Gopalakrishna Kurup submitted that the Chancellor cannot appoint any person to exercise the powers and perform the duties of the Vice-Chancellor of the universities, unless the name was recommended by the government.\nReferring to Section 13(7) of the Technological University Act, where the vacancy of Vice-Chancellor arises in any of the circumstances enumerated in clauses (i) to (v), the Chancellor may appoint the Vice-Chancellor of any other university or the Pro-Vice Chancellor of the technological university or the Secretary to Government, Higher Education Department, as recommended by the government, to be the Vice-Chancellor for a period not exceeding six months in the aggregate.\nLikewise, as per Section 11(10) of the Digital University Act, if there was a temporary vacancy in the post of Vice-Chancellor due to any unforeseen reason, the Chancellor may appoint the Vice-Chancellor of any other University or the Secretary of the Electronics and Information Technology Department, as recommended by the government, to be the Vice-Chancellor for a period not exceeding six months, in the aggregate, the court observed.\nCiting observations of the Supreme Court and how universities ought to function in an autonomous manner, the court further said being a leader and head of the institution, the V-C has to play an important role. The V-C functions as a bridge between the executive and academic wings of the university. As per norms, the V-C must be an eminent academician, and excellent administrator and also someone having high moral stature, it said."
  },
  {
    "title": "Complaints of ‘stomach pain’ by children require multidisciplinary approach, say doctors",
    "link": "https://www.thehindu.com/news/national/karnataka/complaints-of-stomach-pain-by-children-require-multidisciplinary-approach-say-doctors/article69811648.ece",
    "published": "Mon, 14 Jul 2025 20:54:31 +0530",
    "author": "",
    "summary": "JSS Medical College doctors recommend multidisciplinary approach for children's stomach pain, uncovering psychological causes and avoiding unnecessary surgeries.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Doctors at the JSS Medical College in Mysuru have suggested a multidisciplinary approach to addressing the complaints of ‘stomach pain’ by children even though physical illnesses of any kind have been ruled out by laboratory investigations.\nThe doctors, who carried out a study that was presented at the Child and Adolescent Psychiatry conference at NIMHANS in Bengaluru, found certain psychological causes for some complaints of stomach pain by children.\nThough the study was confined to four children complaining of stomach pain despite showing no physical illness after undergoing laboratory investigations like diagnostic laparoscopy, endoscopy, and CT abdominal scan, paediatric surgeon Sudhamshu K.C. said some of the major reasons for children complaining of stomach pain without any underlying cause included depression followed by learning disability, bullying at school, issues with parents, and visual disturbances.\nOut of every 100 children referred to the paediatric surgery department of the hospital, about 15 to 20% qualify for multidisciplinary approach involving doctors from psychiatry, paediatrics, and paediatric surgery departments, said Dr. Sudhamshu, who was part of the study.\nDoctors said the children who complain about stomach pain without any physical illness will actually feel the psychosomatic pain arising out of psychological issues. Such children even refuse to go to school, missing out on their studies for extended period of months together.\nEven though paediatric surgery was a referral department, Professor of Psychiatry, JSS Medical College, Mysuru, M. Kishor said a large number of parents were presenting themselves before the paediatric surgery department directly seeking surgical intervention for the stomach pain of their children.\nOver the last year, about 12 to 14 children with stomach pain, who qualified for such a multidisciplinary approach, had been actively engaged with the departments of psychiatry and paediatrics, he said.\nAfter working closely with the affected children and their parents, the team of doctors from the different departments had found that the causes among these children ranged from specific learning disabilities (dyslexia), depression, anxiety, mobile addiction, intellectual disabilities, issues in parents, including over-parenting, besides poor eating and sleeping habits, Dr. Kishor said.\n“Through such an approach, we have been able to avoid a large number of unnecessary surgical interventions. Most of the children, who were under the collaborative care of psychiatry and paediatric department, are back in school,” he said."
  },
  {
    "title": "MUV safari will resume in Idukki from July 16",
    "link": "https://www.thehindu.com/news/national/kerala/muv-safari-will-resume-in-idukki-from-july-16/article69811781.ece",
    "published": "Mon, 14 Jul 2025 20:53:41 +0530",
    "author": "",
    "summary": "Idukki resumes MUV safari with strict safety regulations and route monitoring committee for off-road trekking.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/e0gd7s/article69811858.ece/alternates/LANDSCAPE_1200/80759_14_7_2025_18_59_37_1_JEEPWAGAMON.JPG",
    "content": "The Multi-utility vehicle (MUV) safari and on- and off-road trekking will be resumed in Idukki from Wednesday (July 16, 2025) onwards.\nDistrict Collector V. Vigneshwari issued a detailed order on Monday (July 14, 2025) outlining strict conditions for the reopening of MUV safari and off-road safari in the nine routes in the first phase in the Idukki and Devikulam subdivisions in the district. The nine approved off-road MUV safari routes include the Parunthumpara-Satram route, Kuttikkanam-Madammakulam, Pambanar-Mlamala-Uppupara belt, Elappara-Kappakkanam-Uluppuni-Chakkimali-Vellarankallu stretch, Vagamon (Elappara)-Ottamaram Para Viewpoint, Vagamon-Kallattupara waterfalls trail in the Idukki subdivision, and the Munnar-Ponmudi-Nadukani-Munnar loop, Suryanelli-Kolukkumalai Sunrise route, and Mankulam-Perumbankuttu-Anakulam-6th Mile Hanging Bridge-33 Waterfall-Viripara areas in the Devikulam subdivision.\nAccording to the Collector, new order issued by the district administration mandates compliance with the Kerala Adventure Tourism Promotion Society (KATPS)-issued safety regulations.\n“A multi-department regularisation drive will begin on Tuesday (July 15), ensuring that only registered and verified operators can resume service. During the drive, the officials will inspect the vehicle’s fitness, driver records, insurance, police clearance, GPS installation, and route mapping,“ said the order.\n“The MUV safari routes will be reviewed by a route monitoring committee comprising Sub-Collector, RTO, concerned Station House Officer (SHO), panchayat secretary, and District Tourism Promotion Council Secretary (DTPC). The committee will inspect the terrain and classify the routes. Only drivers approved by the committee will be allowed to operate and on the prescribed routes,” said the order.\n“The timing of the activities between 4 a.m. and 6 p.m. from and to the starting point of the trip will depend on the prevailing weather conditions, as decided by the committee. Every trip shall include tourist insurance, and a portion of ticket revenue shall go to a driver welfare fund for medical/accident coverage. Mandatory audits will be held twice yearly in April and October, chaired by the Sub-collector or as proposed by the route committee. Those who violate the committee’s decisions will invite strict penalties, including license suspension and disqualification. There will be legal action in case of accidents due to negligence,” said the order.\nThe Collector imposed a ban on multi-utility vehicle (MUV) safaris in Idukki under the Disaster Management Act, 2005, on July 5, after an MUV safari vehicle met with an accident in Munnar on July 1 in which onea tourist was killed and 10 injured."
  },
  {
    "title": "Three of inter-State gang arrested, 23 two-wheelers recovered",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/three-of-inter-state-gang-arrested-23-two-wheelers-recovered/article69811564.ece",
    "published": "Mon, 14 Jul 2025 20:53:14 +0530",
    "author": "",
    "summary": "Kurnool police on Monday arrested three members of an inter-State gang and recovered 23 two-wheelers and an auto.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Kurnool police on Monday arrested three members of an inter-State gang and recovered 23 two-wheelers and an auto.\nAddressing media persons here on Monday (July 14), Kurnool Deputy Superintendent of Police K. Babu Prasad said that they have received several complaints of theft of motorcycles from the Government General Hospital in the city and special teams were formed to nab the accused. Following specific information, the police nabbed three accused from Arundathi Nagar and recovered the stolen vehicles.\nMr. Prasad said that the accused were identified as Shaik Baba Fakruddin and Shaik Dada Peer, both hailing from Annammayya district and C. Aneesh of Kadapa along with the absconding accused Subhan and Shahpeera of Nandyal. They stole vehicles from Kurnool, Guntakal, Nandyal, Hyderabad and other places and prepared duplicate registration certificates of the vehicles and sold them, the police said."
  },
  {
    "title": "Franchises in Andhra Premier League vie for all-rounders in auction",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/franchises-in-andhra-premier-league-vie-for-all-rounders-in-auction/article69811761.ece",
    "published": "Mon, 14 Jul 2025 20:52:53 +0530",
    "author": "",
    "summary": "Franchises in Andhra Premier League vie for all-rounders in auction, with Paila Avinash fetching highest price.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/d5j68g/article69812357.ece/alternates/LANDSCAPE_1200/9604_14_7_2025_22_4_19_1_IMG_20250714_WA0014.JPG",
    "content": "Franchises taking part in the Andhra Premier League (APL) have vied for all-rounders in the auction held in Visakhapatnam on Monday. The fourth season of the APL will be held from August 8 to 24 at the Dr. YSR ACA-VDCA Stadium in Visakhapatnam.\nSeven franchises participated in the auction, with all-rounder Paila Avinash bagged by Royals of Rayalaseema for the highest price of ₹11.5 lakh. The same franchise also picked up P. Girinath Reddy for ₹10.05 lakh, while the Bhimavaram Bulls signed all-rounder P.V. Satyanarayana Raju for ₹9.8 lakh.\nAnother all-rounder, Sourabh Kumar, was acquired by the Tungabhadra Warriors for ₹8.80 lakh. In the third season, 430 players were part of the auction pool, while this season, the number has increased to 520. While six franchises competed last year, a new team has been added this season, taking the total to seven."
  },
  {
    "title": "Thiruvananthapuram and Kochi to have city logistics plans",
    "link": "https://www.thehindu.com/news/national/kerala/thiruvananthapuram-and-kochi-to-have-city-logistics-plans/article69811546.ece",
    "published": "Mon, 14 Jul 2025 20:50:15 +0530",
    "author": "",
    "summary": "The Department for Promotion of Industry and Internal Trade (DPIIT) has selected Thiruvananthapuram and Kochi among 50 tier-2/3 cities across the country for the preparation of city logistics plans to reduce logistics costs, congestion and improve connectivity.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "The Department for Promotion of Industry and Internal Trade (DPIIT) has selected Thiruvananthapuram and Kochi among 50 tier-2/3 cities across the country for the preparation of city logistics plans to reduce logistics costs, congestion and improve connectivity. The State government has now proposed the Directorate of Urban Affairs as the nodal agency for coordinating activities related to the city logistics plans.\n\nThe National Logistics Policy (NLP) aims to drive economic growth and business competitiveness through an integrated, efficient, sustainable, and cost-effective logistics network using advanced technology, processes, and skilled manpower. The city logistics plans are expected to be a comprehensive framework designed to optimise urban goods movement, reduce costs, and minimise environmental impact.\n\nIt will be a strategic plan designed to adequately address the urban freight and logistics needs of the city’s population and businesses to achieve economic growth with better quality of life and environment. The CLP helps identify the main needs, plan and evaluate the possible solutions for urban freight and logistics in and around the city. It is expected to foster collaboration among government bodies, transport providers, businesses, and citizens. The logistics plan will be prepared in a structure and format that can be easily integrated with the Comprehensive Mobility Plan (CMP) of the city.\n\nOne of the focus areas will be in reducing urban emissions by optimising vehicle movement within cities through strategic routing and consolidation of freight. The plan will also prioritise efficiency by optimising goods movement. This involves development of freight infrastructure and its integration into commercial streets, optimisation of freight routes, smart traffic management systems utilising real-time data, ensuring prompt deliveries and minimising operational costs."
  },
  {
    "title": "Veteran journalist Channaiah Itnalmath dead",
    "link": "https://www.thehindu.com/news/national/karnataka/veteran-journalist-channaiah-itnalmath-dead/article69811616.ece",
    "published": "Mon, 14 Jul 2025 20:49:09 +0530",
    "author": "",
    "summary": "Channaiah A. Itnalmath, veteran journalist and pro-Kannada campaigner, remembered for impactful reporting and social activism in Karnataka.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/5gge58/article69811915.ece/alternates/LANDSCAPE_1200/9727_14_7_2025_19_56_29_1_15BGMITNALMATH1.JPEG",
    "content": "Channaiah A. Itnalmath, veteran journalist, activist, and pro-Kannada campaigner, died in Athani in Belagavi district on Monday. The 62-year-old writer was undergoing treatment for rectal cancer, family sources said.\nHe is survived by his mother, wife and son Abhinav Itnalmath, a student of medicine.\nA bilingual journalist, Mr. Itnalmath had worked for decades in Kannada and English newspapers. Before joining the newsroom, he had worked for Vimochana Sansthe, founded by B.L. Patil, for the rehabilitation of Devadasis and the education of their children. He was involved in running a school for the children of Devadasis in Athani and a clinic in Saundatti.\nMr. Itnalmath was respected for his in-depth understanding of various social and political issues.\nHe led several campaigns through his reports. They included comprehensive irrigation of the drier regions of Belagavi district like Athani, Nippani and Ramdurg, and creation of a new Athani district. His stories also gave voice to the woes of Kannada speaking communities in neighbouring Jath in Maharashtra.\nKLE society chairman Prabhakar Kore offered his condolences. Mr. Itnalmath was known for his dedication to truth and impactful reporting over a career. His analytical stories and sharp political commentary left a lasting impression on the readers. His journalistic contributions played a significant role in highlighting local issues and influencing public discourse in the region, Mr. Kore said.\nMahantesh Kavatagimath, former MLC and KLE society director, said that Mr. Itnalmath had been a relentless campaigner for the cause of northern Karnataka. “He would follow up on development issues long after others had forgotten them. His articles provided content for legislators who spoke in the winter session of the legislature,” he said."
  },
  {
    "title": "NIT-C hopes to cross 1,000-mark in placements this year too",
    "link": "https://www.thehindu.com/news/national/kerala/nit-c-hopes-to-cross-1000-mark-in-placements-this-year-too/article69811427.ece",
    "published": "Mon, 14 Jul 2025 20:48:13 +0530",
    "author": "",
    "summary": "NIT-Calicut aims for 1,000+ placements, with 930 students already placed, including high-paying offers and internship opportunities.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "The National Institute of Technology-Calicut (NIT-C) is hopeful of crossing the 1,000-mark in the number of placements for the fourth year in a row as the placements for the year 2024-25 are in progress. So far, 930 (72%) students of the institute have found placement with top companies across the country. The institute had 1,080 (77%) placements in the previous year.\n“As many as 103 students have received offers with packages exceeding ₹25 lakh per annum. At least 81% of the students have been placed in circuit branches with an average salary of ₹18.66 lakh per annum. The core engineering branches have seen a jump in average salary, from 8.71 LPA last year to 11.88 LPA this year,” said Vinay V. Panicker, chairperson, Centre for Career Development (CCD) at NIT-C, adding that the highest package for the year is ₹43.24 lakh per annum.\nBesides this, 232 students have secured internships that come with the possibility of pre-placement offers, which is a trend that many companies are adopting at present. Instead of making full-time offers upfront, they prefer students to intern for 6-12 months, allowing both sides to evaluate each other."
  },
  {
    "title": "COMEDK counselling will be held from July 18",
    "link": "https://www.thehindu.com/news/national/karnataka/comedk-counselling-will-be-held-from-july-18/article69811574.ece",
    "published": "Mon, 14 Jul 2025 20:48:04 +0530",
    "author": "",
    "summary": "COMEDK to conduct engineering counselling from July 18, 2025, following KEA's schedule for seat allotment.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "The Consortium of Medical Engineering and Dental Colleges of Karnataka (COMEDK) will hold the counselling for engineering courses from July 18, 2025.\nThis year, following the condition in the consensual agreement, the COMEDK authorities said that they have waited for the Karnataka Examinations Authority (KEA) to complete its first round. “As per the consensus, if KEA fails to complete the first round of counselling by July 10, we were told to go ahead without seat allotment. We have waited till date and scheduled our counselling from July 18,” said a senior official of COMEDK.\nAs per the schedule released by COMEDK, the choice making and mock for first round will commence from July 18 and real allotment results will be announced on July 28 to August 1. Students must report to the colleges between July 28 and August 1. Colleges have been asked to share the reporting status to COMEDK between July 28 and August 4.\nAccording to the revised schedule, the KEA’s first round of results will be announced on July 25 and KEA authorities are confident of completing the same on time. KEA Executive Director H. Prasanna said, “As per the schedule released by COMEDK, the first round results will be announced on July 28, but we will be announcing our results on July 25. So, there is no question of COMEDK going ahead of KEA.”\nTalking about the technical glitch, Mr. Prasanna said that the same has been rectified 90% and students are making their choices. “If the counselling is delayed, then it is only because of the delay in the medical and dental seat matrix. If it is delayed by two to three days, we will request COMEDK authorities to hold their results till then,” Mr. Prasanna stated."
  },
  {
    "title": "Bindu, Sivankutty hail High Court verdict on V-C appointments",
    "link": "https://www.thehindu.com/news/national/kerala/bindu-sivankutty-hail-high-court-verdict-on-v-c-appointments/article69811725.ece",
    "published": "Mon, 14 Jul 2025 20:48:04 +0530",
    "author": "",
    "summary": "Kerala High Court validates State government's stance on temporary Vice-Chancellors, emphasizing adherence to legal procedures in university governance.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Higher Education Minister R. Bindu has said that the Kerala High Court decision to annul the appointment of temporary Vice-Chancellors for Digital University Kerala and APJ Abdul Kalam Technological University has validated the State government’s position in the issue.\n“For quite some time, the government’s stance has been proven correct by court rulings. While the Chancellor does have powers related to universities, overstepping these boundaries can lead to complications,” the Minister told mediapersons here.\nShe added that the universities in the State function within the framework of laws enacted by the Legislative Assembly, while the overall oversight lies with the State government. “Court rulings have proved that the unilateral appointments of Vice-Chancellors, both by the previous Governor and the current one, are unconstitutional,” she said.\nDr. Bindu also said that Vice-Chancellors must focus on providing an environment conducive to learning, rather than being involved in political moves. The responsibility of upholding academic interests must come first. “It is imperative that we adhere to established procedures, and any deviation from this leads to legal intervention, as the courts have demonstrated,” she said.\nGeneral Education Minister V. Sivankutty also hailed the High Court ruling as a victory for the government’s commitment to ensuring transparency in the education sector. The verdict is a decisive step in the government’s pursuit of achieving excellence in the higher education sector, he said.\nThe Confederation of University Employees Organisations, Kerala, stated that the decision is a strong rebuke to the unlawful actions of the Governor. The organisation added that the Governor’s decision to override the State’s panel of nominees was a direct attack on academic autonomy and the rights of the academic community.\nThe Federation of University Teachers Associations also welcomed the ruling, stating that it underscores the importance of following the legal framework and respecting the democratic processes in university governance. They strongly advocated the resignation of the temporary Vice-Chancellors who were appointed “unlawfully”."
  },
  {
    "title": "All MPFCs in Chittoor to get power and water supply in five days, says Collector",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/all-mpfcs-in-chittoor-to-get-power-and-water-in-five-days-says-collector/article69811507.ece",
    "published": "Mon, 14 Jul 2025 20:47:23 +0530",
    "author": "",
    "summary": "Collector Sumit Kumar on Monday said that all the MPFC (Multi-purpose Facility Centres) warehouses across Chittoor district would be strengthened with power and water facilities within five days",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/qrtey2/article69811857.ece/alternates/LANDSCAPE_1200/10745_14_7_2025_19_58_25_1_IMG_20250714_WA0251.JPG",
    "content": "Collector Sumit Kumar on Monday said that all the MPFC (Multi-purpose Facility Centres) warehouses across Chittoor district would be strengthened with power and water facilities within five days.\nAddressing a review meeting with officials of the district cooperative wing here, the Collector said that while 40 godowns were sanctioned in the first phase, construction of 27 had been completed. “Work is under brisk progress at four units, and the construction of the remaining sites will be taken up shortly,” Mr. Kumar said, adding that proper road connectivity was required for ten godowns.\nHe said that the status of infrastructure and development plans to strengthen godowns would be reviewed and monitored thoroughly.\nThe Collector said that 30,500 metric tonnes of groundnut seeds had been supplied to the farmers across the district for this Khariff season. “The farmers should note that fertilizer stocks are available with the Rythu Seva Kendras. The farmers can utilize them to suit their crop patterns and needs,” he said.\nTo give a fillip to the cooperative services, petrol pumps and PM Jan Aushadhi Kendras will be set up through cooperative societies as a pilot project in select places, including Chittoor, Gangadhara Nellore, Palamaner and Choutugunta area, the Collector said."
  },
  {
    "title": "Sompeta protests of 2010 saw govt. focus on green energy: actor R. Narayana",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/sompeta-protests-of-2010-saw-govt-focus-on-green-energy-actor-r-narayana/article69811353.ece",
    "published": "Mon, 14 Jul 2025 20:46:56 +0530",
    "author": "",
    "summary": "R. Narayana Murthy leads movement against thermal power plants, urging government to prioritize green energy and protect water bodies.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Noted film producer and actor R. Narayana Murthy said on Monday that the Sompeta agitation against the establishment of a thermal power plant in July, 2010, prompted both, the Union and State governments to focus and prioritise green energy, shelving plans for construction of new thermal plants across the country. He said that the people’s movement in Sompeta inspired many to protest against polluting industries and thermal plants in the country.\nAlong with Human Rights Forum’s coordinator for Telangana V.S. Krishna and Andhra Pradesh HRF State president K.V.Jagannadha Rao, Mr. Narayana Murthy paid tributes to those who had died in the police firing on protesters near Sompeta on July 14, 2010.\nSpeaking on the occasion, he urged the government not to allow the destruction of nature since such actions would lead to natural calamities.\nMr. Krishna added that the protection of water bodies should be the first and foremost priority of the government.\nParyavarana Parirakashana Sangham president Y. Krishna Murthy who presided over the meeting said that people’s cooperation made the government cancel permissions for the construction of a thermal plant in Sompeta, Srikakulam district.\nIn another meeting, AP BC Sangham State general secretary Beena Dhellirao and pastor David Abraham recalled the sacrifices of many families during the 2010 agitation against the thermal power plant. They planted saplings and vowed to protect water bodies in the district."
  },
  {
    "title": "Women participation in labour force to be raised to 50%: Minister",
    "link": "https://www.thehindu.com/news/national/kerala/women-participation-in-labour-force-to-be-raised-to-50-minister/article69811789.ece",
    "published": "Mon, 14 Jul 2025 20:46:07 +0530",
    "author": "",
    "summary": "Kudumbashree looking to increase self-help group membership to 50 lakh",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Women’s participation in the labour force will be increased from 20% to 50%, Minister for Local Self-Governments M.B. Rajesh has said.\nHe was speaking after performing the State-level inauguration of a meet of Kudumbashree community development society (CDS) chairpersons and release of CDS-level progress reports in Thiruvalla on Monday.\nThe Minister said the Kudumbashree aimed at providing women skill training and employment in various sectors in association with the Vijnana Keralam project. “The goal is to provide wage employment to one lakh women before Onam and three lakh women by March. This will pave the way for progress of their families and the State’s economy. It will also help raise the State into the company of middle-income countries,” the Minister said.\nMr. Rajesh said another goal of the Kudumbashree was increasing the membership of the self-help groups to 50 lakh. He pointed out that Kudumbashree had been able to bring women to the forefront of the State’s social, political, and cultural spheres in the past quarter of a century. He spoke of the Kudumbashree Technology Advancement Programme, K4Care, Kudumbashree Premium Cafe, Ma Care that were being implemented by the Kudumbashree.\nGift packets comprising Kudumbashree products will reach the market through the Pocketmart app in time for Onam, the Minister said.\nMathew T. Thomas, MLA, in his presidential address, called for widespread diversification in Kudumbashree’s future activities.\nCDS chairpersons from Thiruvananthapuram, Kollam, Pathanamthitta, Kottayam, Alappuzha, Idukki, and Ernakulam took part in the CDS meet. A presentation on the Kudumbashree’s future activities and district presentations were also held. Kudumbashree executive director H. Dineshan was present."
  },
  {
    "title": "Congress leader, two others arrested in drug case in Maharashtra",
    "link": "https://www.thehindu.com/news/national/karnataka/congress-leader-two-others-arrested-in-drug-case-in-maharashtra/article69811175.ece",
    "published": "Mon, 14 Jul 2025 20:45:55 +0530",
    "author": "",
    "summary": "Kalaburagi South Block Congress president arrested by Maharashtra Police in drug case, calls for CBI investigation.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Kalaburagi South Block Congress president Lingaraj Kanni and two others have been arrested by Maharashtra Police in a drug case.\nThe Thane police had arrested Lingaraj Kanni and Tausif Surve, a driver, and Irfan Ibrahim for allegedly supplying codeine-based syrup in Kalyan city. The accused were arrested when they were supplying 120 bottles of syrup containing codeine last month, but the case came to light on Sunday.\nA case has been registered under the Narcotic Drugs and Psychotropic Substances (NDPS) Act for keeping in possession Codeine drug, which cannot be supplied without prescription.\nSiddaling Swami, National honorary president of Sri Ram Sene, urged the Maharashtra government to hand over the case to the Central Bureau of Investigation (CBI) to ensure an impartial and thorough inquiry, free from any potential influence.\nProducing the photographs in which the accused Lingaraj Kanni is seen with All India Congress Committee President Mallikarjun Kharge and Rural Development, Panchayat Raj Minister Priyank Kharge and the Kalaburagi South MLA Allamprabhu Patil at a press conference here on Monday, Siddalinga Swami claimed if the Maharashtra government handle this particular case, there is every possibility of suppressing the case as Mr. Kanni holds considerable influence in the political circles."
  },
  {
    "title": "Gurukul student ends life in Yadadri, another critically injured in Mancherial",
    "link": "https://www.thehindu.com/news/national/telangana/gurukul-student-ends-life-in-yadadri-another-critically-injured-in-mancherial/article69811695.ece",
    "published": "Mon, 14 Jul 2025 20:45:03 +0530",
    "author": "",
    "summary": "Tragic incidents at Telangana hostels: student suicides and food poisoning outbreak, prompting investigations and medical treatment.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "A student in Class 5 at Mahatma Jyotiba Phule Telangana Backward Classes Welfare Residential Educational Institutions Society, Toopranpet in Choutuppal of Yadadri-Bhuvanagiri district, was found dead on the hostel premises on Monday.\nThe victim is alleged to have jumped out of the multistorey hostel building. Reportedly, the student hailing from Mahbubnagar reported back at the hostel on Sunday after visiting her home recently. It was alleged that the girl was reluctant to stay at the hostel and study.\nThe victim’s body was shifted for post-mortem examination and the police opened an investigation.\nIn a separate incident, in the Mancherial district, at the Kasturba Gandhi Balika Vidyalaya, Naspur, a Class 9 student was rushed to the government hospital moments after she allegedly jumped off the hostel building to take her life.\nThe student sustained severe injuries and was being treated. Reportedly, the girl did not want to stay at the hostel and study.\n(Roshni, suicide prevention helpline, 8142020033/44)\nStudents fall ill\nMeanwhile, in another incident, at least 15 students at the State ST Ashram (G) UPS, Mudigonda, of Devarakonda in Nalgonda district, were admitted to the government general hospital on Monday, after they complained of stomach ache, diarrhoea, and vomiting, allegedly after consuming contaminated food from the hostel mess.\nA few students complained of stomach ache Sunday night after eating a non-vegetarian meal. However, they were administered first aid at the hostel. The issue on Monday caught attention after some 30 students showed common symptoms. It was said that the students had tamarind rice for breakfast.\nAll students were stable and kept under observation at the Devarakonda Area Hospital."
  },
  {
    "title": "Man gets life imprisonment for sexually abusing minor girl",
    "link": "https://www.thehindu.com/news/national/karnataka/man-sentenced-to-life-imprisonment-for-sexually-abusing-minor-girl/article69811748.ece",
    "published": "Mon, 14 Jul 2025 20:44:52 +0530",
    "author": "",
    "summary": "59-year-old man sentenced to life in prison for sexually abusing minor girl in Mandya district, Karnataka.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "A court in Mandya has sentenced a 59-year-old man to life imprisonment for sexually abusing a minor girl.\nThe convict, identified as Shivanna, had lured the girl playing in front of her house in Belagola in Srirangapatna taluk of Mandya district in December 2023. The K.R. Sagar police booked Shivanna for taking the minor girl to his house and sexually abusing the girl.\nMandya district Superintendent of Police, in a statement, said the second District and Sessions court in Mandya had sentenced Shivanna to life imprisonment and imposed a penalty of ₹1 lakh."
  },
  {
    "title": "Minister faults YSRCP for power crisis in Andhra Pradesh",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/minister-faults-ysrcp-for-power-crisis-in-andhra-pradesh/article69811466.ece",
    "published": "Mon, 14 Jul 2025 20:42:16 +0530",
    "author": "",
    "summary": "Minister for Energy Gottipati Ravi Kumar on Monday blamed the YSRCP government for the ongoing infrastructure crisis in the State’s power sector",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/kzo59/article69811815.ece/alternates/LANDSCAPE_1200/10745_14_7_2025_17_45_14_1_IMG_20250714_WA0227.JPG",
    "content": "Minister for Energy Gottipati Ravi Kumar on Monday blamed the YSRCP government for the ongoing infrastructure crisis in the State’s power sector. He said that the former administration failed to utilise the Central government schemes and mismanaged the energy sector, resulting in a heavy burden on the people.\nHe along with Minister for Social Welfare Dr. Dola Sree Bala Veeranjaneya Swamy laid the foundation stone of the 33\\11 KV substation at Kalluru village in Kurichedu mandal of Prakasam district. The substation, sanctioned at a cost of ₹3.80 crore, is part of the Coalition government’s efforts to strengthen the power supply network in high-demand areas, the Energy Minister said.\nMr. Gottipati also laid the foundation stone for another 33/11 KV substation in Darsi and participated in ‘Suparipalana Lo Tholi Adugu’ campaign. He highlighted that the construction of substations is being undertaken to meet the growing electricity consumption needs and announced that 12 substations have been approved across the combined Prakasam district.\nReiterating the government’s commitment to the welfare of farmers, he said that 75,000 agricultural power connections have already been sanctioned, with ₹2.60 lakh being spent on each connection. He asserted that the Coalition government under the leadership of Chief Minister Nara Chandrababu Naidu is taking corrective steps to rebuild the power infrastructure that was neglected in the YSRCP regime.\nThe Minister also urged citizens to make use of Central government schemes like PM Suryagarh and PM Kusum. He encouraged households to install rooftop solar panels to reduce electricity bills and ease the load on the conventional power grid. He directed the officials to coordinate with bankers to ensure at least 10,000 Suryagarh connections are facilitated in each constituency.\nCriticising the YSRCP government, he said that it not only ignored these beneficial schemes but also increased power tariffs nine times, putting a significant burden on the public. “The Coalition government has not hiked power charges even once since assuming office. The substations are being constructed in rural areas to resolve low voltage issues arising due to high load,” he added.\nHe reaffirmed that the Coalition government is committed to providing 24-hour quality electricity to every household and farming community. He concluded by stating that as long as Chandrababu Naidu is in the office, there is no intention to increase electricity tariffs, and all efforts will be made to restore and strengthen the systems weakened under the previous administration."
  },
  {
    "title": "Kerala extends investment subsidy to resuscitate caravan tourism",
    "link": "https://www.thehindu.com/news/national/kerala/kerala-extends-investment-subsidy-to-resuscitate-caravan-tourism/article69811596.ece",
    "published": "Mon, 14 Jul 2025 20:40:25 +0530",
    "author": "",
    "summary": "State government extends subsidy for caravan tourism project to boost progress, facing slow growth due to lack of private interest.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "With the caravan tourism project failing to take-off as expected, the State government has decided to extend the  subsidy for the project for one more year to give a renewed thrust to the project. The project has been progressing slowly due to  lack of interest from private players.\nAs per a government order, the subsidy scheme announced  in 2021 to promote caravan tourism has only a three-year validity, up to October 2024. The Tourism department has earmarked ₹3.10 crore for promoting caravan tourism for the 2025-26 fiscal. Considering this, the State has changed a clause that restricts the disbursal of investment subsidy and extended it  until December 31, 2025.\nAlthough a couple of caravan parks started functioning in Kerala, since the project was flagged off in 2021, only the one at Malampuzha in Palakkad is operational at present.\nAccording to Sajeev Kurup, general secretary of the Confederation of Kerala Tourism Industries, who owns the Malampuzha facility, the absence of a chain of caravan parks is thwarting the progress of the project. Though his park was opened in February this year, he had received only a few guests due to the absence of a dedicated network of caravan parks.\nHe says the project was conceived after the pandemic outbreak, giving tourists an opportunity to immerse themselves in the natural beauty of unexplored destinations in Kerala.  As per the project proposal, it still has relevance, but a parallel ecosystem suited for promoting caravan tourism needs to be developed, he says.\nIn the past four years, around 20 caravan vehicle owners benefitted from the investment subsidy. However, only six caravans are actively providing services, while the rest have been deployed for services at  marriage functions, cinema locations, pilgrimages etc.\nPrashanth Vasudev, former Deputy Director of Kerala Tourism and chief tourism consultant, North Malabar Tourism Organisation, says Kerala with the  highest penetration of resorts, was hardly a favourite destination for campers or caravan tourists.\n“When there is enough entertainment in resorts, especially indoor and outdoor activities, at all major tourist hotspots, it’s a challenging question how many guests will choose to stay inside a camper van or caravan in a normal picnic spot,” he said."
  },
  {
    "title": "State government’s intensive e-waste collection drive to begin on Tuesday",
    "link": "https://www.thehindu.com/news/national/kerala/state-governments-intensive-e-waste-collection-drive-to-begin-on-tuesday/article69811658.ece",
    "published": "Mon, 14 Jul 2025 20:40:13 +0530",
    "author": "",
    "summary": "In the first phase, the collection drive will be held in the municipal corporations",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "The State government’s special drive to collect electronic waste from households and commercial establishments will begin on Tuesday. Haritha Karma Sena volunteers will be deployed to collect e-waste. In the first phase, the collection drive will be held in the municipal corporations. Minister for Local Self governments M.B. Rajesh will inaugurate the State-level drive at a function to be held in Neyyattinkara at 11 a.m.\nCurrently, local bodies collect e-waste twice a year. However, the government decided on a special drive with the aim of making the collection more effective and to ensure scientific disposal of e-waste. Recyclable e-waste will also get a fixed price determined and published by the Clean Kerala Company. The project is being implemented by the Clean Kerala Company in collaboration with Suchitwa Mission, local self-government institutions, Haritha Karma Sena, Kudumbashree, schools, colleges, residence associations and electronic retailers.\nCRT television, refrigerator, washing machine, microwave oven, mixer grinder, fan, laptop, CPU, CRT monitor, mouse, keyboard, LCD monitor, LCD/LED television, printer, photostat machine, iron box, motor, cellphone, telephone, radio, modem, air conditioner, battery, inverter, UPS, stabilizer, water heater, water cooler, induction cooker, SMPS, hard disk, CD drive, PCB boards, speakers, headphones, switch boards, emergency lamp and similar non-functional or obsolete electronic devices items are considered as e-waste."
  },
  {
    "title": "Frame rules for police to handle non-cognisable offences under BNSS at the earliest: Karnataka High Court",
    "link": "https://www.thehindu.com/news/national/karnataka/frame-rules-for-police-to-handle-non-cognisable-offences-under-bnss-at-the-earliest-karnataka-high-court/article69811173.ece",
    "published": "Mon, 14 Jul 2025 20:38:24 +0530",
    "author": "",
    "summary": "The High Court of Karnataka has said that it expects the State government to take steps at the earliest to frame rules for the police to handle complaints of non-cognisable offences under the Bharatiya Nagarik Suraksha Sanhita (BNSS) to overcome instances like the police conducting investigation of non-cognisable offences sans permission from the jurisdictional magistrate.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/8hmchk/article69811835.ece/alternates/LANDSCAPE_1200/IMG_BG_HIGH_COURT_2020_1_1_QDEK3RT2.jpg",
    "content": "The High Court of Karnataka has said that it expects the State government to take steps at the earliest to frame rules for the police to handle complaints of non-cognisable offences under the Bharatiya Nagarik Suraksha Sanhita (BNSS) to overcome instances like the police conducting investigation of non-cognisable offences sans permission from the jurisdictional magistrate.\nJustice V. Srishananda made this observation while noticing that the government had not framed the rules for this purpose even though the BNSS came into force on July 1, 2024.\nThe court pointed out that the provisions of the BNSS are clear that whenever an information is received by an officer in charge of the police station under whose jurisdiction a non-cognisable offence has been committed, the officer is bound to enter or cause to be entered the substance of the information in a book at the police station ‘as the State government may prescribe in the rules.’\nThe BNSS bars the police from initiating investigation into non-cognisable offences in the absence of a cognisable offence in the complaint without prior permission from the magistrate, the court said, while pointing out that the police will have to maintain a register/book to record complaints of non-cognisable offences and forward the report to the magistrate, who in turn would pass order allowing police to probe non-cognisable offences by registering a case, if necessary.\nThe court made these observations while noticing that Hutti police in Raichur district had not only registered a First Information Report (FIR) on a complaint of a non-cognisable offence but had also filed the charge sheet sans permission from the magistrate as Section 174 of BNSS."
  },
  {
    "title": "87,297 cases settled during National Adalat in Dharwad district",
    "link": "https://www.thehindu.com/news/national/karnataka/87297-cases-settled-during-national-adalat-in-dharwad-district/article69811660.ece",
    "published": "Mon, 14 Jul 2025 20:38:22 +0530",
    "author": "",
    "summary": "Over 87,000 cases resolved in Dharwad district Lok Adalat, including matrimonial, maintenance, and senior citizen cases.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "As many as 87,297 cases were amicably settled during the National Lok Adalat held recently at all the courts in Dharwad district.\nAccording to an official release issued by the Member Secretary of the District Legal Services Authority, P.F. Doddamani, of the 16,485 pending conciliable court cases, 12,850 were resolved. Additionally, of the 76,920 pre-litigation cases, 74,447 were settled, taking the total to 87,297. Principal District and Sessions Judge B.S. Bharathi headed the Lok Adalat.\nIn pre-litigation cases alone, a total of ₹8,30,95,609 was recovered, while in cases pending before courts, a sum of ₹62,18,70,599 was settled.\nDuring the Lok Adalat, 21 matrimonial and maintenance cases were amicably settled and couples reconciled.\n59 cases pertaining to senior citizens were amicably settled. Among them was a case involving a 92-year-old senior citizen, who withdrew his partition suit through compromise at the Principal Senior Civil Judge Court and Chief Judicial Magistrate Court in Dharwad city, the release said."
  },
  {
    "title": "Previous batch also harassed by para medical staff at RMC: Women’s Commission chief",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/previous-batch-also-harassed-by-para-medical-staff-at-rmc-womens-commission-chief/article69811144.ece",
    "published": "Mon, 14 Jul 2025 20:36:53 +0530",
    "author": "",
    "summary": "Andhra Pradesh Women’s Commission Chairperson addresses sexual harassment at Rangaraya Medical College, praises students for bravery.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/8bqy8v/article69811796.ece/alternates/LANDSCAPE_1200/10237_14_7_2025_19_31_56_1_WOMENCOMMISSION.JPG",
    "content": "Andhra Pradesh Women’s Commission Chairperson Rayapati Sailaja on Monday stated that the students of the 2024-25 academic year batch were also reportedly subjected to sexual harassment by the para-medical staff of Rangaraya Medical College in Kakinada City.\nOn Monday, Ms. Sailaja accompanied by the Kakinada city police interacted with the 55 victims after the matter surfaced via an anonymous e-mail sent to the RMC principal on July 8.\nDuring her visit, Ms. Sailaja also held discussions with the RMC college authorities and inquired about the incident, who informed her the four accused staff members have been suspended.\nSpeaking to the media after an In-camera interaction with the students of the B.Sc. (MLT) group on the campus, Ms. Sailaja said: “The students of the previous B.Sc batch had also faced sexual assault by the para-medical staff. The accused had even threatened to release the victims’ private photos if they would proceed with the complaints against them.”\nShe praised the present batch of students for their courage in bringing the incident to light. She said: “What happened on the campus is disheartening. The victims are in a state in which they could not speak out about their situation due to concerns over how it may impact their academics.”"
  },
  {
    "title": "Chera stone inscription found in Manjeri temple",
    "link": "https://www.thehindu.com/news/national/kerala/chera-stone-inscription-found-in-manjeri-temple/article69811493.ece",
    "published": "Mon, 14 Jul 2025 20:36:30 +0530",
    "author": "",
    "summary": "Stone inscription of Chera king Kotha Ravi Perumal found in Kerala temple, revealing insights into ancient Chera rule.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/news/national/kerala/or521j/article69811495.ece/alternates/LANDSCAPE_1200/Inscription.jpg",
    "content": "A stone inscription belonging to Kotha Ravi Perumal, the third Chera king, was unearthed from a temple compound near Manjeri.\nExperts in epigraphy have confirmed that this discovery marks Kotha Ravi Perumal’s 10th known inscription found in Kerala.\nThe Chera dynasty had ruled over the region, now known as Kerala, from the 9thto the 12thcentury with Mahodayapuram (modern-day Kodungalloor) as their capital. The inscription discovered from the Meledath Mahasiva Vettakkorumakan temple at Thrikkalangode, Manjeri, can throw more light on the Chera rule in the Malabar region.\nThe inscription is carved on a stone paved on the circumambulatory path in front of the circular sanctum sanctorum of the temple. “The letters have worn off significantly due to years of foot traffic on the path,” said K. Krishnaraj, epigraphist and officer in charge of the Pazhassi Raja Archaeological Museum, Kozhikode.\nMr. Krishnaraj, who created an estampage of the epigraph, said that the name of the Chera king was legible, but the date was unclear. Given that Kotha Ravi Perumal assumed power in 883, the inscription likely dates back to the last two decades of the 9th century.\nThe circular sanctum sanctorum of the Meledath Mahasiva Vettakkorumakan temple at Thrikkalangode, Manjeri.\nThe inscription in Vattezhuthu, an ancient script used in Kerala, begins with the auspicious phrase Swasti Sree (meaning Hail Prosperity). It refers to a specific arrangement made at the temple during Kotha Ravi Perumal’s reign.\nThe inscription has a postscript that clearly mentions that anyone violating this arrangement would be considered as transgressing the Moozhikkala system, a land management or administrative system that existed during the Chera rule.\nVeteran epigraphist M.R. Raghava Varier, who studied the inscription, said that the worn-off letters made it difficult to create a precise and full transcript. However, from the decipherable lines, he pointed out that the inscription included typical details commonly found in the Chera Perumal inscriptions. “This inscription is the 10th known record of Kotha Ravi Perumal. We have already found nine of his inscriptions from other parts of Kerala,” said Dr. Varier.\nEpistemologist K. Krishnaraj preparing an estampage of the inscription found at the Meledath Mahasiva Vettakkorumakan temple at Thrikkalangode, Manjeri.\nAccording to historian Keshavan Veluthat, the Moozhikkala system was first mentioned in the Chokoor inscription from the 15thyear of Kotha Ravi Perumal’s reign. “If the Thrikkalangode inscription predates it, then this could be the earliest record referring to the Moozhikkala system,” he said.\nHowever, Dr. Veluthat cautioned that without a clear regnal year, it would be near impossible to make a definite judgement.\nE. Dinesan, director of the State Department of Archaeology, said that the department would continue searching for inscriptions and records to shed light on Kerala’s ancient rulers.\nExcavation assistant V.A. Vimal Kumar, temple secretary Dipesh Meledath, patrons Mohanlal and Jayaprakash Babu, president Sajeev Kumar, and tantri Kakkat Subramanian Namboothiri helped Mr. Krishnaraj in unearthing and reading the inscription."
  },
  {
    "title": "Congress’ national OBC panel meet to begin on July 15",
    "link": "https://www.thehindu.com/news/national/karnataka/congress-national-obc-panel-meet-to-begin-today/article69811026.ece",
    "published": "Mon, 14 Jul 2025 20:36:28 +0530",
    "author": "",
    "summary": "The first meeting of the Other Backward Classes (OBC) advisory council of the All India Congress Committee (AICC) will begin in Bengaluru on Tuesday. The two-day meeting will deliberate on strategies for the party to woo back OBC voters across the country and comes months before the crucial elections in Bihar.  ",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "The first meeting of the Other Backward Classes (OBC) advisory council of the All India Congress Committee (AICC) will begin in Bengaluru on Tuesday. The two-day meeting will deliberate on strategies for the party to woo back OBC voters across the country and comes months before the crucial elections in Bihar.\nAmong the agenda for discussion will be the caste census and provisions of Article 164 (1) in Chhattisgarh, Jharkhand, Madhya Pradesh, and Odisha that pertains to the appointment of Minister for Tribal Welfare who will be in charge of welfare of Scheduled Castes and backward classes, according to a note shared by the Karnataka Pradesh Congress Committee (KPCC).\nThe 24-member council comprises, among others, Karnataka Chief Minister Siddaramaiah, former Chief Ministers Ashok Gehlot (Rajasthan), Bhupesh Baghel (Chattisgarh), V. Narayanasamy (Puducherry), and M. Veerappa Moily, besides Members of Parliament and former Ministers.\nBesides the members of the council, Deputy Chief Minister D.K. Shivakumar and a host of other party leaders are scheduled to take part in the meetings, which will commence at the KPCC office on Tuesday evening and at a hotel on Wednesday."
  },
  {
    "title": "Farmers expect rain for good yield of monsoon crops in Yadgir",
    "link": "https://www.thehindu.com/news/national/karnataka/farmers-expect-rain-for-good-yield-of-monsoon-crops-in-yadgir/article69807325.ece",
    "published": "Mon, 14 Jul 2025 20:33:23 +0530",
    "author": "",
    "summary": "Farmers in Yadgir district eagerly await rain for green gram and cotton crops to flourish and yield well.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/qgshm8/article69811808.ece/alternates/LANDSCAPE_1200/YDRKN_13_7_2025_19_10_38_1_IMG20250713154253.JPG",
    "content": "Farmers in Yadgir district are waiting for a good spell of rain for their crops, particularly green gram and cotton, to get good yields.\nThe pre-monsoon showers prompted farmers to start sowing. As a result, green gram and cotton are presently two to four weeks old, as some farmers sow early considering the moisture in the soil.\nAccording to information provided by the Agriculture Department, farmers completed sowing in 2,63,931 hectares of area, which is 63% against the 416,474 hectares that were the target set by the department for this khariff season.\nFarmers carried out the weeding process after a week from sowing, enabling crops to grow elegantly.\n“The crop, so far, has grown as expected. But it required immediate rains to get a good yield. If the similar dry spell continues, there is a possibility of crops withering or a lack of getting yield,” Balu Rathod, a farmer said.\nIn a few parts, where it didn’t sufficiently rain even after the arrival of the monsoon as usual, farmers started sowing late. Such crops won’t face difficulties, as the present moisture in the soil helps them.\n“It is necessary to have rain for the growing crops. But, it is expected that the cloudy atmosphere will also help crops from withering,” Ratendranath Sugur, another farmer, toldThe Hindu.\nAlthough the district received a deficit of rain, it has been experiencing scattered rains in some parts even today.\nThe hobli-wise rain that was recorded in 24 hours is as follows, the figures in brackets indicate normal rains: Shahapur received 3.9 mm against the normal 1.5 mm, Doranahalli - 3.3 mm (1.8mm), Gogi- 3.3 mm ( 1.6mm), Hayyal (B)- 0.3 mm (2.4 mm), Shorapur - 7.2 mm ( 2.6 mm), Kakkera- 5.5 mm ( 2.4mm), Kembhavi-9.4 mm ( 0.9 mm), Yadgir- 0.9 mm ( 3.9mm), Balichakra - 1.6 mm (2.7 mm), Hattikuni- 01 mm ( 2.9mm), Saidapur -0.1mm ( 2.4 mm), Gurmitkal- 2.3 mm (4.2mm), Konkal 0.2mm ( 3.4 mm), Wadagera- 1.2mm( 2.0mm), Hunsagi- 6.3 mm ( 2.00 mm) and Kodekal - nil ( 3.0 mm) respectively."
  },
  {
    "title": "Sena’s Priyanka Chaturvedi demands inquiry into ‘leak’ of AAIB’s report on Air India Ahmedabad plane crash",
    "link": "https://www.thehindu.com/news/national/senas-priyanka-chaturvedi-demands-inquiry-into-leak-of-aaibs-report-on-air-india-ahmedabad-plane-crash/article69811630.ece",
    "published": "Mon, 14 Jul 2025 20:30:06 +0530",
    "author": "",
    "summary": "Shiv Sena leader Priyanka Chaturvedi seeks inquiry into leaked Air India crash report, raising concerns about aviation safety.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/biivqf/article69811795.ece/alternates/LANDSCAPE_1200/PTI02_01_2024_000279A.jpg",
    "content": "Shiv Sena (Uddhav Balasaheb Thackeray) leader and Rajya Sabha member Priyanka Chaturvedi on Monday (July 15, 2025) wrote to Civil Aviation Minister Kinjarapu Rammohan Naidu, seeking a formal inquiry into how details of apreliminary reporton thecrash of Air India flight AI171were allegedly leaked to the international media before it was officially released in India.\nFor the sake of transparency with regard to the authorship of the preliminary report, Ms. Chaturvedi said the names of all members of the investigation panel should be made public, and the report should bear the signatures of each panel member.\n“I write to you to express serious concerns regarding the manner in which the recent interim investigation report by the Aircraft Accident Investigation Bureau [AAIB] was handled and disseminated, particularly in light of media reports surfacing in international publications before the report was officially made public in India,” Ms. Chaturvedi said, adding that it has serious implications for “public safety, pilot morale, and India’s global aviation standing”.\nThe Aircraft Accident Investigation Bureau (AAIB) on Saturdayreleased its preliminary reporton the crash of Air India’s Boeing 787-8 plane that killed 260 people, including 241 people onboard. The aircraft, which was operating the flight AI171 from Ahmedabad to London Gatwick, crashed into a building soon after takeoff.\nThe Shiva Sena (UBT) MP said that one cannot be a mute spectator with regard to the narrative being built around the AI 171 crash and the interim report. “It is deeply troubling that sensitive details of the AAIB report were available to foreign news agencies and published in outlets such as The Wall Street Journal before any official release in India. This raises urgent questions about how the contents of the report were accessed by foreign entities prior to their dissemination to the Indian public and concerned stakeholders,”she added.\nMs. Chaturvedi claimed that the non-stop insinuations being made against the deceased pilots through implication and selective leaks of the interim report through the international media were “absolutely reprehensible”.\n“Such motivated speculation via broadcast, print and digital platforms shows a more sinister attempt to malign our pilots who aren’t alive to put their case, even pilot associations have raised their objections,” she said."
  },
  {
    "title": "Eight arrested for murder in land dispute case in Karur",
    "link": "https://www.thehindu.com/news/cities/Tiruchirapalli/eight-arrested-for-murder-in-land-dispute-case-in-karur/article69811724.ece",
    "published": "Mon, 14 Jul 2025 20:28:24 +0530",
    "author": "",
    "summary": "Eight persons were arrested on Monday in connection with the murder of a 47-year-old man over a land dispute in Vangal police station limits in the district on Sunday night",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Eight persons were arrested on Monday in connection with the murder of a 47-year-old man over a land dispute in Vangal police station limits in the district on Sunday night.\nThe name of the deceased was given as Manivasagam. Police sources said Manivasagam had finalised to buy land from Rani. Sources said Venkatesan of Vangal and a couple of others wanted to buy the land at a higher price from Ms. Rani and caused problems for her.\nManivasagam accompanied by his brother Yogeswaran and Anand went to Ms. Rani’s land on Sunday night where Venkatesan and his accomplices allegedly attacked Manivasagam, his brother, Ms. Rani, and two others with swords and other weapons.\nManivasagam died at the Karur Government Medical College Hospital.  Acting on a complaint from Manivasagam’s wife Nandini, a murder case was registered by the Vangal police which arrested eight persons, including Venkatesan."
  },
  {
    "title": "Fire engulfs empty rail coach in Tirupati, no casualties",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/fire-engulfs-empty-rail-coach-in-tirupati-no-casaulties/article69811314.ece",
    "published": "Mon, 14 Jul 2025 20:27:44 +0530",
    "author": "",
    "summary": "A fire engulfed an empty general coach of Hisar-Tirupati Special Train (04717) in Tirupati stabling yard on Monday. ",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/k640mb/article69811777.ece/alternates/LANDSCAPE_1200/10745_14_7_2025_17_41_13_5_IMG_20250714_WA0221.JPG",
    "content": "A fire engulfed an empty general coach of Hisar-Tirupati Special Train (04717) in Tirupati stabling yard on Monday. The sudden fire left many passengers at Railway Station worried. The authorities immediately alerted fire department, who arrived at the scene and dozed the fire within few minutes.\nSpeaking toThe Hindu, Railway Inspector M. Sandeep Kumar said, “Hisar-Tirupati Special Train arrived on Platform no. 1 around 12.05 p.m. and was moved to the stabling yard by 12.50 p.m. for cleaning purpose. During the shunting process, a man noticed the fire in the general coach at 1.40 p.m., the staff arrived at the spot and isolated the coach from the rest of the coaches.”\n“The cause of the fire is still unknown. The preliminary investigation is underway. A committee will be formed to determine the cause and assess the loss. Fortunately, there was no person or property in the coach at the time of the fire mishap,” he said, urging the public not to believe false rumours spreading on the social media.\nIn a statement, the South Central Railway (SCR) said, “Necessary firefighting measures were carried out by the Fire Brigade Team. Further investigation into the cause of the incident is underway. There is no disruption to any of the outgoing /incoming train services from Tirupati Railway Station.”"
  },
  {
    "title": "Collapsed Kaleshwaram cannot be compared with Congress-era Nagarjunasagar, Srisailam: CM Revanth",
    "link": "https://www.thehindu.com/news/national/telangana/collapsed-kaleshwaram-cannot-be-compared-with-congress-era-nagarjunasagar-srisailam-cm-revanth/article69811703.ece",
    "published": "Mon, 14 Jul 2025 20:27:10 +0530",
    "author": "",
    "summary": "Chief Minister Revanth Reddy praises Congress irrigation projects, criticizes Kaleshwaram, and expresses confidence in upcoming local body elections.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "Chief Minister A. Revanth Reddy said there was no comparison between the irrigation projects built by the BRS, which ‘collapsed’ within three years, and the irrigation projects built by the Congress which continue to serve Telangana for the last 60 years.\nCalling the Kaleshwaram project a ‘white elephant’, he asked: “How can Kaleshwaram, built at a  cost of ₹1 lakh crore and collapsed within three years, be compared to Congress-era projects like Nagarjunasagar, Srisailam, SRSP and Jurala which still stand strong?” He was addressing a public meeting at Tungaturthy on Monday.\nReiterating that the Congress flag will fly high for the next 10 years in Telangana, he said people should not have any doubts about it, and he appealed to the Congress workers to ensure a landslide victory in the upcoming local body elections. Fine rice scheme and ration cards are game changers and the women folk are with the party, he said, exuding confidence that the party would sweep the forthcoming local body elections.\nHe also highlighted Telangana’s historic achievements under Congress rule, such as conducting the first caste census in 100 years, pushing for 42% BC reservations in local bodies, SC reservations classification and striving to make Telangana a $1 trillion economy.\nThe Chief Minister also pointed out the contrast between the BRS era, marked by liquor belt shops in villages, and the Congress government, under which people now queue up to receive ration cards. “Ration cards are a matter of self-respect for the poor,” he asserted."
  },
  {
    "title": "Former Civil Aviation Minister Ashok Gajapathi Raju appointed Goa Governor",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/former-civil-aviation-minister-ashok-gajapathi-raju-appointed-goa-governor/article69810387.ece",
    "published": "Mon, 14 Jul 2025 20:25:02 +0530",
    "author": "",
    "summary": "Former Union Minister Pusapati Ashok Gajapathi Raju appointed Governor of Goa due to clean image and political connections.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/yf4yie/article69811717.ece/alternates/LANDSCAPE_1200/WhatsApp%20Image%202025-07-14%20at%2018.50.09.jpeg",
    "content": "Former Union Minister of Civil Aviation and TDP leader Pusapati Ashok Gajapathi Raju has been appointed as the Governor of Goa. President of India Droupadi Murmu issued the orders with regard to his appointment on Monday.\nPolitical experts say the clean image of Mr. Gajapathi Raju in politics for the last five decades, his cordial relations with Prime Minister Narendra Modi and other top leaders of the BJP have earned him the post.\nMr. Ashok has been a close confidant of Andhra Pradesh Chief Minister N. Chandrababu Naidu, who recommended his name for the Governor post. TDP is the alliance partner of the BJP at the Centre.\nWith Mr. Ashok being reluctant to contest in the 2024 general elections, the TDP leadership gave the Assembly ticket to his daughter Aditi Vijayalakshmi Gajapathi Raju, who won the Vizianagaram constituency by defeating then Deputy Speaker Kolagatla Veerabhadra Swamy.\nBorn on June 26, 1951, Mr. Ashok is the youngest son of the last Maharaja of Vizianagaram, P.V.G. Raju. He has served as a legislator between 1977 and 2004.\nHe faced defeat in the 2004 Assembly elections. Having started his political career in the Janata Party, Mr. Ashok joined the TDP on a call given by TDP founder N.T. Rama Rao.\nHe has held several portfolios as Minister such as Commercial Tax, Excise, Legislative Affairs, Finance, Planning and Revenue. After winning as an MP from Vizianagaram in 2014, he became the Union Minister for Civil Aviation in the Narendra Modi government.\nHowever, he resigned from the post when the TDP walked out of the NDA prior to the 2019 general elections, over the Special Category Status for the State and other issues.\nHowever, the TDP joined the NDA again before the 2024 general elections.\nMr. Ashok and Ms. Aditi Vijayalakshmi distributed books to students of various schools at Dharmapuri village of Vizianagaram mandal on Monday.\nRajam MLA Kondru Muralimohan, S.Kota legislator Kolla Lalithakumari and others congratulated him.\nTDP general secretary I.V.B.P. Raju, Vizianagaram city president Prasadula Lakshmi Prasad, party senior leaders K. Murali Mohan, Karrothu Narasinga Rao and others congratulated Mr. Ashok."
  },
  {
    "title": "IIHR and Kilvelur Agri college join hands to develop Mango variety suited to conditions in Nagapattinam",
    "link": "https://www.thehindu.com/news/cities/Tiruchirapalli/iihr-and-kilvelur-agri-college-join-hands-to-develop-mango-variety-suited-to-conditions-in-nagapattinam/article69811556.ece",
    "published": "Mon, 14 Jul 2025 20:24:46 +0530",
    "author": "",
    "summary": "In a step towards climate-resilient horticulture, the ICAR–Indian Institute of Horticultural Research (IIHR), Bengaluru, and TNAU’s Agricultural College and Research Institute at Kilvelur have launched a joint initiative to identify saline-tolerant mango varieties suited for Nagapattinam region",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/56l6h/article69811483.ece/alternates/LANDSCAPE_1200/1000603168%202.jpg",
    "content": "In a step towards climate-resilient horticulture, the ICAR–Indian Institute of Horticultural Research (IIHR), Bengaluru, and TNAU’s Agricultural College and Research Institute at Kilvelur have launched a joint initiative to identify saline-tolerant mango varieties suited for Nagapattinam region.\nWith sea-level rising and saline water intrusion threatening agriculture in the Cauvery delta, this research aims at securing mango production in districts such as Nagapattinam, known for its unique microclimate that supports off-season flowering and fruiting — particularly in the Vedaranyam block.\n“We are screening over 15 mango varieties for their tolerance to coastal salinity and sodicity,” said Dr. M. Sankaran, Principal Scientist and Head, Division of Fruit Crops, ICAR–IIHR, Bengaluru. The trial is being conducted across three locations, including the Agricultural College campus, where saline groundwater conditions prevail. “This is a long-term study aimed at identifying varieties that can withstand and thrive under saline stress. The most resilient will be promoted among farmers as rootstocks,” he said. Once suitable rootstocks are identified, they will be grafted with high-yielding commercial scions to sustain productivity in coastal conditions.\nMango is grown on 2,385 hectares in the district with a production of 16,600 tonnes annually. Vedaranyam alone accounts for 1,500 hectares, most of which naturally bear fruit during October–November — a window that commands better market prices.\nMr. Sankaran said the institute had developed over 14 mango technologies, including ‘Mango Special’ for boosting yield and health. High-density planting is a key focus — raising tree count from 100 to over 1,000 per hectare with proper management. These technologies will be shared with farmers in the region.\n“With improved agronomic practices and the adoption of advanced technologies, farmers can significantly enhance productivity. However, labour constraints and limited awareness continue to hinder progress.” said G. Ravi, Nodal Officer at the Kilvelur Agricultural College.\nHe said the institute places special emphasis on mango cultivation, with a flagship programme focused on livelihood security and income enhancement for farmers in Nagapattinam. As part of this effort, both institutions are offering hands-on training to progressive farmers, covering integrated pest management, nutrient and flowering induction techniques, and the use of mechanised mango harvesters.\nMr. Ravi said the broader vision was to transform Nagapattinam into a science-driven hub for mango production while strengthening climate resilience and rural incomes."
  },
  {
    "title": "₹7.05 crore sanctioned for Responsible Tourism projects",
    "link": "https://www.thehindu.com/news/national/kerala/705-crore-sanctioned-for-responsible-tourism-projects/article69811639.ece",
    "published": "Mon, 14 Jul 2025 20:23:55 +0530",
    "author": "",
    "summary": "This is part of ramping up local tourism activities with an added thrust on women empowerment",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "In a major boost to Kerala’s globally-acclaimed Responsible Tourism (RT) initiative, the State government has allocated ₹7.05 crore for implementing various projects, ramping up local tourism activities with an added thrust on women empowerment.\nThese projects include RT Fest 2025-26 (₹2.85 crore), Responsible/ Resilient Tourism Destinations 2025-26 (₹1.57 crore), Participatory Tourism project (₹93.77 lakh), Munnar Net Zero Destination project (₹50 lakh), job-training for survivors of the Wayanad Mundakkai-Chooralmala natural disaster (₹13. 58 lakh), Experience Ethnic, Local Cuisine Network/ Kerala Agri-tourism network (₹5 lakh), Kerala Homestay and Rural Tourism Meet (₹1 crore).\n“This is one of the largest allocations for Responsible Tourism, which will impart a great thrust to sustainable and women-friendly tourism initiatives in the State. This will enable Kerala to make a further surge in attracting visitors as an experiential tourism hub,” Tourism Minister P.A. Mohamed Riyas said. The projects were submitted by the Kerala Responsible Tourism Mission Society (KRTMS).\nA total of 30 inhabitants of Mundakkai-Chooralmala, who lost their livelihood and homes, during last year’s natural disaster will be trained by expert agencies in making handicrafts and souvenirs. The trained persons will be given financial aid to set up units for branding and marketing their products.\nThe implementation of these projects will cover diverse components such as experiential trekking packages connecting Agri Tourism and ethnic cuisine network, souvenir network project, developing a women-friendly tourism policy, formulating guidelines for women-friendly accommodation units, financial assistance to women enterprises, Fresh Up Homes project and conduct of gender audit in destinations.\nAs part of the RT project at Munnar, stakeholders’ meetings will be held, besides organising training programmes for auto-taxi drivers, local guides, putting up signages and boards, issuance of certification for hotels and resorts, maintaining the destination as plastic free, formulation of village-life experience packages, destination declaration and video documentation are the major initiatives for which the funds will be utilised."
  },
  {
    "title": "Differently abled student gets tricycle to continue studies",
    "link": "https://www.thehindu.com/news/national/karnataka/differently-abled-student-gets-tricycle-to-continue-studies/article69811477.ece",
    "published": "Mon, 14 Jul 2025 20:18:06 +0530",
    "author": "",
    "summary": "Differently abled student Vinay receives battery-operated tricycle for higher education, overcoming physical challenges with community support.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/hn59d4/article69811994.ece/alternates/LANDSCAPE_1200/2303_14_7_2025_20_16_34_1_TRICYCLE.JPG",
    "content": "C. Vinay, a differently abled student from Shankarpura in Nanjangud, has received a battery-operated tricycle from donors, enabling him to continue his higher education without hurdles.\nVinay, who is paralysed in his lower body and cannot use one hand, had completed his PU education at the Government Boys PU College in Nanjangud with good marks. However, pursuing a degree seemed impossible, as the college is far, and he relied on his mother to take him to classes daily on a manual tricycle.\nRecently, when Vinay visited the college to collect his marks card, principal C.R. Dinesh came to know about his difficulties. The principal contacted a battery-operated tricycle company in Bengaluru and sought support from Lions Club ambassadors and other well-wishers. The donors then raised ₹45,000 to purchase the vehicle.\nAt a ceremony held in the college, the tricycle was handed over to Vinay in the presence of teachers and students."
  },
  {
    "title": "351 special camps to be held under ‘Ungaludan Stalin’ scheme in Tiruchi district from July 15",
    "link": "https://www.thehindu.com/news/cities/Tiruchirapalli/351-special-camps-to-be-held-under-ungaludan-stalin-scheme-in-tiruchi-district-from-july-15/article69811525.ece",
    "published": "Mon, 14 Jul 2025 20:18:04 +0530",
    "author": "",
    "summary": "A total of 351 special camps will be organised across Tiruchi district from July 15 to November 14 as part of the ‘Ungaludan Stalin’ initiative announced by Chief Minister M.K. Stalin, said Collector V. Saravanan on Monday",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "A total of 351 special camps will be organised across Tiruchi district from July 15 to November 14 as part of the ‘Ungaludan Stalin’ initiative announced by Chief Minister M.K. Stalin, said Collector V. Saravanan on Monday.\nMr. Saravanan told presspersons that the scheme would be launched to address people’s grievances by delivering public services at their doorstep, particularly in remote areas. Over 9.30 lakh households would benefit from the scheme.\nThe camps will cover both urban and rural areas, with 32 camps in Corporation limits, 48 in Musiri, Lalgudi, Thuraiyur, Thuvakudi, and Manapparai municipalities, 28 camps in 14 town panchayats, and 243 camps in 14 panchayat unions.\nIn the first phase, 120 camps will be conducted in Tiruchi from July 15 to August 14. Eight camps in Corporation limits, 19 in municipalities, 14 in town panchayats, and 79 in panchayat unions. These camps will be held from Tuesday to Friday. As many as 3,97,236 households would benefit from the camps.\nVolunteers, supervisors, data entry operators, and nodal officers have been appointed to assist the public. To create awareness and facilitate participation, 1,013 volunteers have been engaged in a door-to-door campaign since July 7, distributing application forms and pamphlets.\nThe Collector said that about 43 services from 13 departments will be made available in urban areas while in rural areas 46 services from 15 departments will be offered. Four counters have been set up to receive applications for the phase II of the Kalaignar Magalir Urimai Thogai Scheme.\nEach camp will have a medical team and a “May I Help You” booth. Wheelchairs are made available for elders and persons with disabilities. Applications received at the camps will be processed within 45 days. He urged the public to participate and avail themselves of the services offered."
  },
  {
    "title": "Revanth, Naidu to meet in Delhi tomorrow to sort out Krishna, Godavari Basin projects",
    "link": "https://www.thehindu.com/news/national/telangana/revanth-naidu-to-meet-in-delhi-tomorrow-to-sort-out-krishna-godavari-basin-projects/article69811496.ece",
    "published": "Mon, 14 Jul 2025 20:15:54 +0530",
    "author": "",
    "summary": "Chief Ministers Revanth Reddy and Chandrababu Naidu to discuss water issues in New Delhi facilitated by Union Minister Patil.",
    "tags": [],
    "image": "https://www.thehindu.com/theme/images/og-image.png",
    "content": "HYDERABAD\nChief Minister A. Revanth Reddy and Andhra Pradesh Chief Minister N. Chandrababu Naidu will discuss water-related issues in New Delhi on July 16 at a meeting to be facilitated by Union Minister for Jal Shakti C.R. Patil.\nThe Telangana government has decided to mount pressure on the Centre for achieving the rightful share of Krishna and Godavari river waters. Chief Minister A. Revanth Reddy has asked the Centre to give clearance to the Krishna Basin projects in the State, allocate water to them and provide funding for their construction. He told Minister for Irrigation N. Uttam Kumar Reddy to address a letter to Union Minister of Jal Shakti C.R. Patil in this regard.\nThe Chief Minister alleged that the K. Chandrasekhar Rao government in the past had failed to achieve the rightful share of river water, particularly in the Krishna Basin, for 10 years. By agreeing to 299 tmc ft share against 512 tmc ft to Andhra Pradesh, the previous government had allowed the neighbour to divert Krishna water indiscriminately.\nSimilarly, in the Godavari Basin too, the BRS government had abandoned the Pranahita-Chevella project with a barrage at Tummidihatti after the Congress government had spent ₹11,000 crore on it till 2014, and instead the KCR government had wasted ₹1 lakh crore on Kaleshwaram project.\nMeanwhile, Mr Uttam Reddy in his letter requested the Centre to take initiative on resolving the issues in Krishna and Godavari Basins and also clear pending clearances and allocate water to those projects. On Palamuru-Rangareddy and Dindi Lift Irrigation Schemes, he said they were yet to be given clearances and allocation of water, including 45 tmc ft State’s additional share in Krishna waters in lieu of A.P.’s diversion of Godavari water to Krishna Delta.\nHe reminded Mr. Patil that the Prime Minister’s Office had proposed on December 10, 2010 the national project status to Dindi LIS taken up in 2007 to address the fluoride problem. The inter-State clearance for Sammakka Sarakka Project (Thupakulagudem Barrage) was also pending despite Telangana’s readiness to pay compensation to submergence lands as Chhattisgarh was not giving a no-objection letter.\nFurther, he brought to the Union Minister’s notice that A.P. was diverting huge quantity (8-10 tmc ft a day) of Krishna water to the non-basin areas from Pothireddypadu Head Regulator, Rayalaseema LIS, Muchumarri, Malyala and Guru Raghavendra projects. He sought clearance for all projects taken up till 2014 under KWDT-I Award. Mr. Uttam Reddy also explained various other contentious issues in his letter."
  },
  {
    "title": "Man ‘ties’ mother to electric pole to gain sympathy over property dispute",
    "link": "https://www.thehindu.com/news/national/andhra-pradesh/man-ties-mother-to-electric-pole-to-gain-sympathy-over-property-dispute/article69811054.ece",
    "published": "Mon, 14 Jul 2025 20:15:09 +0530",
    "author": "",
    "summary": "In a disturbing incident, a man allegedly tied his mother to an electric pole and recorded a video to gain sympathy over a property dispute in the family.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/zfp2rt/article69811649.ece/alternates/LANDSCAPE_1200/WhatsApp%20Image%202025-07-14%20at%2018.33.33.jpeg",
    "content": "In a disturbing incident, a man allegedly tied his mother to an electric pole and recorded a video to gain sympathy over a property dispute in the family. The incident has been reported from Tammiganipalli village of Karalaghatta panchayat under Santhipuram mandal of Kuppam Assembly Constituency.\nThe video which went viral on social media shows an elderly woman, identified as Gangamma, tied to a power pole with a plastic rope. After a thorough probe, senior police officials of Kuppam sub-division said that Muneppa, the family head, passed away on July 5. He had two wives – Munemma and Gangamma – and disputes cropped up over property among their children.\nIn an attempt to gain sympathy and an upper hand, Suresh tied his mother Gangamma to the pole, recorded the act, and blamed his step-brother Manjunath (son of Munemma) for the “heinous act”, by posting the video on social media platforms on Sunday.\n“Though the act appears to be a case of abuse, our inquiry found that it was a staged act to gain sympathy by one side of a family and throw the blame on the other side,” a police official said. The police arrested Suresh on Monday and registered a case.\nIt may be noted here that a similar incident was reported in Kuppam a couple of weeks ago, when a money-lender tied a woman to a tree and beat her after she failed to repay a debt with exorbitant interest. The report caught the attention of the entire State, which led to the intervention of Chief Minister N. Chandrababu Naidu, who represents Kuppam constituency. She was granted with ₹5 lakh financial assistance and other government benefits. The police had registered a criminal case against the money-lender and made the arrest."
  },
  {
    "title": "Gadkari names new bridge after Sigandur Chowdeshwari, assures completion of highway works worth ₹5 lakh crore in Karnataka in next five years",
    "link": "https://www.thehindu.com/news/national/karnataka/gadkari-names-new-bridge-after-sigandur-chowdeshwari-assures-completion-of-highway-works-worth-5-lakh-crore-in-karnataka-in-next-five-years/article69811417.ece",
    "published": "Mon, 14 Jul 2025 20:13:50 +0530",
    "author": "",
    "summary": "Union Minister Nitin Gadkari inaugurates Sigandur Chowdeshwari Bridge, announces major highway projects in Karnataka, and dedicates various infrastructure developments.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/48siy3/article69811710.ece/alternates/LANDSCAPE_1200/9911_14_7_2025_19_40_41_1_BRIDGE_INAUGURATION.JPG",
    "content": "Union Minister for Road Transport and Highways Nitin Gadkari speaking at a programme to mark the inauguration of the Sigandur bridge and other works at Sagar in Shivamogga on Monday. He was accompanied by Union Minister of Consumer Affairs Pralhad Joshi, former Chief Minister B.S. Yediyurappa, former Minister Kagodu Thimmappa, and others.\n                                                            | Photo Credit: \n                                SPECIAL ARRANGEMENT\nStating that he was fortunate to get the opportunity to inaugurate the bridge across Sharavati backwaters, for which he laid the foundation stone six years ago, Union Minister for Road Transport and Highways Nitin Gadkari announced that the structure would be named after Sigandur Chowdeshwari.\nAddressing the gathering in a programme organised to mark the dedication of the bridge to the nation in Sagar on Monday, Mr. Gadkari, tracing the history of the project, said that when the proposal came before him, the estimated cost of the bridge was very high and the structure was necessary considering the difficulties faced by the people.\n“A decision was taken to upgrade the road into a national highway, and still there were many hiccups in taking up the project. However, with the blessings of Matha Chowdeshwari the project has been completed. Now, I announce that from now on, the bridge will be called Sigandur Chowdeshwari Bridge,” he said.\nReferring to the achievements of his department, Mr. Gadkari said when Narendra Modi-led government came to power in 2014, the total length of the national highway in Karnataka was 6,770 km. By 2025, the length had gone up to 9,424 km. “At present, projects worth ₹3 lakh crores are in progress at different stages, and it has been decided that projects worth ₹5 lakh crores and schemes will be taken up in the State in the next five years,” he said.\nHis Ministry, Mr. Gadkari said, had taken up the connecting Kashmir and Kanyakumari by a new road. “It will reduce between Delhi and southern States. As much as 73% of the highway work has been completed. And, this will be completed by March 2026,” he said.\nUnion Minister for Consumer Affairs Pralhad Joshi recalled his visit to the Sagar taluk years ago, when he too faced difficulties. “I thank people who fought for the bridge and Mr. Gadkari realised the dream of the local residents”, he said. Mr. Joshi also appreciated the efforts of MP for Shivamogga B.Y. Raghavendra in getting development works sanctioned for his constituency.\nMr. Raghavendra thanked Mr. Gadkari for sanctioning the bridge, which had been a dream project of the local residents. The programme to dedicate the bridge to the nation was organised in a hurry, as there was a chance of the people facing trouble with the heavy rains. “In the absence of the bridge, the residents were dependent on the ferries. However, operating them would be impossible if the water level increased in the dam. Hence, the bridge was inaugurated so that the people enjoy its benefits in the present rainy season itself,” he said.\nHe urged the Union Minister to sanction the Agumbe Ghat tunnel project and upgrade the road connecting Hosapete and Balehonnur via Shivamogga as a national highway.\nFormer Chief Minister B.S. Yediyurappa, former Minister Kagodu Thimmappa, Lok Sabha members Kota Srinivasa Poojari, Captain Brijesh, BJP State unit president B.Y. Vijayendra, legislators Araga Jnanendra, Gururaj Ghantiholi, S.N. Channabasappa, Cement manju, and others were present.\nThe Union Minister dedicated to the nation the widening and improvement of Bidar–Humnabad stretch of the NH-50 completed at a cost of ₹345 crore; four-lane railway overbridge, two-lane bridge in Kalaburagi–Yadgiri stretch of NH-150 built at a cost of ₹65 crore; seven minor bridges from Mani to Sampaji on NH-275 at a cost of ₹52 crore; the restoration of Shiradi Ghat of NH-75 at a cost of ₹41 crore; and two-lane stretch from Bhanapur–Gaddanakeri stretch on NH-367 at a cost of ₹173 crore.\nHe laid the foundation stones for the construction of the four-lane ROB at Wadi on NH-150 at a cost of ₹88 crore, the construction of a retaining wall from Sampaje to Kushanalanagara on NH-275 at a cost of ₹94 crore, and additional works to ensure road safety for the six-lane Bengaluru-Mysuru access-controlled section of NH-275 at ₹712 crore."
  },
  {
    "title": "Dramatic scenes in Thiruvananthapuram Corporation council meeting amid tit-for-tat allegations",
    "link": "https://www.thehindu.com/news/national/kerala/dramatic-scenes-in-thiruvananthapuram-corporation-council-meeting-amid-tit-for-tat-allegations/article69811422.ece",
    "published": "Mon, 14 Jul 2025 20:09:31 +0530",
    "author": "",
    "summary": "Tense standoff between councillors continued for about half an hour before the council meeting",
    "tags": [],
    "image": "https://th-i.thgim.com/public/news/national/kerala/4odxbd/article69811415.ece/alternates/LANDSCAPE_1200/IMG-20250714-WA0020.jpg",
    "content": "Dramatic scenes played out in a council meeting of the Thiruvananthapuram Corporation on Monday as the ruling Left Democratic Front (LDF) and the Bharatiya Janata Party (BJP) led opposition levelled corruption allegations against each other, leading to scuffles and prolonged protests. While theLDF reiterated its allegations against BJP councillorsP.V. Manju and G.S. Asha Nath, the BJP accused favouritism in the inclusion of an LDF councillor’s name in the list for appointment of sanitation workers.\nWomen councillors of the BJP occupied the Mayor’s dais much before the beginning of the council meeting in the afternoon. The BJP councillors held placards demanding the resignation of the Mayor. Meanwhile, the LDF councillors also began sloganeering, holding placards demanding the resignation of the two councillors accused of corruption. The tense standoff continued for about half an hour, after which police personnel removed the women councillors of the BJP from the Mayor’s dais, despite stiff resistance from the BJP.\nAfter the dais was cleared, Mayor Arya Rajendran took her seat and attempted to start the council meeting, but the remaining BJP councillors held a banner blocking the Mayor’s view. Two Communist Party of India (Marxist) [CPI(M)] councillors tore away the banner leading to a scuffle between both sides. The agendas related to the various standing committees were read out and the meeting concluded amid the sloganeering.\nThe BJP had alleged that the ruling LDF had slyly incorporated the name of Kazhakuttam councillor L.S. Kavitha and a few of the party’s favourites in the appointment list for the sanitation workers. It further alleged that the appointment process was delayed for an year to ensure that the councillor’s resignation to take up her job will not trigger a byelection.\nHealth Standing Committee chairperson Gayathri Babu said that the Employment Exchange had provided the list of 671 prospective candidates to fill the 56 vacancies for sanitation workers. The councillor’s name was also part of the list as she had registered with the Employment Exchange years ago. A total of 403 people from the list participated in the interview. Out of them, 363 people participated in the physical tests. The Corporation has now approved a finalised list of 348 candidates, from which appointments will be made later. The list was prepared by following all reservation norms.\nLater, addressing a press conference, LDF parliamentary party leader D.R. Anil said that the BJP has levelled baseless allegations and unleashed violence in the council meeting to divert attention from the corruption allegations against two of its councillors. In the 2015-2020 period too, one of the councillors had secured a job as a contingent worker through a transparent process after registering through the Employment Exchange, he said.\nThe United Democratic Front (UDF) alleged in a press release that the differences over dividing the posts of sanitation workers between the LDF and the BJP led to the scuffles witnessed in the council.\nBJP councillor P.V. Manju of the Punnakkamugal ward is accused of aiding a coverup in the alleged misappropriation of around ₹3 lakh collected by the local Haritha Karma Sena (HKS) unit as user fee from households in the ward. The other allegation was against Pappanamcode councillor G.S. Asha Nath, whom the LDF accused of collecting money from beneficiaries for providing the Corporation’s application forms for various schemes."
  },
  {
    "title": "Left parties slam J&K L-G for ‘assault’ on CM Omar Abdullah in Srinagar",
    "link": "https://www.thehindu.com/news/national/jammu-and-kashmir/left-parties-slam-jk-l-g-for-assault-on-cm-omar-abdullah-in-srinagar/article69811318.ece",
    "published": "Mon, 14 Jul 2025 20:05:48 +0530",
    "author": "",
    "summary": "Left parties condemn police manhandling of J&K CM, accuse Lt. Governor of undermining elected government, demand restoration of democratic rights.",
    "tags": [],
    "image": "https://th-i.thgim.com/public/incoming/ypjc36/article69811670.ece/alternates/LANDSCAPE_1200/PTI07_14_2025_RPT113A.jpg",
    "content": "Strongly condemning the police manhandling of Jammu and Kashmir (J&K) Chief MinisterOmar Abdullah in Srinagar, the Left parties accused Lt. Governor Manoj Sinha of undermining the smooth functioning of the duly elected State government.\nThe CPI(M) Polit Bureau, in a statement in New Delhi, said that the Central government headed by the BJP is trying to enforce its own diktats and regressive points of view. The abolition of holiday on Martyrs’ Day is an example of this, it said. “On the other hand, the birthday of the Maharaja, responsible for killing freedom fighters, is declared a holiday. The Lt. Governor appointed by the Central government is undermining the smooth functioning of the duly elected State government,” the Polit Bureau said.\nThe CPI(M) also criticised the house arrest of various J&K political leaders, including CPI(M)’s Yusuf Tarigami, who were prevented from paying homage to the martyrs. The party demanded that the holiday on Martyrs’ Day be restored “to respect and protect the democratic rights of the people of J&K”. It also demanded an apology from the Lt. Governor for the “assault” on the CM.\nJammu and Kashmir Chief Minister Omar Abdullah jumped over the boundary wall of Mazar-e-Shuhada to recite prayers after he was allegedly stopped by the security forces, in Srinagar on Monday. \n                                                            | Photo Credit: \n                                ANI\nCPI general secretary D. Raja said that the incident was “utterly unacceptable”.\n“This is not just a breach of democratic norms. It’s a blatant assault on our conscience and a reminder of how far governance in J&K has fallen under authoritarian unaccountable rule. CPI demands immediate restoration of statehood — no ifs, no buts — so that the people’s representatives can truly serve, instead of being silenced and subjugated,” he posted on X.\nMr. Abdullah, in a post on X, said that he was blocked from offering prayers at the graves of the martyrs on Sunday, at Naqsbandh Sahib shrine at Khawaja Bazar, where 22 civilians killed during an uprising against the Dogra ruler were buried. The Chief Minister scaled the fenced wall of the premises because the security forces had blocked the entrance of the graveyard. A police officer made a bid to stop him from offering ‘fateha’ at the graveyard."
  }
]